{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c343","uuid":"c162695b-24a0-403b-9e68-876c1f48541d","title":"Sushi Go-Round","slug":"sushi-go-round","published_at":"14 October, 2014","plaintext":"  \n\n  When we were little, we didn’t totally get along a hundred percent of the\ntime. And when we did, we were usually playing on my original Nintendo 64. I\nonly had two games that really interested us – a Winnie the Pooh game and\nPokémon Stadium, and we were obsessed with the mini-games on Pokémon Stadium; we\nused to play them over and over, trying our best to beat the other out. One of\nthe games featured a bunch of Lickatungs swiping sushi off of a rotating table\nwith their gigantic and hilariously gross tongues. At the time, neither of us\nhad eaten sushi, and we used to talk about what it would taste like, and whether\nor not we ourselves could make it. Now, roughly ten years after last playing\nthat game (we held on long after most others had let go) we finally made sushi!\nAnd while we didn’t go around swiping it up with our tongues, we were definitely\ntempted. \n\n  \n\n  The entire process was far easier than we expected, and since we made it at\nhome, we got to mess around a little with our fillings! We just julienned some\nof the vegetables we liked and we were ready to mix and match to our heart’s\ncontent. \n\nVegetables:\nCucumber Carrot Avocado  Asparagus Sweet Potato Mushrooms  Nori (roasted seaweed\n– if you have a preferred brand/type, go with it!)   Obviously, if you don’t\nlike any of these vegetables but do like others, feel free to use those instead!\nWe were planning to use red peppers, and then realized we didn’t have any, so we\njust did without them – it’s really no big deal, especially if you’re just\ncooking for yourself. \n\nCondiments/Toppings:\nSpicy Mayo (we made our own with Sriracha and Mayonnaise) Wasabi Sauce Soy Sauce\n Rice:\nRice Wine Vinegar Sugar Long grain white rice (we used basmati, and it was\nfine!)    The amount of rice you want to make is directly proportional to the\namount of sushi you want to produce; we used about three cups of rice (when\nuncooked) to make about twelve rolls of sushi. If you’re cooking for two to four\npeople, two cups of rice will be more than enough. \n\n  We got a head start with rice we had left over from the day before – rather\nthan making rice again, we just added rice wine vinegar and sugar to it before\nheating it up, and then chilling it. If you have to make rice, though, you can\ndo so either in a pan on the stove or in a rice cooker. In a rice cooker, put in\na 1:2 ratio of rice to water, and let sit for three “screams” of the cooker. If\nyou’re making it in a saucepan, just use similar ratios, stir at the beginning,\nand then leave it alone for about twenty minutes. Once it’s fully cooked, take\nit off the stove and mix in the sugar and vinegar fully – let it chill for a\nlittle while (we stuck it in the freezer to speed that up a bit). \n\n  While your rice is chilling, cut your vegetables into long, thin strips – the\nthinner your strips, the easier it will be to fit multiple fillings in one sushi\nroll, and the easier time you’ll have rolling it at the end. \n\n  Now it’s time to mix your spicy mayo. The making of spicy mayo is largely to\ntaste – we used about one tablespoon of mayo to one teaspoon of sriracha, but\nyou can adjust with more or less sriracha depending on how spicy you like your\nfood. \n\n  Finally, after all this prep, it’s time to get rolling! Set out a towel, set\nyour bamboo mat on top of it, and put a sheet of cling wrap on top of that. If\nyou don’t have a bamboo mat, just set your cling wrap on top of your towel.\nWhile it might be a bit more difficult for you to get the perfect roll, it can\ncertainly done. \n\n  Now, set your nori sheet on top of the cling wrap, spread a thin layer of rice\nover it, and your vegetables at one end on top of your rice. Starting at the end\nwith the vegetables, start rolling the nori carefully so that your veggies are\nat the middle of your roll, making sure the roll is as tight as possible without\nripping the seaweed. You want to have a compact roll with veggies nestled at the\nvery center. \n\n  Rolling is a trial and error activity; my first rolls were far from pretty (in\nfact, we had to eat the piles of rice and seaweed with spoons!) but by the\nfourth or fifth roll, I pretty much had the hang of it. \n\n  Once you’re done rolling your sushi, cut it up into slices about ¾ of an inch\nthick, and set them on a plate. Set all your condiments out, and get ready to\nenjoy your delicious hand-made sushi. \n\n  Bring on the noms!","feature_image":"https://scontent-b-ord.xx.fbcdn.net/hphotos-xpf1/n31.0-8/1941326_10152901018779384_657077737554217091_o.jpg","tags":[{"id":"5c47a6f22037ef002282c22a","name":"sushi","slug":"sushi"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"}]}}]}},"pageContext":{"slug":"sushi","limit":6,"skip":0,"numPages":1,"currentPage":1}}