{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"The Love Child of Pumpkin Pie and Tiramisu","slug":"the-love-child-of-pumpkin-pie-and-tiramisu","feature_image":"https://farm8.staticflickr.com/7398/16297798177_79beaa8237_o.jpg","published_at":"27 February, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7398/16297798177_79beaa8237_o.jpg\" alt=\"\"></p>\n<p>Thanksgiving in our house is quite different that the traditional American Thanksgiving. First off, there's no turkey. Secondly, <a href=\"http://uppukhara.com\">my mom</a> makes a glorious display of Thanksgiving inspired Indian dishes! From masala dosa with cranberry chutney to stuffing upma (or bread upit) and spicy herb yams, we always enjoy a large variety of dishes. The only thing I personally demand every year is pumpkin pie! I love pumpkin pie. The wonderful blend of spices and sweet, and yet it's not that sweet; perfect for someone without a strong sweet tooth!</p>\n<p>What do you get when you combine two of my favorite desserts in the world, pumpkin pie and tiramisu? Basically, it's one of the greatest desserts ever created by man. I was a little skeptical about how well this combination of flavors would be received by all of our thanksgiving guests, but it was a hit. Even without adding the usual brandy, rum, or amaretto, everyone loved the wonderful blend of flavors.</p>\n<p>One warning I have about this recipe is that you should be careful in blending the cornstarch mixture into the pumpkin creme. If this step is not done properly, you will have cornstarch lumps in your tiramisu and that is just gross.</p>\n<p><img src=\"https://farm8.staticflickr.com/7450/16296261980_1c317311c8_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7575/15837079972_56f32edc3e_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7532/15650090328_71473d0b07_b.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Pumpkin Tiramisu</h2>\n    <div class=\"summary\">\n      <p><em>Recipe modified from  http://www.nytimes.com/projects/well/vegetarian-recipes/#recipe/pumpkin-tiramisu</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n        <h4>Pumpkin Creme</h4>\n        <li class=\"ingredient\">⅓ cup cornstarch</li>\n        <li class=\"ingredient\">¼ cup water</li>\n        <li class=\"ingredient\">¾ cup milk</li>\n        <li class=\"ingredient\">1 (15-ounce) can pumpkin puree</li>\n        <li class=\"ingredient\">¾ cup maple syrup</li>\n        <li class=\"ingredient\">¾ teaspoon allspice</li>\n        <li class=\"ingredient\">¾ teaspoon cinnamon</li>\n        <li class=\"ingredient\">¾ teaspoon nutmeg</li>\n        <li class=\"ingredient\">½ teaspoon salt</li>\n        <h4>Tiramisu</h4>\n        <li class=\"ingredient\">1 pot black coffee</li>\n        <li class=\"ingredient\">1 package lady finger biscuits</li>\n        <li class=\"ingredient\">16oz mascarpone cheese</li>\n        <li class=\"ingredient\">ground chocolate for garnishing</li>\n      </div>\n    <!-- </div> -->\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p><strong>To make the Pumpkin Creme:</strong> In a small bowl, thoroughly mix cornstarch and water with a whisk or fork until there are <strong>NO  LUMPS</strong> and set aside. In a medium saucepan, whisk together milk, pumpkin puree, maple syrup, spices and salt, and heat over medium heat until it just begins to boil, about 5 minutes. Slowly drizzle cornstarch mixture into the saucepan, whisking continuously. Cook until the mixture becomes very thick, about 5 minutes, whisking frequently. Pour the creme into a bowl and let cool about 15 minutes. Cover the bowl with plastic wrap so that the plastic wrap is touching the top of the creme. Refrigerate for a few hours or overnight.</p><p><strong>To assemble:</strong> Soak each lady finger biscuit in coffee for a few seconds and quickly place in a large dish. Spread a layer of Pumpkin Creme on top. Repeat this process for as many layers fill up the dish or all the components run out. Alternate spreading a layer of Pumpkin Creme and mascarpone cheese between layers of biscuit.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm9.staticflickr.com/8632/16297442359_be80bb9139_b.jpg\" alt=\"\"></p>\n","plaintext":"\n\nThanksgiving in our house is quite different that the traditional American\nThanksgiving. First off, there's no turkey. Secondly, my mom\n[http://uppukhara.com]  makes a glorious display of Thanksgiving inspired Indian\ndishes! From masala dosa with cranberry chutney to stuffing upma (or bread upit)\nand spicy herb yams, we always enjoy a large variety of dishes. The only thing I\npersonally demand every year is pumpkin pie! I love pumpkin pie. The wonderful\nblend of spices and sweet, and yet it's not that sweet; perfect for someone\nwithout a strong sweet tooth!\n\nWhat do you get when you combine two of my favorite desserts in the world,\npumpkin pie and tiramisu? Basically, it's one of the greatest desserts ever\ncreated by man. I was a little skeptical about how well this combination of\nflavors would be received by all of our thanksgiving guests, but it was a hit.\nEven without adding the usual brandy, rum, or amaretto, everyone loved the\nwonderful blend of flavors.\n\nOne warning I have about this recipe is that you should be careful in blending\nthe cornstarch mixture into the pumpkin creme. If this step is not done\nproperly, you will have cornstarch lumps in your tiramisu and that is just\ngross.\n\n\n\n\n\n\n\nPumpkin Tiramisu\nRecipe modified from\nhttp://www.nytimes.com/projects/well/vegetarian-recipes/#recipe/pumpkin-tiramisu\n\nIngredients:\nPumpkin Creme\n⅓ cup cornstarch\n ¼ cup water\n ¾ cup milk\n 1 (15-ounce) can pumpkin puree\n ¾ cup maple syrup\n ¾ teaspoon allspice\n ¾ teaspoon cinnamon\n ¾ teaspoon nutmeg\n ½ teaspoon salt\n Tiramisu\n1 pot black coffee\n 1 package lady finger biscuits\n 16oz mascarpone cheese\n ground chocolate for garnishing\n Directions:\nTo make the Pumpkin Creme:  In a small bowl, thoroughly mix cornstarch and water\nwith a whisk or fork until there are NO LUMPS  and set aside. In a medium\nsaucepan, whisk together milk, pumpkin puree, maple syrup, spices and salt, and\nheat over medium heat until it just begins to boil, about 5 minutes. Slowly\ndrizzle cornstarch mixture into the saucepan, whisking continuously. Cook until\nthe mixture becomes very thick, about 5 minutes, whisking frequently. Pour the\ncreme into a bowl and let cool about 15 minutes. Cover the bowl with plastic\nwrap so that the plastic wrap is touching the top of the creme. Refrigerate for\na few hours or overnight.\n\nTo assemble:  Soak each lady finger biscuit in coffee for a few seconds and\nquickly place in a large dish. Spread a layer of Pumpkin Creme on top. Repeat\nthis process for as many layers fill up the dish or all the components run out.\nAlternate spreading a layer of Pumpkin Creme and mascarpone cheese between\nlayers of biscuit.","tags":[{"id":"5c47a6f22037ef002282c238","name":"tiramisu","slug":"tiramisu"},{"id":"5c47a6f22037ef002282c240","name":"pumpkin","slug":"pumpkin"},{"id":"5c47a6f22037ef002282c241","name":"thanksgiving","slug":"thanksgiving"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}},"pageContext":{"slug":"the-love-child-of-pumpkin-pie-and-tiramisu","previous":{"html":"<p><img src=\"https://farm3.staticflickr.com/2947/15238764929_dee408af1f_b.jpg\" alt=\"\"></p>\n<p>When I was younger, my family rarely did breakfast all together; on weekdays we were all rushing around, and on weekends we would all emerge from our rooms at our own times, grazing on whatever acceptable breakfast food was around. For many years, breakfast on Saturday meant spending the entire morning alone on the couch, watching cartoons, dodging my mother's attempts to make me a productive citizen, and eating sugary cereal with abandon. Occasionally, we would have guests and my mother would cook some traditional Indian breakfast items - dosa, roti, upma, etc. - and we would have brunch. But these days were usually paired with pre and post cleaning and formal clothing, so while we loved the company, the whole situation was no bueno.</p>\n<p>It wasn't until I got to college that I really understood brunch. On our campus, Landon dining hall had the most amazing brunch you can imagine - everything from ice cream to omelettes to fresh fruit and berries was represented, and you could literally eat your heart out. In addition to that, we lived in close proximity to Golden Harvest, a small brunch area in Lansing that has a following that borders on obsessive. In East Lansing, brunch does not just pass you by, and from the minute I stepped into Landon, with a slight headache and stomache, craving grease and comfort food, I was a convert.</p>\n<p><img src=\"https://farm9.staticflickr.com/8656/16296194440_27d1c24829_b.jpg\" alt=\"\"></p>\n<p>Brunch is neither breakfast nor lunch; it's an in between meal, and as such, doesn't have the conventions of the other two. You can enjoy some giggle juice with brunch. You can dip strawberries in chocolate and throw it on a waffle with sugar and it won't count as dessert. You can show up all smelly at your best friend's house at eleven o'clock, post late wake up call and workout, demand eggs, toast, and avocados, and call THAT brunch.</p>\n<p>You can wake up at eight AM and race to Golden Harvest, wait in line for over an hour and a half in the freezing cold, and earn your brunch. Or you can have a lie in at home and make yourself some waffles or toast and watch television, and it could be the most lovely brunch you'll ever have.</p>\n<p><img src=\"https://farm8.staticflickr.com/7560/15811864496_20a9e2f76e_b.jpg\" alt=\"\"></p>\n<p>Brunch is the most welcoming of the meals.</p>\n<p>Brunch is patient, brunch is kind. It does not envy, it does not boast, it is not proud. It is not rude, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Brunch does not delight in evil but rejoices with the truth. It always protects, always trusts, always hopes, always perseveres. Brunch never fails.*</p>\n<p>Brunch is love, y'all. Show someone a little love and pan fry some potatoes and throw a poached egg on top. Give yourself a little treat and stick an overeasy fried egg in a sandwhich with some mixed greens and tomatoes. Use avocado liberally, and consider experimenting with sriracha and truffle oil. Kale and white sugar are both invited to this party, because brunch does not discriminate.</p>\n<p>Let your creative juices and chocolate sauce flow; brunch is a meal without protocol or limitations, and you definitely deserve that business in your life.</p>\n<p><img src=\"https://farm6.staticflickr.com/5612/15837068312_eeff7d20e1_b.jpg\" alt=\"\"></p>\n<p>*I took some creative licenses with Corinthians 13:4-8a. I did it with utmost respect for the original verse.</p>\n","title":"Brunch Conquers All","slug":"brunch-conquers-all","published_at":"14 February, 2015","feature_image":"https://farm6.staticflickr.com/5612/15837068312_eeff7d20e1_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c23b","slug":"eggs"},{"id":"5c47a6f22037ef002282c23c","slug":"hash"},{"id":"5c47a6f22037ef002282c23d","slug":"brunch"},{"id":"5c47a6f22037ef002282c23e","slug":"sandwich"},{"id":"5c47a6f22037ef002282c23f","slug":"breakfast"},{"id":"5c47a6f22037ef002282c24e","slug":"love"},{"id":"5c47a6f22037ef002282c2a4","slug":"valentines-day"}]},"next":{"html":"<p><img src=\"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg\" alt=\"\"></p>\n<p>For the few weeks, I've been bored at home while my parents are away at work. I've been taking some time off between graduation and when I start work next month. So when one of my friends was also bored at home during her spring break, she decided to come over and join me in being a bum for a day. And what better food to have while lazing around then some Mexican loaded fries.</p>\n<p><img src=\"https://farm9.staticflickr.com/8616/16520615948_6bcba795e9_b.jpg\" alt=\"\"></p>\n<p>Feel free to use sour cream instead of ranch or even add guacamole and other toppings you usually put on nachos! We didn't really want to leave the house and go grocery shopping, so we went with whatever was in the fridge. I usually make my own mexican seasoning, but feel free to replace the spices with a store bought seasoning if you want.</p>\n<p><img src=\"https://farm9.staticflickr.com/8585/16708189875_07f14b40ee_b.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>Mexican Loaded Fries</h2>\n    <div class=\"summary\">\n      <p><em>This is a very rough recipe. Feel free to throw in whatever you feel would taste best!</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n        <li class=\"ingredient\">½ bag of fries (I used crinkle cut)</li>\n        <li class=\"ingredient\">ranch (or sour cream)</li>\n        <li class=\"ingredient\">as much shredded cheese as you want</li>\n      \t<h4>Refried Beans</h4>\n        <li class=\"ingredient\">1 can black beans</li>\n        <li class=\"ingredient\">1½ teaspoons cumin powder</li>\n        <li class=\"ingredient\">1 teaspoon paprika</li>\n        <li class=\"ingredient\">salt to taste</li>\n        <li class=\"ingredient\">cayenne pepper to taste</li>\n        <li class=\"ingredient\">chili lime hot sauce to taste (optional)</li>\n      \t<h4>Pico De Gallo Salsa</h4>\n        <li class=\"ingredient\">3 roma tomatoes diced</li>\n        <li class=\"ingredient\">½ large onion diced</li>\n        <li class=\"ingredient\">juice of ½ a lime</li>\n        <li class=\"ingredient\">salt to taste</li>\n        <li class=\"ingredient\">few sprigs of cilantro </li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p><strong>Refried Beans:</strong> Pour the black beans onto a skillet on the stove. Add all of the spices and keep stirring until the beans are soft and are super flavorful.</p>\n        <p><strong>Salsa:</strong>Mix all the ingredients in a bowl and let it sit so that the salt and lime can bring out the flavor in the tomatoes.</p>\n        <p>Bake the fries according to the directions on the packet. When the fries are done, don't turn off the oven. Top with the bean mixture and sprinkle all the cheese that your heart desires. Bake the topped fries in the oven until the cheese has melted. Take out the fries and top with salsa and ranch. Dig in!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm9.staticflickr.com/8643/16500861107_eaf23d7f64_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8578/16706850181_8b7f0f3366_b.jpg\" alt=\"\"></p>\n","title":"DAMN SON, Those are Some Seriously Loaded Fries","slug":"damn-son-those-are-some-seriously-loaded-fries","published_at":"10 March, 2015","feature_image":"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","slug":"fries"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","slug":"salsa"},{"id":"5c47a6f22037ef002282c25f","slug":"beans"},{"id":"5c47a6f22037ef002282c260","slug":"appetizers"},{"id":"5c47a6f22037ef002282c261","slug":"loaded"}]}}}