{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35a","uuid":"015353ea-56fa-417c-983c-c5350fb3c81a","title":"Sweet Potato Pie","slug":"sweet-potato-pie","published_at":"25 January, 2016","plaintext":"I made some sweet potato pie today.\n\n\n\nThis was my second time making this dessert, and I made it in a more or less\nsimilar way.\n\nThe first time I made it, I bragged to my housemate, and he asked me if my\nmaking a sweet potato pie was cultural appropriation, and I had no idea, because\nI had no idea sweet potato pie was a thing that black people did. To be honest,\nI thought it was an all-American thing (immigrant probs, amirite?) So I\nresearched - and I found out that historically, sweet potato pie was a food\nslaves made in the south. And I had no idea until I made it and someone else\ncalled me out on it!\n\n\n\nHere's the thing about cultural appropriation in food - it happens ALL THE TIME.\nPeople love to take foods from other cultures - frequently every day,\ncommonplace foods - and remake them with slight tweaks and giant price tags. So\nhow do you avoid it? I personally advocate for research.\n\nI think it's important to know where the food you're making comes from,\nespecially when you're modifying it. I tend to modify a lot of recipes to make\nthem vegetarian or vegan, but I try to do it in a way that feels as respectful\nto me as possible.\n\nI think there's space in food for innovation, but it has to be accompanied by\nrespect for the important place that food has in culture.\n\nSo, the moral of this story? Don't appropriate. Don't glorify the food of\nanother culture without trying to understand that culture itself. Accept that\nyou'll probably be clueless even with additional information, and do your best\nto be respectful.\n\nAnd also, have some pie.\n\n\n\nSweet Potato Pie\nThis is a filling dessert. You could tell yourself it's healthy because it has a\nvegetable as a filling, but let's be real - this is not a healthy dessert. And\nthat's a good thing - sometimes dessert just needs to be decadent.\n\nYield: 1 Pie\n\nTotal Time:  2 hours active cooking time\n\nIngredients:\nPie Crust\n3 C Flour\n 1 Tsp Salt3/4 C Coconut OilIce water, as needed\n Sweet Potato Filling\nThree Medium Sweet Potatoes\n 1 C Coconut Milk Liquid or 1/2 C Almond ButterMaple Syrup, to taste1 1/2 Tsp\nCinnamon1/2 Tsp Cardamom1/2 Tsp Pumpkin Pie Spice1 Tsp Vanilla Extract1 Tsp\nOrange Extract\n Directions:\n\n1.) The pie crust recipe is the same dough as that of my [Love\nTriangles](http://cookinginpjs.com/love_triangles/) from last week. The first\ntime I did it, I added a little bit too much ice water - perhaps a couple\ntablespoons too much - and I wound up with a loose dough I didn't want to add\nmore flour to. So that time, I rolled it out hastily, trying not to handle it\ntoo much to avoid the coconut oil melting prior to baking. This time I managed\nto avoid that pitfall, and carefully added only as much water as was necessary,\nresulting in a soft, elastic, and close-to-perfect dough. I recommend prepping\nand chilling that before you do anything else.\n\n\n2.) I went the simple route; I chopped the sweet potato small, into pieces about\na half inch wide. After you do that, douse them in spices and throw them in the\noven until they are melt-in-your-mouth cooked. Or, you know, about thirty\nminutes.\n\n\n3.) Mashed them, add maple syrup, the some almond butter, or the liquid from a\ncan of coconut milk for creaminess, and your spices and extracts. You want to\nmake sure it isn't too sweet, tasting every time you add a new ingredient to -\nahem - \"assess quality.\" Make sure that the pie isn't so sweet that you can't\ntaste the sweet potato. The goal is to enhance it so it can be the star, not\nmask it.\n\n\n4.) Preheat the oven to 375 F. Take out your pie dough which has, of course,\nchilled for at least four hours at this point, and roll it out gently. Set it\ninto a pie pan/tin, and crimp the edges however you're like. Reserve the cut off\nbits to create a decoration for your pie. Pop the crust in the oven for about\nfifteen minutes.\n\n\n5.) After the pie crust has baked for about fifteen, take the pie out of the\noven and layer in your filling. You want it to be up until the rim of the pie\npan - this filling won't expand, so you can fill it right up. Put the pie back\nin the oven for about twenty minutes.\n\n\n6.) In the meantime, roll out your spare dough and get creative! I went the way\nof stars and diamonds because those are the cookie cutters I found, but the\nworld is your oyster. When twenty minutes have passed, take your pie out of the\noven and carefully place the decorations on top. Put it back in for another 20\nminutes. Proceed to turn on the oven light and watch excitedly, as I did (I\nthink I mistook it for a television).\n\n\n7.) After another twenty minutes have passed, increase the oven temperature to\n400 F, and place your pies on the top rack - I like my top crust to be a little\nbrown, and this makes that happen!\n\n\n8.) Take your pie out of the oven and serve it up! I loved it with a dollop of\ncoconut whipped cream, but it would likely also taste good with ice cream, or\nnormal whipped cream, or any manner of things. It was also excellent all on its\nown.","feature_image":"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c3","name":"sweetpotato","slug":"sweetpotato"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c2bc","name":"pastry","slug":"pastry"},{"id":"5c47a6f22037ef002282c2c4","name":"piecrust","slug":"piecrust"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"slug":"piecrust","limit":6,"skip":0,"numPages":1,"currentPage":1}}