{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35e","uuid":"28e9fca4-1790-4afe-9663-c046b09f3043","title":"FoodChella","url":"https://cookinginpjs.herokuapp.com/foodchella/","published_at":"04 May, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg\" alt=\"\"></p>\n<p>So I was terribly sick last week whilst recovering from Coachella so I've decided to treat you guys with not one but TWO whole posts! I know right?! So awesome. You can thank me later. AND to make things better... instead of sharing just a single song... I'm going to gift you with a whole playlist of my favorite songs from Coachella!</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify%3Auser%3A1217494097%3Aplaylist%3A7vHswNAsv4lLIjCNrjvzeZ\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>So very typical of me, I didn't double check my flight timings when booking so I ended up flying out to LAX a whole 10 hours before the rest of my group. I decided to start the trip out right, eggs Benedict and a mimosa at the airport with a side of Gilmore Girls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/egnkhg8zefh3rl0xkh1co74s074cr4c0.jpg\" alt=\"\"></p>\n<p>Usually 10 hours stranded at an airport is a bummer, but there are worse places to get stranded than LAX. It kind of ended up working out for me because I took my camera and explored! I walked from Santa Monica Pier to Venice Beach and soaked in the gorgeous SoCal sun.</p>\n<p>In Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously, probably the best I've ever had in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/0i02gxp1jckp0svdv6cu8wi5ewctzsvm.jpg\" alt=\"\"></p>\n<p>In Venice Beach, I decided to have a lighter option and enjoyed some Burrata and Beets at Larry's Bar &amp; Grill.</p>\n<p><img src=\"https://pramods.box.com/shared/static/6dynwvyb7q9fon9luvmogmd3wbei2szk.jpg\" alt=\"\"></p>\n<p>The most adventurous meal was at dinner with a friend at Wurstküche. We enjoyed some cold beers and Rattlesnake Sausages. It honestly didn't taste much different from other sausages and was actually pretty good but I can't say I'd comfortably eat that again.</p>\n<p><img src=\"https://pramods.box.com/shared/static/aypjyy5024v7hcfqhqa4dwl3x6injkm7.jpg\" alt=\"\"></p>\n<p>The weekend was filled with new musical obsessions, including Zhu &amp; Flume (seriously check out that playlist ^), new friends, delicious eats, and lots and lots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the unfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon, Sean Paul, and Nico&amp;Vinz during Matoma's set.</p>\n<p><img src=\"https://pramods.box.com/shared/static/duq94s8q18b3qklwj730gkuu2l5szcpm.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/ie4gkxnr4yruv5grnjyaya1iunyoj6pm.jpg\" alt=\"\"></p>\n<p>I came back home the following Monday sunburned (what happens when you wander around LA without sunscreen) and exhausted out of my mind; Cue sickness.</p>\n<p>This was my first year attending Coachella, every instagrammer's and basic bitch's haven. Of course I had to have ONE basic picture myself to commemorate the experience.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z7gfp3dlql2f2wag911y4lvsznp2q06v.jpg\" alt=\"insert basic watermelon picture here\"></p>\n<p>Coachella is also a GREAT place for foodies. While you needed to be a VIP to get access to some of the tastiest and more exclusive food, there was plenty of delicious options to spare. Looking back at my food photos, I realize that I basically survived off fries. Just fries. And obviously watermelon, because it IS Coachella. But these fries were no ordinary fries my friends. They were all loaded with various toppings and delicious goodness.</p>\n<p>Veggie Monster Fries with lots of types of slaw and jalapeños!<br>\n<img src=\"https://pramods.box.com/shared/static/z4ge00bngygbfezcdyv3x4gdsve5p72u.jpg\" alt=\"\"></p>\n<p>Vegetarian Poutin Fries with cheese curds!<br>\n<img src=\"https://pramods.box.com/shared/static/uyr9jkumf8n2a6mzue6bxdrimbfblro2.jpg\" alt=\"\"></p>\n<p>Crab Fries! This meant crab aioli AND crab topping! Double yum!<br>\n<img src=\"https://pramods.box.com/shared/static/bcjeq6dasdfv4jbihq44hhsudjks88eh.jpg\" alt=\"\"></p>\n<p>Chicharones Fries with Sriracha and curry aioli!<br>\n<img src=\"https://pramods.box.com/shared/static/2uta04ogd3ap0dy1aw8ya7xit7ocqvul.jpg\" alt=\"\"></p>\n<p>I honestly have no idea how most of these things were made but my stomach was hella happy. :)</p>\n","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","tags":[{"id":"5c47a6f22037ef002282c321","name":"coachella","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","name":"poutin","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","name":"crab","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","name":"chicharones","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","name":"music","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","name":"venice beach","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","name":"santa monica","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","name":"LA","slug":"la"},{"id":"5c47a6f22037ef002282c329","name":"rattlesnake","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","name":"burrata","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c360","uuid":"bd3e7708-eadc-4969-886c-47fdd2138304","title":"How to do a food crawl","url":"https://cookinginpjs.herokuapp.com/food-crawl/","published_at":"25 April, 2016","html":"<p>I'm sure most of y'all have been on a bar crawl - you have a list of bars, and you hit them up one after the other, sipping a little of this and a little of that at each one.</p>\n<p>This is similar, but with FOOD. While you are certainly welcome bring booze into the mix, these are instructions for figuring out an all food crawl; it's an excellent way to explore a new city!</p>\n<p>It's also a really good way to spend a couple of hours with friends without spending a ton of money; if you're on a budget, this is a great way to try lots of different food, and see quite a bit, without breaking the bank. We each paid for one entree at one place, and it came out perfectly for us!</p>\n<p>First, you need a walkable city. I myself did this with my friends Eden and Hafsa in San Francisco, the day I last left Sumu.</p>\n<p><img src=\"https://pramods.box.com/shared/static/nswhwh2moi2lyt9ett886237vfike5xh.jpg\" alt=\"\"></p>\n<p>Second, do some preliminary research. Don't actually choose all the places you want to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff you're interested in exploring. We found ourselves wandering around the Mission District, ogling wall art and talking about gentrification.</p>\n<p>Third, set off on your journey! Start with a place you know you want to go to; we started with Philz Coffee, which also let us sip and wander for a bit before we found real food.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg\" alt=\"\"></p>\n<p>Over the course of the next several hours, we tried Thai food, Mexican food, Vietnamese food, and, finally, Ethiopian food. At each place, we would choose one entree to share, so that in the end, we all got to try tons of yummy food for relatively little!</p>\n<p>We were having so much fun we failed to take a lot of pictures, but this is definitely one of those days that I'll be remembering for quite a while! If you do a food crawl, let me know how it goes!</p>\n<p>And, if you're in DC or San Francisco and you're interested in doing this, hit Sumu or I up! We'd love to have you :)</p>\n","feature_image":"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c250","name":"thai","slug":"thai"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c31b","name":"betterlate","slug":"betterlate"},{"id":"5c47a6f22037ef002282c31c","name":"than never","slug":"than-never"},{"id":"5c47a6f22037ef002282c31d","name":"monday","slug":"monday"},{"id":"5c47a6f22037ef002282c31e","name":"food crawl","slug":"food-crawl"},{"id":"5c47a6f22037ef002282c31f","name":"ethiopian","slug":"ethiopian"},{"id":"5c47a6f22037ef002282c320","name":"mission","slug":"mission"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36b","uuid":"8abb8e5a-35f6-448b-a1d9-8decec1d3d4d","title":"Vidhyarthi Bhavan","url":"https://cookinginpjs.herokuapp.com/vidhyarthi-bhavan/","published_at":"01 February, 2016","html":"<p>I'm feeling homesick today. A year ago, I was in India, probably eating chaat (Indian street food), or taking pictures of my cousins while they danced around with stuffed animals.</p>\n<p><img src=\"https://pramods.box.com/shared/static/jvexx1342qglctv9kb1ta3zhtc6tqmsc.jpg\" alt=\"You're missing a picture of a SUPERCUTE baby\"></p>\n<p>I miss India a lot. I always loved visiting my family there, and going for eight months was one of the most valuable times in my life. I loved every minute of it.</p>\n<p>This is a post about a breakfast place in Bangalore, Karnataka, India that everyone goes to. I hope you enjoy it as much as I did.</p>\n<hr>\n<p><img src=\"https://pramods.box.com/shared/static/2xh4t94tv5kvay59fg04rz4uoczsmdsi.jpg\" alt=\"\"></p>\n<p>Every city has this restaurant. It's not classically pretty, and there's no one waiting at the door to see whether or not you want to come in. This is a place where you have to leave your diet at the door (no one has any idea how many calories/protein grams/vats of butter are in your food anyway). The waiters are inattentive enough that a newcomer would have left on the spot, and there are literally never enough seats. There are a few places like this in Bangalore (in a city this big, with this much traffic, you need multiple choice breakfast spots), but Vidhyarthi Bhavan is arguably one of the most delicious.</p>\n<p>It's packed to the brim every day; I went on a Monday morning, and we had to stand behind people to snake their seats. And after we ate, people were standing behind us to snake ours. The restaurant is famous for it's Masala Dosa, although there are a couple of other items on the menu if you're interested.</p>\n<p>While you wait for your order, there are gorgeous photos of Mount Kailash, and really interesting pencil sketches of famous poets and writers of India adorning the walls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7opvixkr40x5e2k575lrbpy8rqnqnf1f.jpg\" alt=\"\"></p>\n<p>There's plenty of fodder for people watching, if the smells wafting from the kitchen aren't enough to keep you totally occupied. Finally, your order comes out.</p>\n<p>The dosas come to you on plates piled high in the waiter's arms (you have a brief moment where you are concerned that the bottom of someone else's plate has been all over your food); the waiter never actually looks at you before he heads to the next table. Then a second waiter, arguably less attentive than the first, comes over with a tureen of coconut, cilantro, and mint chutney and pours it onto your plate.</p>\n<p>You dig in with your fingers, barely resisting the urge to just dig in with your whole face. Finishing one of these babies is a task and a half, but you are definitely up to the challenge; going, going...gone.</p>\n<p><img src=\"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg\" alt=\"yummy yummy masale dosa!\"></p>\n<p>Finally, you get a cup of some excellent filter coffee to finish you right off, before you stumble into the daylight, and onto a street lined with flower and fruit merchants.</p>\n<p>You amble along, sniffing deeply and enjoying the almost-too-full-but-not-quite feeling in your stomach, and all feels right with the world.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7orlyigfozthf1tuoxjuo4cmt4etxsxh.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg","tags":[{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ca","name":"masala dosa","slug":"masala-dosa"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c2cb","name":"indian food","slug":"indian-food"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2cd","name":"bangalore","slug":"bangalore"},{"id":"5c47a6f22037ef002282c2ce","name":"vidhyarthi bhavan","slug":"vidhyarthi-bhavan"},{"id":"5c47a6f22037ef002282c2cf","name":"nostalgia","slug":"nostalgia"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34f","uuid":"7e8c442d-4c8d-4c6b-8667-33acc5c95e1a","title":"The Glorious Monstrosities of Frita Batidos","url":"https://cookinginpjs.herokuapp.com/frita-batidos/","published_at":"27 March, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7651/16863218825_882de53cd6_b.jpg\" alt=\"\"></p>\n<p>Frita Batidos is one of the crown jewels of Ann Arbor, MI.  It is a small cuban street food restaurant in downtown Ann Arbor. While it may be a slight walk from the University of Michigan campus, many students make the trek despite any ridiculous weather conditions to get a bite of these burgers.</p>\n<p>They have the one of the most delicious, insanely huge and jam packed burgers I’ve ever eaten in my life. No matter the patty you want inside your burger, whether it be black bean, chicken, or chorizo, you’re bound to get a tasty concoction which will blow your mind. Honestly I have yet to meet a person at the University of Michigan who doesn’t like their burgers.</p>\n<p>The basic burger (or Frita) is simple, just the patty between two egg buns and stuffed with fries. I also added some cilantro-lime salsa and tropical slaw to juice it up a little. Safe to say, I don’t think I would be trying to impress anyone while eating this monstrosity.</p>\n<p><img src=\"https://farm8.staticflickr.com/7598/16243253993_f6b6d7018a_b.jpg\" alt=\"\"></p>\n<p>My brother always goes with a sunny side up egg and avocado spread on his frita. As soon as you bite into the burger, the yolk bursts, spreading that wonderful flavor into every bite thereafter.</p>\n<p><img src=\"https://farm9.staticflickr.com/8679/16837349936_c34c5ef899_b.jpg\" alt=\"\"></p>\n<p>This trip to Frita Batidos was special because we brought one of my friends here for her first time. She decided to go big or go home and made her frita “loco.” This means that they just go “loco” and add ALL of their available toppings on top of your burger: muenster, a sunny side up egg, cilantro lime salsa, tropical slaw, AND avocado spread! This is pretty much the mother of all burgers. I mean its GINORMOUS. My friend wasn’t even able to attempt to eat this with her hands. But oh was it delicious.</p>\n<p><img src=\"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg\" alt=\"\"></p>\n<p>Don’t get me started on their garlic-cilantro fries. Frita Batidos has some of the simplest yet most amazing fries I’ve had.  I can’t even describe them, you have to try them yourself!</p>\n<p><img src=\"https://farm8.staticflickr.com/7588/16863220175_acd3bd5a0b_b.jpg\" alt=\"\"></p>\n<p>If you are ever in Ann Arbor <strong>MAKE SURE</strong> you head to downtown to taste one of these monstrosities, these glorious monstrosities of Frita Batidos.</p>\n<p>Check them <a href=\"http://www.fritabatidos.com\">out</a>!</p>\n","feature_image":"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c263","name":"frita batidos","slug":"frita-batidos"},{"id":"5c47a6f22037ef002282c264","name":"burgers","slug":"burgers"},{"id":"5c47a6f22037ef002282c265","name":"cuban","slug":"cuban"},{"id":"5c47a6f22037ef002282c266","name":"garlic","slug":"garlic"}]}}]}},"pageContext":{"slug":"eating-out","limit":6,"skip":0,"numPages":1,"currentPage":1}}