{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Well Son, When a Croissant Loves a Donut...","slug":"well-son-when-a-croissant-loves-a-donut","feature_image":"https://lh3.googleusercontent.com/I3bLdLcbLHBZH2QIeDqAX55etYu-5I1Tz94-7LJ62KRW=s800","published_at":"27 June, 2015","html":"<p><img src=\"https://lh3.googleusercontent.com/I3bLdLcbLHBZH2QIeDqAX55etYu-5I1Tz94-7LJ62KRW=s800\" alt=\"\"></p>\n<p>(Here's some music for inspiration :P)</p>\n<center><iframe src=\"https://app.box.com/embed/preview/gikip2erk4a5j2s4xjw690991hof3s9v?view=&sort=&direction=ASC&theme=light\" width=\"100%\" frameborder=\"0\" allowfullscreen webkitallowfullscreen=\"\" msallowfullscreen=\"\"></iframe></center>\n<p>In 2013, New York was swept over with a new kind of fever.... Cronut Fever. A chef in New York City decided that he would take croissant dough and fry it like a donut. This scrumptious flaky dessert became <strong>SO</strong> popular that there was even a black market for them! People would pay $100 on the black market for a cronut that could be bought for $5 if they waited in line for a day.</p>\n<p>I'd never tasted a cronut before in my life, so I decided to make use of a bunch of stale croissants I had lying around after a road trip. I tore the croissants into bite size pieces and fried them in hot oil and count to 4. Quickly flip each cronut and fry again for 4 counts. Make sure not to cook them for too long or they get a little too crunchy and burn.</p>\n<p><img src=\"https://lh3.googleusercontent.com/uItKVRYVHXTTy-8axm084k_HfxLO6xzEZdPLVsRCD4KB=w1976-h1316-no\" alt=\"\"></p>\n<p>Place the fried bites onto paper towels to drain any excess oil. When cooled, drizzle with any icing of your choice or enjoy them by themselves!</p>\n<p>They were flaky yet crunchy, salty yet buttery. It was amazing! I completely understand what the fuss was in New York City at the time.</p>\n<p><img src=\"https://lh3.googleusercontent.com/t7G8JSAQTWhF4tYo7phZ4pW0JmJUR3wW9tfbTtKWJiYd=s800\" alt=\"\"></p>\n<p><img src=\"https://lh3.googleusercontent.com/jSVFKsebGkxhYqNYuiNsVIhtieIrE3c0NZTu-IJJw5VK=w1976-h1316-no\" alt=\"\"></p>\n<p>However, I learned a few things while making these. Making them with store-bought croissants is fine, however you get the proper ratio of flakiness to fried crunchiness when you use croissant dough. It is also easier not to burn them while frying when you use dough. I am not a huge fan of too much oil, so frying the croissants wasn't my favorite. Maybe there's a way to shallow fry them where they won't pick up too much oil, but I have no idea. Next time I try making cronut bites, I will try to bake store-bought croissants and see if that makes a difference. Who knows!</p>\n<p>For the mean time, I completely suggest you try making these at home! They're simple to make and taste amazing! If you're too lazy then I'd recommend going to your local pastry shop and seeing if they make something similar!</p>\n<p><img src=\"https://lh3.googleusercontent.com/_h3gaGiFbUHaUe_a9dnjOu6yMLoZv8oXEt19I2f1god5=w1976-h1316-no\" alt=\"\"></p>\n","tags":[{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c283","name":"cronut","slug":"cronut"},{"id":"5c47a6f22037ef002282c284","name":"fried","slug":"fried"},{"id":"5c47a6f22037ef002282c285","name":"croissant","slug":"croissant"}]}},"pageContext":{"slug":"well-son-when-a-croissant-loves-a-donut","previous":{"html":"<p><img src=\"https://farm9.staticflickr.com/8772/17361867465_b5793fb7f7_b.jpg\" alt=\"\"></p>\n<p>I LOVE baking but since I don't really like eating desserts its usually pretty hard to come up with reasons to actually make anything. I usually just end up making really small quantities which barely justifies all the ingredients I would have needed to get to make the desserts. At work I noticed that anytime someone brought in donuts or anything else, people would hunt the food down and devour it. Figuring this the was the best opportunity to kill two birds with one stone, so I whipped up a few batches of the brownies and brought them to work.</p>\n<p>First, I sent an email to my team and only a few people grabbed some. I thought I had made a complete mistake making so many brownies, or maybe I was delusional about how the brownies tasted since I had made them. As a last option, I sent an email out to the whole company and left them in the common area of my floor. Twenty minutes later when I went to go check on them, I saw an empty box. Clearly the brownies had been a huge hit! Now that I've found the perfect group to sample all of my treats, I can bake without worries! My coworkers can expect a flood of baked goods at least once a month from here on out while I use them as guinea pigs for all the different desserts I've always wanted to make! :)</p>\n<p><img src=\"https://farm8.staticflickr.com/7711/17154413587_86e925b5aa_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7766/16741602133_ec8f6f5fc7_b.jpg\" alt=\"\"></p>\n<p>Personally, I'm not a huge fan of cheesecake, but these little bites are amazing. At first when I bit into one, it was perfectly gooey and chocolatey and with a little bit of cheesecake to top off the flavor. I honestly wasn't sure if I hadn't cooked them all the way, but after thoroughly inspecting and devouring a few, I realized that that's just the way the brownies cook! Each brownie was perfectly gooey yet filled with flavors just melting in your mouth. The cheesecake portion was the perfect compliment for the sweetness of the brownies. Try the recipe yourself and let me know how you like it!</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>Chocolate Chip Cheesecake Brownie Bites</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <h4>Brownie Part:</h4>\n      <li class=\"ingredient\">¾ cup melted unsalted butter</li>\n      <li class=\"ingredient\">1¼ cup sugar</li>\n      <li class=\"ingredient\">1 cup unsweetened cocoa powder</li>\n      <li class=\"ingredient\">¼ tsp salt</li>\n      <li class=\"ingredient\">1 tsp vanilla extract</li>\n      <li class=\"ingredient\">2 large eggs</li>\n      <li class=\"ingredient\">½ cup all-purpose flour</li>\n      <li class=\"ingredient\">¾ cups semi-sweet chocolate chips</li>\n      <h4>Cheesecake Part:</h4>\n      <li class=\"ingredient\">8 oz softened cream cheese</li>\n      <li class=\"ingredient\">½ cup sugar</li>\n      <li class=\"ingredient\">¼ tsp vanilla extract</li>\n      <li class=\"ingredient\">1 egg yolk</li>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Preheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and keep it aside. I used a mini cupcake pan but feel free to use a normal size cupcake pan if you want bigger brownies!</p>\n        <p><strong>Brownie Part: </strong>Mix the cocoa, sugar, salt, melted butter, and vanilla together. Mix the eggs into this mixture until the batter is fully mixed. Add the chocolate chips (more if you want it super chocolatey :D) and keep aside.</p>\n        <p><strong>Cheesecake Part: </strong>In a separate bowl, mix all the cheesecake ingredients together until smooth.</p>\n        <p>Fill each well in your cupcake pan ¾ full with brownie batter. Add a spoonful of cheesecake batter on top of the brownie batter in each well and swirl the cheesecake and brownie parts together! Put the pan in the oven and bake for about 20 minutes (I used a 24 mini cupcake pan so it was 20 minutes for me but if you have use a smaller/larger pan adjust the time accordingly). </p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm9.staticflickr.com/8770/16741596333_b8c6088247_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8887/17335899916_10f36cfbeb_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7699/17335896446_efebc5dfbc_b.jpg\" alt=\"\"></p>\n","title":"Little Bites of Heaven","slug":"little-bites-of-heaven","published_at":"05 May, 2015","feature_image":"https://farm9.staticflickr.com/8772/17361867465_b5793fb7f7_b.jpg","tags":[{"id":"5c47a6f22037ef002282c255","slug":"desserts"},{"id":"5c47a6f22037ef002282c272","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c273","slug":"brownies"},{"id":"5c47a6f22037ef002282c274","slug":"mini"},{"id":"5c47a6f22037ef002282c275","slug":"swirl"}]},"next":{"html":"<center><iframe src=\"https://app.box.com/embed/preview/zz1bm0qrw45z9r6xpnrxdvjp8tahwmpj?view=&sort=&direction=ASC&theme=light\" width=\"100%\" frameborder=\"0\" allowfullscreen webkitallowfullscreen=\"\" msallowfullscreen=\"\"></iframe></center>\n<p>So this weekend, I had a grand plan of being all fancy and making macarons.</p>\n<p>(Yea I looked it up... apparently macarons and macaroons are two VERY different things as this adorable diagram shows)</p>\n<p><img src=\"http://sweetsofstyle.com/wp-content/uploads/2015/01/adeals-macaron-vs-macaroon-copy1.png\" alt=\"\"></p>\n<p>I've honestly never eaten one but I always thought they looked so adorable! And I figured if I made them all blue and yellow then all the better... GO BLUE! I looked at the recipe, saw the ingredients and was confident that this dessert was within my range of baking abilities. In fact, I was SO confident that I called a friend of mine to come over and reap the benefits of my baking!</p>\n<p>Clearly such confidence could only yield brilliant results.</p>\n<p><strong>WRONG</strong></p>\n<p>Making macarons is a very delicate process that requires a lot more patience and skill than I had ever anticipated! And for that very reason, the adorable macarons I had been picturing in my head came out like this.</p>\n<p><img src=\"https://lh3.googleusercontent.com/JjfOtdZpKGPUnJWQXW5VSqnS-09Xoi1kbel7l62Q72S2=w1756-h1316-no\" alt=\"\"></p>\n<p>Exactly like you picture macarons in French Patisseries right?! I know... I was just as disappointed as you. It basically became some strange almond flavored fruit roll ups. Not at all appetizing. Now there was another problem... I had a <strong>TON</strong> of almond batter that clearly wasn't going to make macarons and no idea what to do with it. My cousin saved my ass and suggested I just convert them into almond cupcakes.</p>\n<p>Honestly, I think it was my disappointment at failing to make macrons but I half heartedly made these cupcakes. So much so that I didn't even bother with my usual photo shoot of the final masterpiece. I have absolutely no photos of what they turned out to look like. Nada. Zilch. But imagine they looked something like this except light yellow and blue with little almond specs all inside.</p>\n<p><img src=\"http://www.afarmgirlsdabbles.com/wp-content/uploads/2011/03/530_IMG_7507_white-cupcakes.jpg\" alt=\"\"></p>\n<p>They weren't especially sweet cupcakes so I figured they needed some kind of topping to balance out the flavors. I went back and made some of my handy caramel bourbon sauce, which is just melted caramel, a little water, and some <a href=\"http://www.southerncomfort.com/age?ref=caramel\">Caramel Southern Comfort</a>. First off, it's heavenly and just a little boozy. Secondly, it basically takes you 2 minutes to make.</p>\n<p>Finally having somewhat salvaged this disaster, I took the box of what I thought was my failures to work. After keeping it out in the lounge area, I quickly learned that the combination of almond cupcakes with caramel bourbon sauce works.... like <strong>really</strong> works.</p>\n<p>Anyways, here's what I think was the makeshift cupcake recipe. More or less...</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>\"Macaron\" Almond Cupcakes</h2>\n    <em>If the consistency doesn't seem like normal cupcake batter, add more flour. I kinda estimated the amounted needed and had to add more to my batter. But that may have only been because I was adapting from a macaron recipe.</em>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <li class=\"ingredient\">2/3 cup ground almonds</li>\n      <li class=\"ingredient\">1 1/2 cups powdered sugar</li>\n      <li class=\"ingredient\">3 large egg whites</li>\n      <li class=\"ingredient\">5 tbsp granulated sugar</li>\n      <li class=\"ingredient\">1 tsp vanilla extract</li>\n      <li class=\"ingredient\">2 tsp baking powder</li>\n      <li class=\"ingredient\">2 cups flour</li>\n      <li class=\"ingredient\">1/2 cup melted butter</li>\n      <li class=\"ingredient\">1 cup milk</li>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Preheat the oven to 375 degrees. Spray the cupcake pan with cooking spray and keep it aside.</p>\n        <p>Mix butter and sugar together and then beat in egg whites. Mix in the flour, ground almonds, and baking powder. Add in milk and vanilla and beat well. Pour batter into pan and bake for about 15 minutes or until you can poke a cupcake with a knife or toothpick and it comes out clean.</p>\n      </div>\n    </div>\n  </div>\n</div>","title":"Pardon My French, But **** that ****","slug":"pardon-my-french","published_at":"30 June, 2015","feature_image":"https://s-media-cache-ak0.pinimg.com/736x/82/15/ae/8215ae44e248f2901f8b6205b2c1cdd3.jpg","tags":[{"id":"5c47a6f22037ef002282c253","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c255","slug":"desserts"},{"id":"5c47a6f22037ef002282c27f","slug":"macarons"},{"id":"5c47a6f22037ef002282c286","slug":"almond"},{"id":"5c47a6f22037ef002282c287","slug":"fail"}]}}}