{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c372","uuid":"329792b8-9854-417e-a287-153b2af1d843","title":"Bhaaji Re Bhaaji Re Bhaaji RE!","slug":"bhaaji-re-bhaaji-re-bhaaji-re","published_at":"03 March, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/g4ab45jrsci3hv02dt7a9s8744otld65.jpg\" alt=\"\"></p>\n<p>So just to make up for my epic fail(s) these past weeks, I'm giving you 2 songs to listen to during this post!! (And to console an angry friend of mine :) I love you!)</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/6VBAGMkTjTs?wmode=transparent\"></iframe>\n</div>\n<p>Last month was the Super Bowl. Probably one of the MOST hyped up events in the United States. Usually, I'm not affected by much of this hype. There have even been years where I've forgotten to watch the Super Bowl altogether. I know. HOW COULD I? How very un-American of me. But nonetheless, if my team wasn't playing I was generally not too interested.</p>\n<p>This year was different. I've been in a Super Bowl city before; Detroit hosting in 2006. I probably lived about the same distance from all the events then than I did this time around, but this time was different. Super Bowl 50 was hosted by the city of San Francisco this year. Hilariously enough, the ACTUAL stadium that the teams were going to play at was a good 50 miles away from San Francisco. So TECHNICALLY the Super Bowl was hosted by the city of Santa Clara, but how many people actually know where that is?</p>\n<p>Exactly.</p>\n<p>So all the official hubbub leading up to the Super Bowl was held in downtown San Francisco. They set up this huge thing called &quot;Super Bowl City&quot; with various events starting a little more than a week before the actual big game. They had EVERYTHING; the puppy bowl, player signings, concerts (including the amazing Alicia Keys). San Francisco really pulled out all the stops for the event.</p>\n<p>I live in Sunnyvale right now. It's a little suburb town about 45 miles from downtown San Francisco. Usually, no issue. It's a quiet little area with lots of families and anything and everything Indian you could ever want. I'm really not kidding about that. There's a Indian grocery or jewelry or clothing or something store in each and every strip mall complex (I think that's what they're called anyways...) I legitimately give people directions to my house by telling them to go to Madras Cafe (one of the most popular dosa places in all of the Bay Area) and then turn onto my street instead of going into that restaurant. Ultimately it means that I'm dragged to that restaurant more than I'd ever like, me being someone who dislikes dosa (go on...hate on me all you want I am that South Indian that doesn't like dosa).</p>\n<p>Anyways... why is this important you may ask? Sunnyvale just HAPPENS to be approximately a 10 minute drive from the new and shiny Levi's Stadium in Santa Clara. The very stadium that happened to be hosting the Super Bowl last weekend. I know, lucky me! I get to go see all these tailgates and do all these cool football related things. Don't get me wrong... I LOVE football but it made me very bitter all weekend. In case you forgot, all the cool and fun events that were happening for the Super Bowl were happening in downtown San Francisco. So no cool pre-Super Bowl events for me. You'd think that AT LEAST I'd get to do some fun things the day of.... NOPE you thought wrong. Apparently you either needed to have specific connections/be a season ticket holder OR you needed to cough up some serious money to participate in all of these tailgating events. Levi's Stadium also has a strict no-tailgating policy for their parking lots, so I didn't get to attend anything. Clearly I'm not bitter at all about this.</p>\n<p>Anyway, my Super Bowl plans consisted of making an large amount of Pav Bhaaji and watching the game with my friend whilst we stuffed our faces. I was going to add a little bit of a rant about the Coldplay halftime show but that's for another time. I may not be a complete fan of Coldplay's Hymn for the Weekend music video but I do love the song...so I was very disappointed that they cut it from the Super Bowl halftime performance.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:3RiPr603aXAoi4GHyXx0uy\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Regardless, we had pav bhaaji to console us over Chris Martin being the left shark of this year's Super Bowl. Pav Bhaji is a wonderful, buttery delicacy from the streets of Mumbai. I'm thoroughly convinced that pav bhaaji tastes better when you get it from grungier and shadier places, aka a variety of street vendors. What street food doesn't taste better, when it's made and served to you from a giant stove in the middle of some market?!</p>\n<p><img src=\"https://i.ytimg.com/vi/_LFy3UYws2Y/hqdefault.jpg\" alt=\"\"></p>\n<p>I did have a slight mishap in making the pav bhaaji. I was so concentrated on combining a few different recipes into one that I absent-mindedly added bisibelebaath masala instead of pav bhaaji masala. While I do love me some bisibelebaath... the masala doesn't quite give you the taste you're looking for in pav bhaaji. So there I was, watching my disaster simmer and cook on my stove while the clock ticked down to the start of the game. Then I realized that I may have some the ingredients in my spice rack to make my own make-shift pav bhaaji masala. Pav bhaaji masala is made by grinding cardamom, coriander seeds, cumin, fennel seeds, dry chilies, cinnamon sticks, cloves, and dry mango powder. I somehow had most of these things, so I proceeded to add varied amounts of dry mango powder, cumin powder, ground cardamoms, and coriander seeds until it tasted close to pav bhaaji I like.</p>\n<p>Not in any way perfect, but not bad either! My friend being the sweetheart that he is claimed that he loved it! I feel like he was just being a nice friend so I highly recommend getting the pav bhaaji masala and using that instead of making your own with w/e you have in your kitchen. It'll just taste better and closer to what you would have wanted to begin with.</p>\n<p><img src=\"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Pav Bhaaji</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">Ghee</li>\n          <li class=\"ingredient\">1 bell pepper, chopped</li>\n          <li class=\"ingredient\">1 cup water</li>\n          <li class=\"ingredient\">4 roma tomatoes, chopped</li>\n          <li class=\"ingredient\">4 medium potatoes, chopped</li>\n          <li class=\"ingredient\">1 cup cauliflower florets</li>\n          <li class=\"ingredient\">1 1/2 tsp ginger-garlic paste</li>\n          <li class=\"ingredient\">1 onion, chopped</li>\n          <li class=\"ingredient\">2 tbsp pav bhaaji masala</li>\n          <li class=\"ingredient\">1 1/2 tbsp red chili powder</li>\n          <li class=\"ingredient\">1 tsp garam masala powder</li>\n          <li class=\"ingredient\">1 tsp turmeric</li>\n          <li class=\"ingredient\">1 tbsp kasuri methi (dried fenugreek) powder</li>\n          <li class=\"ingredient\">lime wedges for garnish</li>\n          <li class=\"ingredient\">some chopped onion for garnish</li>\n          <li class=\"ingredient\">salt according to taste</li>\n          <li class=\"ingredient\">pav buns (plain slider buns can also work)</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>In your pressure cooker, cook the potatoes and cauliflower until soft and tender.</p>\n        <p>Add butter (or ghee :D) to a large pan. Once it's heated, add the chopped bell pepper to it. Once that has softened, add a little water and mash.</p>\n        <p>Stir in the tomatoes and boiled vegetables and cook for 2-3 minutes. Add ginger-garlic paste and sauté for 2 minutes. Once the tomatoes have cooked, mash everything with a masher (or anything close to that).</p>\n        <p>In a separate pan, sauté chopped onion in ghee until it becomes a pale brown color. Add all the spices and salt and sauté for a few more minutes. Add some more water if it starts getting dry.</p>\n        <p>Add the onion mixture to the bhaaji and mix. Add water until it reaches the desirable consistency. Similarly with the spices and lime juice. Toast some pav buns and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/g4ab45jrsci3hv02dt7a9s8744otld65.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/b903fi6yix0qdhtqymxc78bgoku8w9wb.jpg\" alt=\"\"></p>\n","plaintext":"\n\nSo just to make up for my epic fail(s) these past weeks, I'm giving you 2 songs\nto listen to during this post!! (And to console an angry friend of mine :) I\nlove you!)\n\nLast month was the Super Bowl. Probably one of the MOST hyped up events in the\nUnited States. Usually, I'm not affected by much of this hype. There have even\nbeen years where I've forgotten to watch the Super Bowl altogether. I know. HOW\nCOULD I? How very un-American of me. But nonetheless, if my team wasn't playing\nI was generally not too interested.\n\nThis year was different. I've been in a Super Bowl city before; Detroit hosting\nin 2006. I probably lived about the same distance from all the events then than\nI did this time around, but this time was different. Super Bowl 50 was hosted by\nthe city of San Francisco this year. Hilariously enough, the ACTUAL stadium that\nthe teams were going to play at was a good 50 miles away from San Francisco. So\nTECHNICALLY the Super Bowl was hosted by the city of Santa Clara, but how many\npeople actually know where that is?\n\nExactly.\n\nSo all the official hubbub leading up to the Super Bowl was held in downtown San\nFrancisco. They set up this huge thing called \"Super Bowl City\" with various\nevents starting a little more than a week before the actual big game. They had\nEVERYTHING; the puppy bowl, player signings, concerts (including the amazing\nAlicia Keys). San Francisco really pulled out all the stops for the event.\n\nI live in Sunnyvale right now. It's a little suburb town about 45 miles from\ndowntown San Francisco. Usually, no issue. It's a quiet little area with lots of\nfamilies and anything and everything Indian you could ever want. I'm really not\nkidding about that. There's a Indian grocery or jewelry or clothing or something\nstore in each and every strip mall complex (I think that's what they're called\nanyways...) I legitimately give people directions to my house by telling them to\ngo to Madras Cafe (one of the most popular dosa places in all of the Bay Area)\nand then turn onto my street instead of going into that restaurant. Ultimately\nit means that I'm dragged to that restaurant more than I'd ever like, me being\nsomeone who dislikes dosa (go on...hate on me all you want I am that South\nIndian that doesn't like dosa).\n\nAnyways... why is this important you may ask? Sunnyvale just HAPPENS to be\napproximately a 10 minute drive from the new and shiny Levi's Stadium in Santa\nClara. The very stadium that happened to be hosting the Super Bowl last weekend.\nI know, lucky me! I get to go see all these tailgates and do all these cool\nfootball related things. Don't get me wrong... I LOVE football but it made me\nvery bitter all weekend. In case you forgot, all the cool and fun events that\nwere happening for the Super Bowl were happening in downtown San Francisco. So\nno cool pre-Super Bowl events for me. You'd think that AT LEAST I'd get to do\nsome fun things the day of.... NOPE you thought wrong. Apparently you either\nneeded to have specific connections/be a season ticket holder OR you needed to\ncough up some serious money to participate in all of these tailgating events.\nLevi's Stadium also has a strict no-tailgating policy for their parking lots, so\nI didn't get to attend anything. Clearly I'm not bitter at all about this.\n\nAnyway, my Super Bowl plans consisted of making an large amount of Pav Bhaaji\nand watching the game with my friend whilst we stuffed our faces. I was going to\nadd a little bit of a rant about the Coldplay halftime show but that's for\nanother time. I may not be a complete fan of Coldplay's Hymn for the Weekend\nmusic video but I do love the song...so I was very disappointed that they cut it\nfrom the Super Bowl halftime performance.\n\nRegardless, we had pav bhaaji to console us over Chris Martin being the left\nshark of this year's Super Bowl. Pav Bhaji is a wonderful, buttery delicacy from\nthe streets of Mumbai. I'm thoroughly convinced that pav bhaaji tastes better\nwhen you get it from grungier and shadier places, aka a variety of street\nvendors. What street food doesn't taste better, when it's made and served to you\nfrom a giant stove in the middle of some market?!\n\n\n\nI did have a slight mishap in making the pav bhaaji. I was so concentrated on\ncombining a few different recipes into one that I absent-mindedly added\nbisibelebaath masala instead of pav bhaaji masala. While I do love me some\nbisibelebaath... the masala doesn't quite give you the taste you're looking for\nin pav bhaaji. So there I was, watching my disaster simmer and cook on my stove\nwhile the clock ticked down to the start of the game. Then I realized that I may\nhave some the ingredients in my spice rack to make my own make-shift pav bhaaji\nmasala. Pav bhaaji masala is made by grinding cardamom, coriander seeds, cumin,\nfennel seeds, dry chilies, cinnamon sticks, cloves, and dry mango powder. I\nsomehow had most of these things, so I proceeded to add varied amounts of dry\nmango powder, cumin powder, ground cardamoms, and coriander seeds until it\ntasted close to pav bhaaji I like.\n\nNot in any way perfect, but not bad either! My friend being the sweetheart that\nhe is claimed that he loved it! I feel like he was just being a nice friend so I\nhighly recommend getting the pav bhaaji masala and using that instead of making\nyour own with w/e you have in your kitchen. It'll just taste better and closer\nto what you would have wanted to begin with.\n\n\n\nPav Bhaaji\nIngredients:\nGhee\n 1 bell pepper, chopped\n 1 cup water\n 4 roma tomatoes, chopped\n 4 medium potatoes, chopped\n 1 cup cauliflower florets\n 1 1/2 tsp ginger-garlic paste\n 1 onion, chopped\n 2 tbsp pav bhaaji masala\n 1 1/2 tbsp red chili powder\n 1 tsp garam masala powder\n 1 tsp turmeric\n 1 tbsp kasuri methi (dried fenugreek) powder\n lime wedges for garnish\n some chopped onion for garnish\n salt according to taste\n pav buns (plain slider buns can also work)\n Directions:\nIn your pressure cooker, cook the potatoes and cauliflower until soft and\ntender.\n\nAdd butter (or ghee :D) to a large pan. Once it's heated, add the chopped bell\npepper to it. Once that has softened, add a little water and mash.\n\nStir in the tomatoes and boiled vegetables and cook for 2-3 minutes. Add\nginger-garlic paste and sauté for 2 minutes. Once the tomatoes have cooked, mash\neverything with a masher (or anything close to that).\n\nIn a separate pan, sauté chopped onion in ghee until it becomes a pale brown\ncolor. Add all the spices and salt and sauté for a few more minutes. Add some\nmore water if it starts getting dry.\n\nAdd the onion mixture to the bhaaji and mix. Add water until it reaches the\ndesirable consistency. Similarly with the spices and lime juice. Toast some pav\nbuns and enjoy!","feature_image":"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"},{"id":"5c47a6f22037ef002282c2e9","name":"super bowl","slug":"super-bowl"},{"id":"5c47a6f22037ef002282c2ea","name":"salman khan","slug":"salman-khan"},{"id":"5c47a6f22037ef002282c2eb","name":"bollywood","slug":"bollywood"},{"id":"5c47a6f22037ef002282c2ec","name":"pav bhaaji","slug":"pav-bhaaji"},{"id":"5c47a6f22037ef002282c2ed","name":"cravings","slug":"cravings"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c371","uuid":"c29b2ef2-5742-41db-8c7d-ee40d863ac36","title":"California Gurrrrllllll","slug":"california-gurrrrllllll","published_at":"29 February, 2016","html":"<p>Spring break baby! As of Friday, I am SORT OF on spring break. While I have an assignment due tomorrow that I am still working on, I've been in California visiting Sumu since Friday!</p>\n<p>While I've buckled down a bit today, Sumu and I spent all of yesterday and this morning running around San Francisco and nearby beaches.</p>\n<p>The soundtrack to our trip?</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/vWaRiD5ym74\"></iframe>\n</div>\n<p>We started off our day at Land's End Recreation Area, which was hands down my favorite part of the trip so far. We parked, and it was about a mile walk to the beach. The entire area was insanely picturesque, and I was half convinced that we had stepped out of San Francisco and into a Lord of the Rings movie.</p>\n<p><img src=\"https://pramods.box.com/shared/static/x2uo0tras4nbnknlrtbrmqs3jrq69hz0.jpg\" alt=\"\"></p>\n<p>From there, we went to get brunch, before heading to Valencia St. to look at street art, before heading to Dolores Park. On the way, we passed the The Women's Building, which has one of the coolest murals I've ever seen on it - if you find yourself in SF, definitely head over there. It's a celebration of women, and it's totally gorgeous.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ov0xg36h85u5eqaz30mfp3ilsw60dxeq.jpeg\" alt=\"\"></p>\n<p>After that, we went to Dolores Park and visited the Golden Gate Bridge at sunset!</p>\n<p>Today, we woke up bright and early and headed to Capitola and Natural Bridges State Beach. We wandered around the beach for a while before getting ourselves to our favorite meal: brunch.</p>\n<p><img src=\"https://pramods.box.com/shared/static/25ppba8otn16vj1tw7nr0naf1xjmglm5.jpg\" alt=\"\"></p>\n<p>This place was pretty small, but really cute, and had excellent brunch options. I ordered Gallo Pinto, which was described on the menu as a Costa Rican dish.</p>\n<p><img src=\"https://pramods.box.com/shared/static/hinrb93xbood40avb37ozvuldf5qqbtg.jpg\" alt=\"\"></p>\n<p>I liked my dish a lot; the plantains, rice, egg, and sauce went really well together, and I found myself clearing my plate!</p>\n<p>Sumu got the Veggie Cocota, with was veggies and poached eggs covered in a Cocota sauce. Research indicates that Cocota is a neighborhood in Brasil, although I can't speak to the authenticity of the sauce. Either way, it was pretty good; the sauce is quite strong, and while I thought it was delicious, it was a bit much for brunch.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z6r4ajucixwzwnh3bv2t9bxe5auaf6rg.jpeg\" alt=\"\"></p>\n<p>Either way, definitely worth a visit. If you're in Santa Cruz, definitely head over; they also have fresh juice that's perfect for taking with you to the beach!</p>\n","plaintext":"Spring break baby! As of Friday, I am SORT OF on spring break. While I have an\nassignment due tomorrow that I am still working on, I've been in California\nvisiting Sumu since Friday!\n\nWhile I've buckled down a bit today, Sumu and I spent all of yesterday and this\nmorning running around San Francisco and nearby beaches.\n\nThe soundtrack to our trip?\n\nWe started off our day at Land's End Recreation Area, which was hands down my\nfavorite part of the trip so far. We parked, and it was about a mile walk to the\nbeach. The entire area was insanely picturesque, and I was half convinced that\nwe had stepped out of San Francisco and into a Lord of the Rings movie.\n\n\n\nFrom there, we went to get brunch, before heading to Valencia St. to look at\nstreet art, before heading to Dolores Park. On the way, we passed the The\nWomen's Building, which has one of the coolest murals I've ever seen on it - if\nyou find yourself in SF, definitely head over there. It's a celebration of\nwomen, and it's totally gorgeous.\n\n\n\nAfter that, we went to Dolores Park and visited the Golden Gate Bridge at\nsunset!\n\nToday, we woke up bright and early and headed to Capitola and Natural Bridges\nState Beach. We wandered around the beach for a while before getting ourselves\nto our favorite meal: brunch.\n\n\n\nThis place was pretty small, but really cute, and had excellent brunch options.\nI ordered Gallo Pinto, which was described on the menu as a Costa Rican dish.\n\n\n\nI liked my dish a lot; the plantains, rice, egg, and sauce went really well\ntogether, and I found myself clearing my plate!\n\nSumu got the Veggie Cocota, with was veggies and poached eggs covered in a\nCocota sauce. Research indicates that Cocota is a neighborhood in Brasil,\nalthough I can't speak to the authenticity of the sauce. Either way, it was\npretty good; the sauce is quite strong, and while I thought it was delicious, it\nwas a bit much for brunch.\n\n\n\nEither way, definitely worth a visit. If you're in Santa Cruz, definitely head\nover; they also have fresh juice that's perfect for taking with you to the\nbeach!","feature_image":"https://pramods.box.com/shared/static/hinrb93xbood40avb37ozvuldf5qqbtg.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c26c","name":"california","slug":"california"},{"id":"5c47a6f22037ef002282c2f1","name":"besties","slug":"besties"},{"id":"5c47a6f22037ef002282c2f2","name":"visits","slug":"visits"},{"id":"5c47a6f22037ef002282c2f3","name":"spring break","slug":"spring-break"},{"id":"5c47a6f22037ef002282c2f4","name":"santa cruz","slug":"santa-cruz"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c2f6","name":"land's end","slug":"lands-end"},{"id":"5c47a6f22037ef002282c2f8","name":"natural bridges","slug":"natural-bridges"},{"id":"5c47a6f22037ef002282c2f7","name":"the shire","slug":"the-shire"},{"id":"5c47a6f22037ef002282c2f9","name":"golden gate","slug":"golden-gate"},{"id":"5c47a6f22037ef002282c2fa","name":"the women's center","slug":"the-womens-center"},{"id":"5c47a6f22037ef002282c2fb","name":"cafe brasil","slug":"cafe-brasil"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c345","uuid":"a36cd4bb-ea95-40c9-825a-ecfaa379ce90","title":"Wasted away again in Margaritaville, Searchin' for my lost shaker of salt.","slug":"wasted-away-again-in-margaritaville-searchin-for-my-lost-shaker-of-salt","published_at":"23 February, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/38mzn6d74gsoayifd0d1sjehep3gho7g.jpg\" alt=\"\"></p>\n<p>Happy National Margarita Day!!! Bet you didn't know that was a thing! Well now you do so you're welcome.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:57FvuUotRyzRl8hwIhCVuO\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>In case you weren't aware... Jimmy Buffett actually had a cameo in Jurassic World last year. Of course he was one of the people escaping the pterodactyls. But of course, in true Margaritaville fashion, he makes sure to grab BOTH of his margaritas before making a run for it.</p>\n<p><img src=\"http://i.imgur.com/rHfvEne.gif?noredirect\" alt=\"\"></p>\n<p>This man is a hero. He clearly knows what today is about. If you haven't already, definitely play the song I linked to above while reading the post. I promise the lyrics won't disappoint. If you're really digging the song, I totally recommend checking out the entire album. It's a gold mine of amazing songs like &quot;Cheeseburger in Paradise&quot;, &quot;Pencil Thin Mustache&quot;, &quot;Grapefruit - Juicy Fruit&quot;, &quot;Son of a Son of a Sailor&quot;, and last but not least &quot;Why Don't We Get Drunk.&quot; I've linked the entire album here for your enjoyment. Do it. I promise it's totally worth it.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:album:6MlglzxBetAjx7yZNAQt3D\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Using the great Jimmy Buffett and National Margarita Day as inspiration, I figured I can FINALLY share the amazing strawberry margaritas with you guys. I made these margaritas last year for a Cinco de Mayo celebration at my cousin's place. Technically it was Seis de Mayo because May 5th last year was a Tuesday and everyone was busy that day. These were a HUGE hit and best part is that when you run out of strawberries you can just use more lime juice and make plain margaritas. It's the best.</p>\n<p>In case you needed more convincing to actually listen to that song:</p>\n<p><em>&quot;But there's booze in the blender, and soon it will render that frozen concoction that helps me hang on.&quot;</em></p>\n<p>Yeah... I know. He sings from the heart. Now turn on the song and start blending up some delicious margaritas for you and your friends!</p>\n<p><img src=\"https://pramods.box.com/shared/static/3vs3q24ymcfuxdqkfsiuu3m7y0k1itr7.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Frozen Strawberry Margaritas</h2>\n    <div class=\"summary\">\n      <p><em>Just as a warning, these are quite strong so I'd recommend tasting as you add the tequila. However... It's always 5 o'clock somewhere!</em></p>\n      <p>Yield: about 4-5 margaritas</p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">2 cups frozen strawberries</li>\n          <li class=\"ingredient\">1 cup silver tequila</li>\n          <li class=\"ingredient\">2/3 cup freshly squeezed lemon or lime juice (save a few wedges for garnish)</li>\n          <li class=\"ingredient\">1/3 cup honey or agave</li>\n          <li class=\"ingredient\">1/4 cup Triple Sec (or Cointreau)</li>\n          <li class=\"ingredient\">Coarse salt to rim the glasses</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Blend all the ingredients except salt together in the blender. Taste and adjust tequila or honey/agave as you wish</p>\n        <p>Run a lime wedge along the rim of each of your margarita glasses. Dip the glass upside-down in a bowl of salt. Fill each glass with the drink and garnish with a lemon or lime wedge.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/8whp4skk7w2bwc1cfvn5o3xq9u5g6k1k.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/6917hfisdaydben1ot5yvzlfxep4kef1.jpg\" alt=\"\"></p>\n","plaintext":"\n\nHappy National Margarita Day!!! Bet you didn't know that was a thing! Well now\nyou do so you're welcome.\n\nIn case you weren't aware... Jimmy Buffett actually had a cameo in Jurassic\nWorld last year. Of course he was one of the people escaping the pterodactyls.\nBut of course, in true Margaritaville fashion, he makes sure to grab BOTH of his\nmargaritas before making a run for it.\n\n\n\nThis man is a hero. He clearly knows what today is about. If you haven't\nalready, definitely play the song I linked to above while reading the post. I\npromise the lyrics won't disappoint. If you're really digging the song, I\ntotally recommend checking out the entire album. It's a gold mine of amazing\nsongs like \"Cheeseburger in Paradise\", \"Pencil Thin Mustache\", \"Grapefruit -\nJuicy Fruit\", \"Son of a Son of a Sailor\", and last but not least \"Why Don't We\nGet Drunk.\" I've linked the entire album here for your enjoyment. Do it. I\npromise it's totally worth it.\n\nUsing the great Jimmy Buffett and National Margarita Day as inspiration, I\nfigured I can FINALLY share the amazing strawberry margaritas with you guys. I\nmade these margaritas last year for a Cinco de Mayo celebration at my cousin's\nplace. Technically it was Seis de Mayo because May 5th last year was a Tuesday\nand everyone was busy that day. These were a HUGE hit and best part is that when\nyou run out of strawberries you can just use more lime juice and make plain\nmargaritas. It's the best.\n\nIn case you needed more convincing to actually listen to that song:\n\n\"But there's booze in the blender, and soon it will render that frozen\nconcoction that helps me hang on.\"\n\nYeah... I know. He sings from the heart. Now turn on the song and start blending\nup some delicious margaritas for you and your friends!\n\n\n\nFrozen Strawberry Margaritas\nJust as a warning, these are quite strong so I'd recommend tasting as you add\nthe tequila. However... It's always 5 o'clock somewhere!\n\nYield: about 4-5 margaritas\n\nIngredients:\n2 cups frozen strawberries\n 1 cup silver tequila\n 2/3 cup freshly squeezed lemon or lime juice (save a few wedges for garnish)\n 1/3 cup honey or agave\n 1/4 cup Triple Sec (or Cointreau)\n Coarse salt to rim the glasses\n Directions:\nBlend all the ingredients except salt together in the blender. Taste and adjust\ntequila or honey/agave as you wish\n\nRun a lime wedge along the rim of each of your margarita glasses. Dip the glass\nupside-down in a bowl of salt. Fill each glass with the drink and garnish with a\nlemon or lime wedge.","feature_image":"https://pramods.box.com/shared/static/6917hfisdaydben1ot5yvzlfxep4kef1.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c278","name":"margaritas","slug":"margaritas"},{"id":"5c47a6f22037ef002282c279","name":"strawberry","slug":"strawberry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ee","name":"jimmy buffett","slug":"jimmy-buffett"},{"id":"5c47a6f22037ef002282c2ef","name":"Margaritaville","slug":"margaritaville"},{"id":"5c47a6f22037ef002282c277","name":"cinco de mayo","slug":"cinco-de-mayo"},{"id":"5c47a6f22037ef002282c2f0","name":"tequila","slug":"tequila"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36d","uuid":"e54bee63-f2fd-4a2c-9173-aa613951517f","title":"It’s Summertime Somewhere - Coconut Berry Ice Cream","slug":"coconut-berry-ice-cream","published_at":"22 February, 2016","html":"<p>This recipe went wrong several different ways. The ice cream maker bowl wouldn't freeze, even after 48 hours in the freezer. And then the ice cream itself failed to freeze after eight hours in the freezer. It was still delicious, but delicious with the consistency of soft serve, rather than hard ice cream.</p>\n<p><img src=\"https://pramods.box.com/shared/static/gcws27i9ca8jn5gkqd2j6osakirvt43d.jpg\" alt=\"\"></p>\n<p>Basically, I made fro yo. With strawberries! Enjoy.</p>\n<p><img src=\"https://pramods.box.com/shared/static/5symw4053dq1qi1izwoyw8c7wfxdlfrw.jpg\" alt=\"\"></p>\n<div class=\"Coconut Berry Ice Cream\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Title</h2>\n    <div class=\"summary\">\n      <p><em>At some point, ice cream became designated as a summer treat - and I say, down with the discrimination! We should be free to have ice cream all year round! Don't let the ice cream fascists take away your fun. </em></p>\n      <p>Yield: I have no idea. A tupperware container full!</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong><span class=\"duration\"> About one hour of active time, two days of waiting</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Ice Cream base</h4>\n          <li class=\"ingredient\">2 Cans Full Fat Coconut Milk</li>\n<li class=\"ingredient\">1 Tbls Maple Syrup</li>\n          <li class=\"ingredient\">1 C Cashews</li>\n <li class=\"ingredient\">1 Tbls Cornstarch or Arrowroot Powder</li>\n <li class=\"ingredient\">Excess Liquid From Jam (see below)</li>\n        <h4>Jam!</h4>\n          <li class=\"ingredient\">1 C Strawberries</li>\n          <li class=\"ingredient\">2 C Blueberries</li>\n<li class=\"ingredient\">1/2 C 100% Fruit Juice (I used a berry blend)</li>\n<li class=\"ingredient\">1 Tbls Maple Syrup</li>\n<li class=\"ingredient\">1 Tbls Cornstarch or Arrowroot Powder</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n       1.) First things first, put your ice cream maker's bowl in the freezer, and chill your coconut milk in the fridge overnight before you start. \n</p><p>\n2.) Put your strawberries, blueberries, juice, and maple syrup into a saucepan and let simmer. When the fruit is about halfway to being complete mush, move to step 3. \n</p><p>\n3.) Crack open your coconut milk and pour into the blender. Add the maple syrup, and carefully remove some of the juice that's in your saucepan, and add it as well. This cuts down on simmering time for the jam, and adds color and flavor to the ice cream! Blend. \n</p><p> \n4.) While the fruit continues to cook, take about 3/4 of the coconut milk you've blended up and put it in a container. Then add the arrowroot or cornstarch, and blend the remaining 1/4 until fully combined. Pour into container with the rest of the coconut milk base. \n</p><p> \n5.) Your fruit should be complete mush now - if there's any juice left, now is the time to slowly pour it into the ice cream base, until there's only a couple of tablespoons of liquid in the saucepan with the fruit. \n</p><p>\n6.) Carefully sprinkle the arrowroot or cornstarch onto the fruit, stirring vigorously to prevent clumping. Allow to cook an additional couple of minutes, until the mixture has thickened just a bit. Remove from heat, and pour into a container. \n</p><p>\n7.) Put the coconut milk base and jam into the fridge - both need to chill for a bit, at least twelve hours, ideally 24 or more. \n</p><p>\n8.) Climb a tree, read a book, explore nature. Go to work? You do you, boo boo. \n</p><p>\n9.) When all ingredients are thoroughly chilled, follow the directions on your ice cream maker! When there are five - ten minutes left, add the jam, and allow to incorporate completely. \n</p><p>\n10.) Eat ice cream in February. Don't let THE MAN tell you what to do. \n        </p>\n      </div>\n    </div>\n  </div>\n</div>","plaintext":"This recipe went wrong several different ways. The ice cream maker bowl wouldn't\nfreeze, even after 48 hours in the freezer. And then the ice cream itself failed\nto freeze after eight hours in the freezer. It was still delicious, but\ndelicious with the consistency of soft serve, rather than hard ice cream.\n\n\n\nBasically, I made fro yo. With strawberries! Enjoy.\n\n\n\nTitle\nAt some point, ice cream became designated as a summer treat - and I say, down\nwith the discrimination! We should be free to have ice cream all year round!\nDon't let the ice cream fascists take away your fun. \n\nYield: I have no idea. A tupperware container full!\n\nTotal Time:  About one hour of active time, two days of waiting\n\nIngredients:\nIce Cream base\n2 Cans Full Fat Coconut Milk1 Tbls Maple Syrup\n 1 C Cashews\n 1 Tbls Cornstarch or Arrowroot Powder\n Excess Liquid From Jam (see below)\n Jam!\n1 C Strawberries\n 2 C Blueberries1/2 C 100% Fruit Juice (I used a berry blend)1 Tbls Maple Syrup1\nTbls Cornstarch or Arrowroot Powder\n Directions:\n\n1.) First things first, put your ice cream maker's bowl in the freezer, and\nchill your coconut milk in the fridge overnight before you start.\n\n\n2.) Put your strawberries, blueberries, juice, and maple syrup into a saucepan\nand let simmer. When the fruit is about halfway to being complete mush, move to\nstep 3.\n\n\n3.) Crack open your coconut milk and pour into the blender. Add the maple syrup,\nand carefully remove some of the juice that's in your saucepan, and add it as\nwell. This cuts down on simmering time for the jam, and adds color and flavor to\nthe ice cream! Blend.\n\n  \n4.) While the fruit continues to cook, take about 3/4 of the coconut milk you've\nblended up and put it in a container. Then add the arrowroot or cornstarch, and\nblend the remaining 1/4 until fully combined. Pour into container with the rest\nof the coconut milk base.\n\n  \n5.) Your fruit should be complete mush now - if there's any juice left, now is\nthe time to slowly pour it into the ice cream base, until there's only a couple\nof tablespoons of liquid in the saucepan with the fruit.\n\n\n6.) Carefully sprinkle the arrowroot or cornstarch onto the fruit, stirring\nvigorously to prevent clumping. Allow to cook an additional couple of minutes,\nuntil the mixture has thickened just a bit. Remove from heat, and pour into a\ncontainer.\n\n\n7.) Put the coconut milk base and jam into the fridge - both need to chill for a\nbit, at least twelve hours, ideally 24 or more.\n\n\n8.) Climb a tree, read a book, explore nature. Go to work? You do you, boo boo.\n\n\n9.) When all ingredients are thoroughly chilled, follow the directions on your\nice cream maker! When there are five - ten minutes left, add the jam, and allow\nto incorporate completely.\n\n\n10.) Eat ice cream in February. Don't let THE MAN tell you what to do.","feature_image":"https://pramods.box.com/shared/static/gcws27i9ca8jn5gkqd2j6osakirvt43d.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2df","name":"ice cream","slug":"ice-cream"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2e0","name":"coconut milk","slug":"coconut-milk"},{"id":"5c47a6f22037ef002282c2e1","name":"berries","slug":"berries"},{"id":"5c47a6f22037ef002282c2e2","name":"summertime","slug":"summertime"},{"id":"5c47a6f22037ef002282c2e3","name":"sweet treats","slug":"sweet-treats"},{"id":"5c47a6f22037ef002282c2e4","name":"fight the power","slug":"fight-the-power"},{"id":"5c47a6f22037ef002282c2e5","name":"i stand with planned parenthood","slug":"i-stand-with-planned-parenthood"},{"id":"5c47a6f22037ef002282c2e6","name":"and black lives matter","slug":"and-black-lives-matter"},{"id":"5c47a6f22037ef002282c2e7","name":"and native nations","slug":"and-native-nations"},{"id":"5c47a6f22037ef002282c2e8","name":"power to the people","slug":"power-to-the-people"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c361","uuid":"90fcc5c1-73f9-4b23-a38e-697f92bdfb7e","title":"This Shit is Bananas, B-A-N-A-N-A-S","slug":"this-shit-is-bananas-b-a-n-a-n-a-s","published_at":"18 February, 2016","html":"<p>I konw this post can't come close to as sweet as the one Anagha wrote this week. But I pinky promise, in addition to making up for last weeks missing post, I will also make up for Valentine's day. I know, I know... lots of promises but you don't mess with pinky promises!</p>\n<p>You knew this song was coming... don't lie. Just relish in the throwback and ketchup on some food blog reading ;)</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:6RcQOut9fWL6FSqeIr5M1r\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Since this past weekend was the SUPERBOWL I had this whole great plan on how I was going to post about what I made to eat then. But of course my inner Dory came out and I forgot to upload all the tantalizing pictures I took. A specific friend of mine, <em>cough cough Breane</em>, had requested the recipe so I TOTALLY apologize for my brain fart and promise I'll post it next week! But until then, you'll have to bear with me and enjoy this post instead :).</p>\n<p>So personally, I think my mom is the QUEEN of making banana bread. Like, seriously. Her banana bread the most glorious thing since, well, sliced bread (badum chhhhhhhhh). It's the perfect combination soft and moist and not too sweet. Of course, my banana bread can never live up to that standard but, hey, I can try!</p>\n<p><img src=\"https://pramods.box.com/shared/static/kvkxvgrndzsbsfjbpa938jq142jrlgpl.jpg\" alt=\"\"></p>\n<p>One thing I've learned about all of my mom's recipes is that her measurements aren't always... Exact. She always shows me measurements using the length of her fingers. Problem is we have different sized hands AND how do you quantify that measurement so that you can replicate it? I've tried SO many times to get teaspoon measurements for everything but can't say I've been entirely successful. This is the sole reason I haven't been able to make my food taste like my mom's food.</p>\n<p>Anyways, a girl can try right? Now back to her mind-BLASTING banana bread.</p>\n<p><img src=\"http://cdn.meme.am/instances/55172211.jpg\" alt=\"Insert Russell Peters Gif Here\"></p>\n<p>Many of my friends are aware that I don't particularly have a sweet tooth. I mean sure I get cravings on occasion, however, banana bread has always been one of my favorite things, mainly because it's just the right level of sweetness. It has a strong taste of vanilla and of course banana! What could be better?!</p>\n<p>Once when I was having said cravings, I really really wanted to eat my mom's banana bread. So I decided to do my own take on her recipe, I know already going downhill, by adding zucchini and carrot. You know, hiding a little bit of healthy things in there to make you feel better about eating desserts.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fk4kesqhxueed5q00j41f9gbjib2vgwo.jpg\" alt=\"\"></p>\n<p>It actually came out pretty good, not quite mom level, but still pretty amazing. I may have eaten an embarrassingly large number of these muffins. Let me know what you think!!!</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Zucchini Carrot Banana Bread Muffins</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">1/2 cup shortening</li>\n          <li class=\"ingredient\">1 cup sugar</li>\n          <li class=\"ingredient\">2 eggs</li>\n          <li class=\"ingredient\">4 mashed bananas</li>\n          <li class=\"ingredient\">1 tsp lemon juice</li>\n          <li class=\"ingredient\">2 cups sifted flour</li>\n          <li class=\"ingredient\">1/2 tsp salt</li>\n          <li class=\"ingredient\">1 cup chopped nuts</li>\n          <li class=\"ingredient\">1 zucchini, shredded</li>\n          <li class=\"ingredient\">1 carrot, shredded strips</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Cream shortening and sugar together. Beat eggs until light and add. Mix in bananas and add lemon juice. Blend with creamed mixture. Sift flour, baking powder and salt together and mix quickly into the banana mixture. Add the nuts, zucchini, and carrots and mix. Pour batter into cupcake pans and bake at 375 degrees about 30 minutes, or until a toothpick comes out clean when you poke it.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/ksfz88a49rm9j2ztujqfusuoyoidu0wp.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg\" alt=\"\"></p>\n","plaintext":"I konw this post can't come close to as sweet as the one Anagha wrote this week.\nBut I pinky promise, in addition to making up for last weeks missing post, I\nwill also make up for Valentine's day. I know, I know... lots of promises but\nyou don't mess with pinky promises!\n\nYou knew this song was coming... don't lie. Just relish in the throwback and\nketchup on some food blog reading ;)\n\nSince this past weekend was the SUPERBOWL I had this whole great plan on how I\nwas going to post about what I made to eat then. But of course my inner Dory\ncame out and I forgot to upload all the tantalizing pictures I took. A specific\nfriend of mine, cough cough Breane, had requested the recipe so I TOTALLY\napologize for my brain fart and promise I'll post it next week! But until then,\nyou'll have to bear with me and enjoy this post instead :).\n\nSo personally, I think my mom is the QUEEN of making banana bread. Like,\nseriously. Her banana bread the most glorious thing since, well, sliced bread\n(badum chhhhhhhhh). It's the perfect combination soft and moist and not too\nsweet. Of course, my banana bread can never live up to that standard but, hey, I\ncan try!\n\n\n\nOne thing I've learned about all of my mom's recipes is that her measurements\naren't always... Exact. She always shows me measurements using the length of her\nfingers. Problem is we have different sized hands AND how do you quantify that\nmeasurement so that you can replicate it? I've tried SO many times to get\nteaspoon measurements for everything but can't say I've been entirely\nsuccessful. This is the sole reason I haven't been able to make my food taste\nlike my mom's food.\n\nAnyways, a girl can try right? Now back to her mind-BLASTING banana bread.\n\n\n\nMany of my friends are aware that I don't particularly have a sweet tooth. I\nmean sure I get cravings on occasion, however, banana bread has always been one\nof my favorite things, mainly because it's just the right level of sweetness. It\nhas a strong taste of vanilla and of course banana! What could be better?!\n\nOnce when I was having said cravings, I really really wanted to eat my mom's\nbanana bread. So I decided to do my own take on her recipe, I know already going\ndownhill, by adding zucchini and carrot. You know, hiding a little bit of\nhealthy things in there to make you feel better about eating desserts.\n\n\n\nIt actually came out pretty good, not quite mom level, but still pretty amazing.\nI may have eaten an embarrassingly large number of these muffins. Let me know\nwhat you think!!!\n\nZucchini Carrot Banana Bread Muffins\nIngredients:\n1/2 cup shortening\n 1 cup sugar\n 2 eggs\n 4 mashed bananas\n 1 tsp lemon juice\n 2 cups sifted flour\n 1/2 tsp salt\n 1 cup chopped nuts\n 1 zucchini, shredded\n 1 carrot, shredded strips\n Directions:\nCream shortening and sugar together. Beat eggs until light and add. Mix in\nbananas and add lemon juice. Blend with creamed mixture. Sift flour, baking\npowder and salt together and mix quickly into the banana mixture. Add the nuts,\nzucchini, and carrots and mix. Pour batter into cupcake pans and bake at 375\ndegrees about 30 minutes, or until a toothpick comes out clean when you poke it.","feature_image":"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c296","name":"bananas","slug":"bananas"},{"id":"5c47a6f22037ef002282c294","name":"zucchini","slug":"zucchini"},{"id":"5c47a6f22037ef002282c295","name":"carrot","slug":"carrot"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c354","uuid":"7c0032d9-e246-4e10-b832-c5f5b48f107d","title":"Dear Sumedha, (a love letter)","slug":"galentines-day-scones","published_at":"15 February, 2016","html":"<p>I've been watching Parks and Recreation lately, and I am constantly inspired by the friendships Leslie cultivated with the women in her life. So, this post, I'm taking a page out of her book, and writing a love letter to Sumu, my co-writer, soul sister, and fellow adventurer.</p>\n<p>Special shout-out to the lady who taught me how to be a friend; my mom. My mom is intelligent, beautiful, and determined. But above all, she's caring and real. She has a loving and compassionate heart, and seeing her with her friends is something I will always cherish. I am so glad that we've grown into a friendship. I'm the lame kid whose mom is her best friend. And I am really really really lucky.</p>\n<p><img src=\"https://pramods.box.com/shared/static/w65ikv2f7p9cikic7cfgohsnl30monso.jpeg\" alt=\"\"></p>\n<p>Dear Sumedha,</p>\n<p>Thanks for being amazing. For coming to the rescue every time my pictures are sideways, or I can't figure out my own cellphone. For bringing Mindy's and Aziz's books home because you knew I was dying to read them, making me a scrapbook so I wouldn't have to make my own, and putting together an otter watching road trip itinerary, so that I could go on a stress free but totally planned ride.</p>\n<p>Thanks for putting up with me when I get temporarily obsessed with boy bands. Thanks for laughing at me when I snap back to my senses. With your love, nobody can drag me down.</p>\n<iframe src=\"https://embed.spotify.com/?uri=[https://play.spotify.com/track/70OTIpw8x8UXUsuCHW9i1i]\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Thanks for being brown with me. And watching Meet the Patels with me over the phone. This is what dreams are made of.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ab4cjd78mehqrd0dy00zex9e7isvgu0i.jpg\" alt=\"\"></p>\n<p>Thanks for always reassuring me about my admittedly glorious self, and being honest but kind when I look bad in something. Thanks for encouraging my dreams, and constantly believing in me. You are the person I send selfies to when I feel good about myself, and I love that about our relationship.</p>\n<p>You're incandescent, smart, lovely, talented, kind, caring, and authentic. You are an incredible friend, which is perhaps one of the best things I could say about a person. I am so lucky to have you in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/hbi46on7awfpk8te5ce1o79ai8wn4ju8.jpg\" alt=\"\"></p>\n<p>Thanks for being my otter watching and blog partner. Thanks for being the Joey to my Chandler, the Ann to my Knope, and the Tina to my Amy.</p>\n<p><img src=\"https://pramods.box.com/shared/static/c5kl7gputj9wtxoxg752vpc90yh51njq.png\" alt=\"\"></p>\n<p>Also, thanks for being the first of the two of us to not post on her day. It really took the pressure off of me (I think we BOTH thought it would be me!), so thanks. I love you, man.</p>\n<p>In honor of our friendship, Friends, and Valentines Day itself, I made scones. I hope you like them.</p>\n<p><img src=\"https://pramods.box.com/shared/static/alz3hmrfnxx5jg01e9bfshpzuoqjx9jc.jpg\" alt=\"\"></p>\n<p>&lt;3 Anu</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Apricot - Pistachio Scones</h2>\n    <div class=\"summary\">\n      <p><em>These scones are part whole wheat, part all purpose flour, and I think they would benefit from the addition of a floral note. If it's available to you, I would try adding orange blossom water or rose water, and experimenting a bit. \n<p>\nAlso, the Xanthan gum is optional. If you do use it, I used Bob's Red Mill. I've never used it before, and I found it to be really helpful in keeping the dough together, but a lot of recipes I read didn't use it, and the recipe authors in those cases were fine. \n![](https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg)\n</p></em></p>\n      <p>Yield: 12 scones</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Scones</h4>\n          <li class=\"ingredient\">1 1/4 C All Purpose Flour</li>\n          <li class=\"ingredient\">3/4 C Whole Wheat Flour</li>\n          <li class=\"ingredient\">1/2 Tsp Cardamom</li>\n          <li class=\"ingredient\">1 1/2 Tsp Cinnamon</li>\n<li class=\"ingredient\">3 Tbsp Sugar </li>\n<li class=\"ingredient\">2 Tsp Baking Powder</li>\n<li class=\"ingredient\">1 Tsp Salt</li>\n<li class=\"ingredient\">1/3 C Pistachios</li>\n<li class=\"ingredient\">1/2 C Dry Apricots</li>\n<li class=\"ingredient\">3/4 C Cashews</li>\n<li class=\"ingredient\">1 Tbsp Xanthan Gum</li>\n<li class=\"ingredient\">Maple Syrop (for brushing the tops)</li>\n<pre><code>  &lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;right&quot;&gt;\n  &lt;h3 id=&quot;directions&quot;&gt;Directions:&lt;/h3&gt;\n  &lt;div class=&quot;instructions&quot;&gt;\n    &lt;p&gt;\n    1.) Preheat the oven to 375 F, and oil/grease a cookie sheet. Put Cashews and Xanthan Gum in a bowl, and add boiling water to submerge cashews. You want to let the cashews hydrate a bit while you're mixing up other stuff.\n</code></pre>\n<p>\n2.) Chop your apricots into bits - 1/4 - 1/2 inch in size, and put them in a bowl. Add boiling water to those too - re-hydrating them keeps them juicy during the baking process. \n</p><p>\n3.) Mix your flours, salt, baking powder, sugar, cardamom, and cinnamon. Make sure all ingredients are fully mixed in. \n</p><p>\n4.) Roughly chop your pistachios, and throw them into the flour. Give it a quick toss to make sure your pistachios are even incorporated. \n</p><p>\n5.) Drain the apricot water into the bowl with cashews and Xanthan gum. Throw the cashews, gum, and some water into the blender. You want it to be the consistency of a thick greek yogurt, so add as much water as you need to get it there, a little bit at a time. \n</p><p>\n6.) Add your apricots to the flour and give it a quick toss, making sure the apricots are even through the dough. \n</p><p>\n7.) Add your cashew mixture a half cup at a time, until the dough is slightly sticky, and shaggy, but holds together. You don't want to over-knead. This is VERY IMPORTANT. DO NOT OVER-KNEAD. \n</p><p>\n8.) Once your dough has just come together, dump it onto a floured surface, and fold it over twice - once top to bottom, flatten out, then from the other side. THAT'S IT. LEAVE IT ALONE. It's done. \n</p><p>\n9.) Form into a disk about 1 - 1/2 inch thick, and cut into whatever shape you want. I went with the classic triangles, but it's up to you. \n</p><p>\n10.) Brush the bottoms with a touch of flour, and the tops with maple syrup. Pop into the oven, and bake for 15 - 20 minutes. I checked on them at 15, and discovered that they needed a bit more time to not be dense and dough-y. \n</p><p> \n11.) Eat piping hot! Slice them open, enjoy them with a bit of additional maple syrup or a pat of butter, and a delicious cup of tea!\n        </p>\n      </div>\n    </div>\n  </div>\n</div>","plaintext":"I've been watching Parks and Recreation lately, and I am constantly inspired by\nthe friendships Leslie cultivated with the women in her life. So, this post, I'm\ntaking a page out of her book, and writing a love letter to Sumu, my co-writer,\nsoul sister, and fellow adventurer.\n\nSpecial shout-out to the lady who taught me how to be a friend; my mom. My mom\nis intelligent, beautiful, and determined. But above all, she's caring and real.\nShe has a loving and compassionate heart, and seeing her with her friends is\nsomething I will always cherish. I am so glad that we've grown into a\nfriendship. I'm the lame kid whose mom is her best friend. And I am really\nreally really lucky.\n\n\n\nDear Sumedha,\n\nThanks for being amazing. For coming to the rescue every time my pictures are\nsideways, or I can't figure out my own cellphone. For bringing Mindy's and\nAziz's books home because you knew I was dying to read them, making me a\nscrapbook so I wouldn't have to make my own, and putting together an otter\nwatching road trip itinerary, so that I could go on a stress free but totally\nplanned ride.\n\nThanks for putting up with me when I get temporarily obsessed with boy bands.\nThanks for laughing at me when I snap back to my senses. With your love, nobody\ncan drag me down.\n\nThanks for being brown with me. And watching Meet the Patels with me over the\nphone. This is what dreams are made of.\n\n\n\nThanks for always reassuring me about my admittedly glorious self, and being\nhonest but kind when I look bad in something. Thanks for encouraging my dreams,\nand constantly believing in me. You are the person I send selfies to when I feel\ngood about myself, and I love that about our relationship.\n\nYou're incandescent, smart, lovely, talented, kind, caring, and authentic. You\nare an incredible friend, which is perhaps one of the best things I could say\nabout a person. I am so lucky to have you in my life.\n\n\n\nThanks for being my otter watching and blog partner. Thanks for being the Joey\nto my Chandler, the Ann to my Knope, and the Tina to my Amy.\n\n\n\nAlso, thanks for being the first of the two of us to not post on her day. It\nreally took the pressure off of me (I think we BOTH thought it would be me!), so\nthanks. I love you, man.\n\nIn honor of our friendship, Friends, and Valentines Day itself, I made scones. I\nhope you like them.\n\n\n\n<3 Anu\n\nApricot - Pistachio Scones\nThese scones are part whole wheat, part all purpose flour, and I think they\nwould benefit from the addition of a floral note. If it's available to you, I\nwould try adding orange blossom water or rose water, and experimenting a bit.\nAlso, the Xanthan gum is optional. If you do use it, I used Bob's Red Mill. I've\nnever used it before, and I found it to be really helpful in keeping the dough\ntogether, but a lot of recipes I read didn't use it, and the recipe authors in\nthose cases were fine. \n![](https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg)\n\n\n\nYield: 12 scones\n\nTotal Time:  1 hour\n\nIngredients:\nScones\n1 1/4 C All Purpose Flour\n 3/4 C Whole Wheat Flour\n 1/2 Tsp Cardamom\n 1 1/2 Tsp Cinnamon3 Tbsp Sugar 2 Tsp Baking Powder1 Tsp Salt1/3 C Pistachios1/2\nC Dry Apricots3/4 C Cashews1 Tbsp Xanthan GumMaple Syrop (for brushing the tops)  </div>\n</div>\n<div class=\"right\">\n  <h3 id=\"directions\">Directions:</h3>\n  <div class=\"instructions\">\n    <p>\n    1.) Preheat the oven to 375 F, and oil/grease a cookie sheet. Put Cashews and Xanthan Gum in a bowl, and add boiling water to submerge cashews. You want to let the cashews hydrate a bit while you're mixing up other stuff.\n\n\n\n2.) Chop your apricots into bits - 1/4 - 1/2 inch in size, and put them in a\nbowl. Add boiling water to those too - re-hydrating them keeps them juicy during\nthe baking process.\n\n\n3.) Mix your flours, salt, baking powder, sugar, cardamom, and cinnamon. Make\nsure all ingredients are fully mixed in.\n\n\n4.) Roughly chop your pistachios, and throw them into the flour. Give it a quick\ntoss to make sure your pistachios are even incorporated.\n\n\n5.) Drain the apricot water into the bowl with cashews and Xanthan gum. Throw\nthe cashews, gum, and some water into the blender. You want it to be the\nconsistency of a thick greek yogurt, so add as much water as you need to get it\nthere, a little bit at a time.\n\n\n6.) Add your apricots to the flour and give it a quick toss, making sure the\napricots are even through the dough.\n\n\n7.) Add your cashew mixture a half cup at a time, until the dough is slightly\nsticky, and shaggy, but holds together. You don't want to over-knead. This is\nVERY IMPORTANT. DO NOT OVER-KNEAD.\n\n\n8.) Once your dough has just come together, dump it onto a floured surface, and\nfold it over twice - once top to bottom, flatten out, then from the other side.\nTHAT'S IT. LEAVE IT ALONE. It's done.\n\n\n9.) Form into a disk about 1 - 1/2 inch thick, and cut into whatever shape you\nwant. I went with the classic triangles, but it's up to you.\n\n\n10.) Brush the bottoms with a touch of flour, and the tops with maple syrup. Pop\ninto the oven, and bake for 15 - 20 minutes. I checked on them at 15, and\ndiscovered that they needed a bit more time to not be dense and dough-y.\n\n  \n11.) Eat piping hot! Slice them open, enjoy them with a bit of additional maple\nsyrup or a pat of butter, and a delicious cup of tea!","feature_image":"https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d7","name":"scones","slug":"scones"},{"id":"5c47a6f22037ef002282c2d8","name":"greatbritishbaking","slug":"greatbritishbaking"},{"id":"5c47a6f22037ef002282c2d9","name":"galentinesday","slug":"galentinesday"},{"id":"5c47a6f22037ef002282c2da","name":"valentinesday","slug":"valentinesday"},{"id":"5c47a6f22037ef002282c2db","name":"parksandrecreation","slug":"parksandrecreation"},{"id":"5c47a6f22037ef002282c2dc","name":"leslieknope","slug":"leslieknope"},{"id":"5c47a6f22037ef002282c2dd","name":"leslieandann","slug":"leslieandann"},{"id":"5c47a6f22037ef002282c2de","name":"amypoehler","slug":"amypoehler"}]}}]}},"pageContext":{"limit":6,"skip":18,"numPages":10,"currentPage":4}}