{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c378","uuid":"4f6c5f80-e95b-43b4-882b-0df100605e8e","title":"New City, New Beginnings","slug":"new-city-new-beginnings","published_at":"14 April, 2016","plaintext":"So things have been a bit crazy for me over the last few weeks. I made my first\nsolo move as an adult. I packed up my apartment in Sunnyvale and finally  moved\nto San Francisco. If you're wondering why I picked this specific Van Morrison\nsong, I felt like it was meant to be. The song Saint Dominic's Preview has a lot\nof references to the Saint Dominic's Church on the intersection of Bush and\nSteiner in San Francisco, literally a block from my new apartment. Everyday when\nI walk back from the bus stop after work, I pass by this gorgeous church and\nadmire it. It just felt right to pick this song for the post. :)\n\nHowever, if that song isn't your speed and you want something a little more\nsultry, try this one by Carmen McRae.\n\nI've had a blast since moving out here. I get to see my friends almost every\nday. I have a wonderful new roommate who I've known since college. Even after\nonly a week, I've got to attend all sorts of weird and yet awesome things! This\nwas an art exhibit that was installed right outside City Hall over this past\nweek.\n\n\n\n\n\nAnd best of all, I get to cook with my friends, both old and new! I went over to\na friend's place yesterday night and me and a new friend, Kerry, began to make\nsome DELICIOUS fresh spring rolls. Granted, the recipe for this has been posted\non this site before, the food could never have been more delicious and\ndifferent. We filled these with lettuce, shrimp, vermicelli noodles, and more!\nWe even made some peanut sauce to dip the rolls in (just mix some hoisin sauce\nand creamy peanut butter together). Simple, yet delicious!\n\nWe did have some mishaps during the process. San Francisco kitchens are usually\nTINY, as are a lot of the apartments. My friend's kitchen is very much sizable\nfor 1 person cooking. When you try to squeeze 4 people in there, chaos ensues.\n\n 1. We were lied to about the presence of peanut butter, hence sending the boys\n    on one trip to the store\n 2. Kerry and I weren't aware that the pasta strainer LOCKED onto the pot we\n    were cooking the noodles in. This unfortunately caused ALL of the noodles to\n    fall into the sink, hence a second trip to the store to get more noodles\n 3. The boys may never let us live this down. Highly unlikely after all the sass\n    given while Kerry and I made their dinner.\n 4. They showed me this amazing group that performs acoustic covers of popular\n    songs [https://www.youtube.com/watch?v=3Y7Vq9749s8]... MIND BLOWING. I'm not\n    gonna lie I may have teared up a bit.\n\nWhile I may not have an explicit recipe for you, I have plenty of photos and\nfull stomachs as proof. Enjoy!","feature_image":"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c30e","name":"spring rolls","slug":"spring-rolls"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c30f","name":"fresh rolls","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c317","name":"shrimp","slug":"shrimp"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c359","uuid":"a15671eb-987c-4a1e-b6cb-d2b26eff884a","title":"Netflix and Chilaquiles","slug":"netflix-and-chilaquiles","published_at":"20 January, 2016","plaintext":"This Christmas vacation, Anagha and I were reunited for the first time in almost\na year. There are many phases of a best friend reunion, according to this \nbuzzfeed article\n[http://www.buzzfeed.com/kelseydarragh/when-your-bff-comes-to-town#.nsbQEmYJq].\nPretty much every single thing in that article happened, except in our\nfriendship instead of drinking our weight in wine, we cook. And eat.\n\nA LOT OF FOOD\n\n\n\nI'm pretty sure Anagha spent 50% of her time at my place and the other 50% at\nher own parents' house. We didn't even do anything most of the time... I would\nbe working and she would be reading at the opposite end of the table. She had\nalso never met the newest addition to my family, Miggy Pramod, who is basically\nthe most adorable dog known to man.\n\nTrue to form, they became best friends immediately.\n\n\n\nSeriously though, who couldn't love a weirdo that sleeps like this regularly?\n\n\n\nJust look at him.\n\n\n\nThis past August, my dad decided that my mom's birthday gift would be to finally\nget a puppy. My entire family, brimming with excitement, spent hours and hours\nlooking on petfinder.com and various shelter sites for the perfect little CALM\naddition to our family. After countless shelter visits and close calls with\nvarious puppies, we were extremely tired and disheartened. The process of\nfinding the perfect dog for our family had become a lot more emotionally\ndraining than we had originally thought. My mom wasn't sure if she could get\nattached to another dog and see him/her join another family. Then one day, my\nparents went to this small little animal hospital in Sterling Heights, MI and\ninstantly became smitten with, what we were told, was a little beagle mix. He\nwas an adorable 18 pound ball of affection who just wanted to play. One week\nlater, he was ready to come home.\n\n\n\nHe was a VERY little 5 month old puppy. Little did we know that the tiny little\nboy that we brought home was a little more German Shepherd than Beagle.\nCurrently, Miggy is a happy 40 pounds and the obsession of my entire family,\nweird sleeping positions, ear licking fetishes and all.\n\nANYWAYS putting the puppy love aside, whenever we weren't spoiling Miggles with\nnever ending attention, we were watching Netflix and eating All The Brunch. If\nit hasn't become obvious from some of our previous posts\n[http://cookinginpjs.com/brunch-conquers-all/], We LOVE  brunch. Best of all, it\nmeans that we can roll out of bed in our pajamas and enjoy some scrumptiousness\nthat we could concoct using eggs and veggies. Yay Pajamas! YAY Brunch!\n\nThen, it's time for a relaxing, vacation time food coma. There's that one\nepisode of friends where Joey and Ross discover that they are each other's best\nnap buddies. Exactly. Who DOESN'T  want a nap buddy and best of all your best\nfriend?! So we spent most of our afternoons watching Netflix and chilling (no\nnot like that you perv!) but literally watching Netflix reruns and napping with\nmy puppy.\n\nBest. Break. Ever.\n\n\n\nWe also love Mexican food. No explanation needed. It's just the best. So\nOBVIOUSLY nothing could be better than combining the two things we are always\ncraving. In came chilaquiles.\n\nI've had varieties of chilaquiles in the past. From the beaches of Cancun to the\nstreets of San Francisco and San Diego. Everywhere, they put their own spin on\nthe classic Mexican dish. Traditionally it's kept very simple with just fried\ntortillas, salsa, egg, and beans (and/or meat). California, on the other hand,\ntends to add avocado to everything so it's very colorful. Our variation probably\nincludes WAY more vegetables than most but I love it and it tasted delicious.\n\n\n\n\n\n\n\n\n\nChilaquiles\nIngredients:\n1 bottle Salsa Verde\n[http://www.lavictoria.com/products/salsa/thickn-chunky-salsa-verde-medium/]\n 1 bag tortilla chips\n 1 can black beans\n Sumedha's Super Secret Fajita Seasoning\n[http://cookinginpjs.com/estoy-cantando/]\n 1 avocado cubed\n 1 egg per person\n sour cream\n cheese (shredded or Cotija)\n chopping cilantro to garnish\n Pico De Gallo Salsa\n2 roma tomatoes\n 1/2 onion diced\n 1/4 cup chopped cilantro\n lemon juice to taste\n salt to taste\n Corn Salsa\n1 can sweet corn kernels\n 4 sliced jalapeños (more or less based on your spice tolerance)\n lemon juice to taste\n salt to taste\n Directions:\nPut two handfuls of tortilla chips in a pan and cover with the salsa verde. Let\nthe chips soak on low-medium heat while completing the remaining steps. Make\nsure to stir occasionally so all of the chips are covered in salsa\n\nCook the beans with as much of Sumedha's Super Secret Fajita Seasoning as you\nlike. For each salsa, combine the ingredients in a bowl and keep to the side.\n\nWhen the beans are almost done, make one sunny side up egg for each person. You\nare more than welcome to scramble them if you don't like runny eggs.\n\nSpread the soaked tortilla chips on each plate. Layer the beans, egg, salsas,\navocado, cheese, sour cream and cilantro on top of the chips. Grab your fork and\nknife and let the egg yolk flow. ;)","feature_image":"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg","tags":[{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2b9","name":"chilaquiles","slug":"chilaquiles"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ba","name":"reunion","slug":"reunion"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c2bf","name":"naps","slug":"naps"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c357","uuid":"37a98e77-e446-4f06-bbf8-6fbc1677f180","title":"The only thing weird would be if someone didn't like Mexican food, because I'm making FAJITAS!!","slug":"im-making-fajitas","published_at":"14 January, 2016","plaintext":"We all love Ross. Despite his many divorces and nerdy dinosaur quirks, Dr.\nGellar (no not that kind of doctor) was one of my favorite characters on\nFriends. Every time I make fajitas I remember Ross absolutely \"NOT\" being weird\nabout Joey and Rachel starting to go out. One of the most classic Ross moments\non the show.\n\n\n\nI was in India when Netflix released all ten seasons of Friends.\n\nALL. TEN. SEASONS. EASILY. ACCESSIBLE. ON. THE. INTERNET.\n\nThis was huge. I can't even begin to count the endless number of illegally\nuploaded episodes I've watched on YouTube with Spanish subtitles. I ended up\nlearning various inappropriate words through context. Made for some fun giggles\nduring Spanish class.\n\nWhile I was searching a mood song for this post, I stumbled onto this gem. It's\nso weird that it HAD to make it into the post.\n\nBack to the point. So this January when I was in India, my cousin had major\ncravings for Mexican food. We decided to enhance our existing Galentine's Day\nplans from just red velvet cupcakes\n[http://cookinginpjs.com/galentines-day-cupcakes/]  to include some simple yet\ndelicious Mexican food.\n\nA lot of the parts of this recipe have already been posted in other posts, so\nI'm just going to link those rather than retyping. I just sautéd a some spinach,\nbell peppers, onions, and mushrooms with my own fajita seasoning\n[http://cookinginpjs.com/estoy-cantando/]  recipe. Added some corn salsa and \nhomemade sour cream [http://cookinginpjs.com/taco-tuesday/]  and flour tortillas\n[http://cookinginpjs.com/taco-tuesday/]. All you have left to do is roll it up\nand enjoy!\n\nRecipes:\n\n * fajita seasoning [http://cookinginpjs.com/estoy-cantando/]\n * homemade sour cream & flour tortillas [http://cookinginpjs.com/taco-tuesday/]","feature_image":"https://pramods.box.com/shared/static/3chnt4gzvs3sg5exnvkiiy2q53zgqxfd.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c252","name":"fajitas","slug":"fajitas"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c29d","name":"ross","slug":"ross"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"slug":"friends","limit":6,"skip":0,"numPages":1,"currentPage":1}}