{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Did you fall for a shooting star?","slug":"did-you-fall-for-a-shooting-star","feature_image":"https://farm9.staticflickr.com/8782/17033305629_16faa89701_b.jpg","published_at":"21 April, 2015","html":"<p><img src=\"https://farm9.staticflickr.com/8800/16599263773_a24ff9384b_b.jpg\" alt=\"\"></p>\n<p>Anyone who knows me, knows I'm obsessed with a wine called &quot;Drops of Jupiter.&quot; And why not?! One of my favorite bands, Train, partnered with a California winery to make a line of wines named after some of their most famous songs! What could be better than that!</p>\n<p>This was a great wine for me and my friends, especially because we all have different preferences when it comes to wine. I prefer a really deep spicy red, whereas most of my friends like drier whites or dessert wines. Surprisingly, this wine solved most of our dilemmas. Each glass is smooth, sweet and spicy, but doesn't lean too far in either direction. It has something for all shades of wine lovers! (Plus it doesn't hurt that it's under $10) It's a college wine lover's dream! :)</p>\n<p><img src=\"https://farm9.staticflickr.com/8782/17033305629_16faa89701_b.jpg\" alt=\"\"></p>\n<p>Drops of Jupiter is not even the only type of wine that the Save Me San Francisco Wine Co makes. They also make Calling All Angels, California 37, Bulletproof Picasso, Hella Fine, and Soul Sister.</p>\n<p>Just pour yourself a glass, blast <a href=\"https://www.youtube.com/watch?v=7Xf-Lesrkuc\">Drops of Jupiter</a>, and take a trip back to the 90's!</p>\n<p><img src=\"https://38.media.tumblr.com/tumblr_m33pmsMyUY1qflcm5o1_500.gif\" alt=\"\"></p>\n","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c247","name":"wine","slug":"wine"},{"id":"5c47a6f22037ef002282c248","name":"drops of jupiter","slug":"drops-of-jupiter"},{"id":"5c47a6f22037ef002282c249","name":"train","slug":"train"},{"id":"5c47a6f22037ef002282c24a","name":"red wine","slug":"red-wine"}]}},"pageContext":{"slug":"did-you-fall-for-a-shooting-star","previous":{"html":"<p><img src=\"https://farm8.staticflickr.com/7651/16863218825_882de53cd6_b.jpg\" alt=\"\"></p>\n<p>Frita Batidos is one of the crown jewels of Ann Arbor, MI.  It is a small cuban street food restaurant in downtown Ann Arbor. While it may be a slight walk from the University of Michigan campus, many students make the trek despite any ridiculous weather conditions to get a bite of these burgers.</p>\n<p>They have the one of the most delicious, insanely huge and jam packed burgers I’ve ever eaten in my life. No matter the patty you want inside your burger, whether it be black bean, chicken, or chorizo, you’re bound to get a tasty concoction which will blow your mind. Honestly I have yet to meet a person at the University of Michigan who doesn’t like their burgers.</p>\n<p>The basic burger (or Frita) is simple, just the patty between two egg buns and stuffed with fries. I also added some cilantro-lime salsa and tropical slaw to juice it up a little. Safe to say, I don’t think I would be trying to impress anyone while eating this monstrosity.</p>\n<p><img src=\"https://farm8.staticflickr.com/7598/16243253993_f6b6d7018a_b.jpg\" alt=\"\"></p>\n<p>My brother always goes with a sunny side up egg and avocado spread on his frita. As soon as you bite into the burger, the yolk bursts, spreading that wonderful flavor into every bite thereafter.</p>\n<p><img src=\"https://farm9.staticflickr.com/8679/16837349936_c34c5ef899_b.jpg\" alt=\"\"></p>\n<p>This trip to Frita Batidos was special because we brought one of my friends here for her first time. She decided to go big or go home and made her frita “loco.” This means that they just go “loco” and add ALL of their available toppings on top of your burger: muenster, a sunny side up egg, cilantro lime salsa, tropical slaw, AND avocado spread! This is pretty much the mother of all burgers. I mean its GINORMOUS. My friend wasn’t even able to attempt to eat this with her hands. But oh was it delicious.</p>\n<p><img src=\"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg\" alt=\"\"></p>\n<p>Don’t get me started on their garlic-cilantro fries. Frita Batidos has some of the simplest yet most amazing fries I’ve had.  I can’t even describe them, you have to try them yourself!</p>\n<p><img src=\"https://farm8.staticflickr.com/7588/16863220175_acd3bd5a0b_b.jpg\" alt=\"\"></p>\n<p>If you are ever in Ann Arbor <strong>MAKE SURE</strong> you head to downtown to taste one of these monstrosities, these glorious monstrosities of Frita Batidos.</p>\n<p>Check them <a href=\"http://www.fritabatidos.com\">out</a>!</p>\n","title":"The Glorious Monstrosities of Frita Batidos","slug":"frita-batidos","published_at":"27 March, 2015","feature_image":"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","slug":"fries"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","slug":"eating-out"},{"id":"5c47a6f22037ef002282c263","slug":"frita-batidos"},{"id":"5c47a6f22037ef002282c264","slug":"burgers"},{"id":"5c47a6f22037ef002282c265","slug":"cuban"},{"id":"5c47a6f22037ef002282c266","slug":"garlic"}]},"next":{"html":"<p><img src=\"https://farm9.staticflickr.com/8573/16406140367_5c5b265be3_b.jpg\" alt=\"\"></p>\n<p>What's Galentine's Day you ask? No one could have answered that question better than Amy Poehler herself, &quot;it's only the best day of the year. Every February 13th, my lady friends and I leave our husbands and our boyfriends at home, and we just come and kick it, breakfast-style. Ladies celebrating ladies. It's like Lilith Fair, minus the angst. Plus frittatas.&quot;</p>\n<p>Ever year on Valentine's Day, my mom sends me a special gift. When I lived it at home, she used to give me and my brother cute small stuffed animals with hearts on them. When I moved to Ann Arbor for college, she took a different approach. Every year, she would send me a heart shaped pizza with my favorite toppings, MUSHROOMS!</p>\n<p>This past Valentine's Day, however, I was in India so neither was possible. So my cousins and I decided to celebrate Galentine's Day instead! We made some delicious red velvet cupcakes from scratch, enjoyed some leftover batter, and watched some light hearted chick flicks. All in all, a great way to celebrate our fellow ladies.</p>\n<p><img src=\"https://farm9.staticflickr.com/8625/16587351126_1c46565bdc_b.jpg\" alt=\"\"></p>\n<p>We were pretty lazy about experimenting with the recipe so I will just leave you with <a href=\"http://sallysbakingaddiction.com/2014/10/29/red-velvet-cupcakes/\">the recipe we used</a> for the cupcakes and made a basic chocolate icing following the instructions on the bag of confectioners sugar.</p>\n<p><img src=\"https://farm9.staticflickr.com/8631/16587382106_5c03caf20b_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8562/16426167478_8bc9ab2160_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8652/16612747142_14252b62a0_b.jpg\" alt=\"\"></p>\n<p>&quot;February 14th, Valentine's Day, is about romance. But February 13th, Galentine's Day, is about celebrating lady friends. It's wonderful and it should be a national holiday.&quot;</p>\n<ul>\n<li>Leslie Knope</li>\n</ul>\n<p><img src=\"https://farm9.staticflickr.com/8654/16587426526_d0f65cdbf7_b.jpg\" alt=\"\"></p>\n","title":"Galentine's Day Cupcakes","slug":"galentines-day-cupcakes","published_at":"01 May, 2015","feature_image":"https://farm9.staticflickr.com/8573/16406140367_5c5b265be3_b.jpg","tags":[{"id":"5c47a6f22037ef002282c253","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c254","slug":"galentines-day"},{"id":"5c47a6f22037ef002282c255","slug":"desserts"},{"id":"5c47a6f22037ef002282c256","slug":"red-velvet"},{"id":"5c47a6f22037ef002282c257","slug":"valentines-day-2"}]}}}