{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c380","uuid":"b112724c-4311-432f-81e6-540c215fce32","title":"Ba-na-na Ba-na-nana Po-ta-tooo Po-ta-to-naaaa","slug":"ba-na-na-ba-na-nana-po-ta-tooo-po-ta-to-naaaa","published_at":"05 May, 2016","html":"<p>K this second post for the week took a bit longer than expected but I finally perfected the pictures so we're good now. YAY Post #2 for the week! And that too, to celebrate one of the nerdiest holidays out there! STAR WARS DAY!</p>\n<p><img src=\"https://media.giphy.com/media/4PbEHW8mN4xhK/giphy.gif\" alt=\"\"></p>\n<p>All the wonderful puns.</p>\n<p>Also because this recipe is banana filled, I HAD the little song by the Minions from Despicable Me stuck in my head. So I figured I should share that adorableness and mental torture with you guys.</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/sFukyIIM1XI?wmode=transparent\"></iframe>\n</div>\n<p>Anyways... after being home sick for an entire week in what I consider my personal version of solitary confinement, I hit a new level of insanity. I was deprived of social interaction to such a point that I legit LOL'd at a Buzzfeed article of ridiculous snapchats for a good 20 minutes. And by LOL'd I mean curled over laughing so hard I could barely breathe. No Buzzfeed article is THAT funny. I had such bad sinus pain that working on my computer for long periods of time was pretty rough. So I decided rather than wallowing in my bed, I was going to make SOME productive use of my time... baking for you guys!</p>\n<p>I found this recipe on Pinterest a while back of <a href=\"http://www.carlsbadcravings.com/cream-cheese-stuffed-chocolate-chip-banana-coffee-cake-recipe/\">Cream Cheese Filled Chocolate Chip Banana Coffee Cake</a>. I do want to preface my recipe with this:</p>\n<ol>\n<li>I didn't some of the ingredients so this is my altered version for lazy bakers :)</li>\n<li>I also don't have a bundt cake pan, so mine didn't come out as gorgeous looking as this but there is one thing I CAN guarantee, which is that they came out DELICIOUS. Probably one of my favorite desserts I've ever made, next to Tiramisu and my mom's Mush Cake.</li>\n<li>I didn't have brown sugar and didn't want to bother making a second grocery store trip for that so I just didn't bother making the streusel topping that was in the original recipe. I can only imagine how much more mind blowing it would have been had I added the streusel, maybe you can make yours with it and let me know!</li>\n</ol>\n<p><img src=\"https://pramods.box.com/shared/static/1tjouximy6nxjmeaomjqkrsd4i5ouqxi.jpg\" alt=\"\"></p>\n<p>Over the last few weeks I've been trying to figure out where in my new apartment I can do my food photography to optimize the natural light coming from my windows. In my old apartment it was extremely easy, I had giant sliding doors which brought in ALL the light and shown over pretty much my entire living room; and if that wasn't enough then I could go out onto my balcony and take the photos there! It was perfect. This week I discovered that if I angle one of my side tables properly and place the dish inside it, the light reflects off the walls of the table perfectly onto the the food and really brings out all the details in the food! I HAD FINALLY FIGURED IT OUT! Although this weird positioning did lead to some old people back pain for me because of the weird positions that I laid in on the floor to get these photos. Such is the pain for beauty.</p>\n<p><img src=\"https://pramods.box.com/shared/static/l2l9lmho8q088kczuewl9ll8ec4uz2b8.jpg\" alt=\"\"></p>\n<p>I mean just look at it...</p>\n<p>This is one recipe I would HIGHLY recommend you try, whether it be my interpretation or the original recipe itself. It was delicious and my coworkers and friends LOVED it.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ficxwsing8l7wulb6s5v3pvs4w4grit7.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chocolate Chip Banana Cheesecake Coffee Cake </h2>\n    <div class=\"summary\">\n      <p><em>If you don't have over-ripe bananas, then Carlsbad Cravings gave a great suggestion of sticking them in the oven at 325 F degrees until they're dark on the outside and soft to the touch.</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n        <h4>Banana Coffee Cake</h4>\n          <li class=\"ingredient\">2 1/4 cups all purpose flour</li>\n          <li class=\"ingredient\">1 1/4 tsp baking powder</li>\n          <li class=\"ingredient\">1 1/4 tsp baking soda</li>\n          <li class=\"ingredient\">1 tsp salt</li>\n          <li class=\"ingredient\">2 tsp cinnamon</li>\n          <li class=\"ingredient\">1/2 cup butter, softened</li>\n          <li class=\"ingredient\">1 1/2 cup sugar</li>\n          <li class=\"ingredient\">2 large eggs</li>\n          <li class=\"ingredient\">4 large bananas, over-ripe and mashed</li>\n          <li class=\"ingredient\">1 tbsp vanilla extract</li>\n          <li class=\"ingredient\">1 1/4 cups non-fat plain yogurt (or greek yogurt)</li>\n          <li class=\"ingredient\">3/4 cup chocolate chips</li>\n        <h4>Cheesecake filling</h4>\n          <li class=\"ingredient\">16 oz cream cheese, softened</li>\n          <li class=\"ingredient\">1/2 cup reserved batter (from banana coffee cake above)</li>\n          <li class=\"ingredient\">1/2 cup sugar</li>\n          <li class=\"ingredient\">2 tsp vanilla extract</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Preheat oven to 350 degrees F and spray your pan with nonstick cooking spray and flour the inside of your pan.</p>\n        <p>In a medium bowl, whisk together flour, baking powder, baking soda, salt, and cinnamon. Set aside.</p>\n        <p>Using a hand mixer, beat the butter and sugar together until fluffy. Add the eggs in one at a time and beat until blended. Mix in the vanilla and bananas until just combined.</p>\n        <p>Gradually add the dry ingredients to the wet ingredients, alternating with the yogurt. Beat until just combined. Measure out 1/2 cup of batter and keep aside for the cheesecake filling. Stir in the chocolate chips into the remaining batter and keep aside. Measure out about 1 cup of the batter with chocolate chips and keep aside to layer on top of the cheesecake filling. Pour the remaining batter into your pan.</p>\n        <p>In a separate bowl, mix together the 1/2 cup batter you set aside earlier with the rest of the cheesecake filling ingredients on high speed until smooth and creamy.</p>\n        <p>Spread the cheesecake filling on top of the current layer batter in the pan. It's okay if it sinks in a bit, this cake is much more moist than the original recipe so the cheesecake layer is more variable in size. Pour the top layer of batter on top of the cheesecake filling. If you made a streusel, now is the time to sprinkle it on top.</p>\n        <p>Bake for 55-60 minutes at 350 degrees F or until toothpick inserted comes out clean (ignoring the melted chocolate chips and any possible cream cheese that still may not be solid). Let it cool and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/lozxye3uf7ndz1bq5qwgk1o2lajyls2a.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/ialsxs0p5kgc7foopbw58jrhar6jgh74.jpg\" alt=\"\"></p>\n<p>![] (<a href=\"https://pramods.box.com/shared/static/opdcb8ciiq9ib1qbz8nfbz84gtjvanxz.jpg\">https://pramods.box.com/shared/static/opdcb8ciiq9ib1qbz8nfbz84gtjvanxz.jpg</a>)</p>\n<p><img src=\"https://pramods.box.com/shared/static/aof6kocepcho6w5yauqnzhv6mtlxbruc.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/e280e6xw9g6h0p4m05q7nexwwj3vrtby.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/l2l9lmho8q088kczuewl9ll8ec4uz2b8.jpg","tags":[{"id":"5c47a6f22037ef002282c291","name":"banana","slug":"banana"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c32b","name":"chocolate chips","slug":"chocolate-chips"},{"id":"5c47a6f22037ef002282c32c","name":"experiments","slug":"experiments"},{"id":"5c47a6f22037ef002282c32d","name":"minions","slug":"minions"},{"id":"5c47a6f22037ef002282c32e","name":"star wars","slug":"star-wars"},{"id":"5c47a6f22037ef002282c32f","name":"sick days","slug":"sick-days"}]}}]}},"pageContext":{"slug":"chocolate-chips","limit":6,"skip":0,"numPages":1,"currentPage":1}}