{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c360","uuid":"bd3e7708-eadc-4969-886c-47fdd2138304","title":"How to do a food crawl","slug":"food-crawl","published_at":"25 April, 2016","html":"<p>I'm sure most of y'all have been on a bar crawl - you have a list of bars, and you hit them up one after the other, sipping a little of this and a little of that at each one.</p>\n<p>This is similar, but with FOOD. While you are certainly welcome bring booze into the mix, these are instructions for figuring out an all food crawl; it's an excellent way to explore a new city!</p>\n<p>It's also a really good way to spend a couple of hours with friends without spending a ton of money; if you're on a budget, this is a great way to try lots of different food, and see quite a bit, without breaking the bank. We each paid for one entree at one place, and it came out perfectly for us!</p>\n<p>First, you need a walkable city. I myself did this with my friends Eden and Hafsa in San Francisco, the day I last left Sumu.</p>\n<p><img src=\"https://pramods.box.com/shared/static/nswhwh2moi2lyt9ett886237vfike5xh.jpg\" alt=\"\"></p>\n<p>Second, do some preliminary research. Don't actually choose all the places you want to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff you're interested in exploring. We found ourselves wandering around the Mission District, ogling wall art and talking about gentrification.</p>\n<p>Third, set off on your journey! Start with a place you know you want to go to; we started with Philz Coffee, which also let us sip and wander for a bit before we found real food.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg\" alt=\"\"></p>\n<p>Over the course of the next several hours, we tried Thai food, Mexican food, Vietnamese food, and, finally, Ethiopian food. At each place, we would choose one entree to share, so that in the end, we all got to try tons of yummy food for relatively little!</p>\n<p>We were having so much fun we failed to take a lot of pictures, but this is definitely one of those days that I'll be remembering for quite a while! If you do a food crawl, let me know how it goes!</p>\n<p>And, if you're in DC or San Francisco and you're interested in doing this, hit Sumu or I up! We'd love to have you :)</p>\n","feature_image":"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c250","name":"thai","slug":"thai"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c31b","name":"betterlate","slug":"betterlate"},{"id":"5c47a6f22037ef002282c31c","name":"than never","slug":"than-never"},{"id":"5c47a6f22037ef002282c31d","name":"monday","slug":"monday"},{"id":"5c47a6f22037ef002282c31e","name":"food crawl","slug":"food-crawl"},{"id":"5c47a6f22037ef002282c31f","name":"ethiopian","slug":"ethiopian"},{"id":"5c47a6f22037ef002282c320","name":"mission","slug":"mission"}]}}]}},"pageContext":{"slug":"ethiopian","limit":6,"skip":0,"numPages":1,"currentPage":1}}