{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c365","uuid":"4f72efc4-4172-4a09-a4ad-9aa43784c7d8","title":"Well Son, When a Croissant Loves a Donut...","slug":"well-son-when-a-croissant-loves-a-donut","published_at":"27 June, 2015","plaintext":"\n\n(Here's some music for inspiration :P)\n\nIn 2013, New York was swept over with a new kind of fever.... Cronut Fever. A\nchef in New York City decided that he would take croissant dough and fry it like\na donut. This scrumptious flaky dessert became SO  popular that there was even a\nblack market for them! People would pay $100 on the black market for a cronut\nthat could be bought for $5 if they waited in line for a day.\n\nI'd never tasted a cronut before in my life, so I decided to make use of a bunch\nof stale croissants I had lying around after a road trip. I tore the croissants\ninto bite size pieces and fried them in hot oil and count to 4. Quickly flip\neach cronut and fry again for 4 counts. Make sure not to cook them for too long\nor they get a little too crunchy and burn.\n\n\n\nPlace the fried bites onto paper towels to drain any excess oil. When cooled,\ndrizzle with any icing of your choice or enjoy them by themselves!\n\nThey were flaky yet crunchy, salty yet buttery. It was amazing! I completely\nunderstand what the fuss was in New York City at the time.\n\n\n\n\n\nHowever, I learned a few things while making these. Making them with\nstore-bought croissants is fine, however you get the proper ratio of flakiness\nto fried crunchiness when you use croissant dough. It is also easier not to burn\nthem while frying when you use dough. I am not a huge fan of too much oil, so\nfrying the croissants wasn't my favorite. Maybe there's a way to shallow fry\nthem where they won't pick up too much oil, but I have no idea. Next time I try\nmaking cronut bites, I will try to bake store-bought croissants and see if that\nmakes a difference. Who knows!\n\nFor the mean time, I completely suggest you try making these at home! They're\nsimple to make and taste amazing! If you're too lazy then I'd recommend going to\nyour local pastry shop and seeing if they make something similar!","feature_image":"https://lh3.googleusercontent.com/I3bLdLcbLHBZH2QIeDqAX55etYu-5I1Tz94-7LJ62KRW=s800","tags":[{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c283","name":"cronut","slug":"cronut"},{"id":"5c47a6f22037ef002282c284","name":"fried","slug":"fried"},{"id":"5c47a6f22037ef002282c285","name":"croissant","slug":"croissant"}]}}]}},"pageContext":{"slug":"croissant","limit":6,"skip":0,"numPages":1,"currentPage":1}}