{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34f","uuid":"7e8c442d-4c8d-4c6b-8667-33acc5c95e1a","title":"The Glorious Monstrosities of Frita Batidos","slug":"frita-batidos","published_at":"27 March, 2015","plaintext":"\n\nFrita Batidos is one of the crown jewels of Ann Arbor, MI. It is a small cuban\nstreet food restaurant in downtown Ann Arbor. While it may be a slight walk from\nthe University of Michigan campus, many students make the trek despite any\nridiculous weather conditions to get a bite of these burgers.\n\nThey have the one of the most delicious, insanely huge and jam packed burgers\nI’ve ever eaten in my life. No matter the patty you want inside your burger,\nwhether it be black bean, chicken, or chorizo, you’re bound to get a tasty\nconcoction which will blow your mind. Honestly I have yet to meet a person at\nthe University of Michigan who doesn’t like their burgers.\n\nThe basic burger (or Frita) is simple, just the patty between two egg buns and\nstuffed with fries. I also added some cilantro-lime salsa and tropical slaw to\njuice it up a little. Safe to say, I don’t think I would be trying to impress\nanyone while eating this monstrosity.\n\n\n\nMy brother always goes with a sunny side up egg and avocado spread on his frita.\nAs soon as you bite into the burger, the yolk bursts, spreading that wonderful\nflavor into every bite thereafter.\n\n\n\nThis trip to Frita Batidos was special because we brought one of my friends here\nfor her first time. She decided to go big or go home and made her frita “loco.”\nThis means that they just go “loco” and add ALL of their available toppings on\ntop of your burger: muenster, a sunny side up egg, cilantro lime salsa, tropical\nslaw, AND avocado spread! This is pretty much the mother of all burgers. I mean\nits GINORMOUS. My friend wasn’t even able to attempt to eat this with her hands.\nBut oh was it delicious.\n\n\n\nDon’t get me started on their garlic-cilantro fries. Frita Batidos has some of\nthe simplest yet most amazing fries I’ve had. I can’t even describe them, you\nhave to try them yourself!\n\n\n\nIf you are ever in Ann Arbor MAKE SURE  you head to downtown to taste one of\nthese monstrosities, these glorious monstrosities of Frita Batidos.\n\nCheck them out [http://www.fritabatidos.com]!","feature_image":"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c263","name":"frita batidos","slug":"frita-batidos"},{"id":"5c47a6f22037ef002282c264","name":"burgers","slug":"burgers"},{"id":"5c47a6f22037ef002282c265","name":"cuban","slug":"cuban"},{"id":"5c47a6f22037ef002282c266","name":"garlic","slug":"garlic"}]}}]}},"pageContext":{"slug":"burgers","limit":6,"skip":0,"numPages":1,"currentPage":1}}