{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37c","uuid":"9f476c17-460e-41b9-9d63-9f98f2fe4041","title":"Just a little Crostini Weenie","slug":"just-a-little-crostini-weenie","published_at":"11 May, 2016","plaintext":"So I don't have a themed song for this week's post BUT I will leave you with my\nnew obsession for the week. I love the original song by Zella Day but this mix\nis also amazing. Enjoy!\n\nEver since I was a kid, I was always that weird one who LOVED spinach. All my\nfriends would fight and complain but I would ALWAYS ask for more. I know. I was\nthat kid. I was also that kid who would happily drink a glass of plain milk\nevery day. Anyways... I love spinach. Whenever I used to make omelets for my\nmom, she used to complain that she could never find the egg because I had\noverloaded it with so much spinach.\n\nSo when I was living alone in Sunnyvale, I decided one week I was going to be\nsuper healthy and make meals filled with tons of vegetables. Obviously, this\nbeing me, ended up just an obscene amount of spinach and mushrooms. That's about\nit.\n\n\n\nThis recipe is super easy and delicious. Plus it barely takes any time to make!\nEnjoy!\n\n\n\nSpinach Avocado Crostini\nIngredients:\n1 sourdough baguette\na few handfuls baby spinach leaves\n 2 handfuls mushrooms, sliced\n Component 2\n1/4 red onion, diced\n 1 Avocado, diced in larger chunks\n Balsamic Vinaigrette\n Directions:\nMix the avocado chunks with some balsamic vinaigrette in a bowl and keep to the\nside.\n\nSauté the red onions, mushrooms, and spinach in some more balsamic vinaigrette\nor red wine (your choice ;) ) until the spinach has wilted and the mushrooms\nlook like they have been cooked through.\n\nSlice the baguette and top with the avocados and spinach mixtures. Enjoy!","feature_image":"https://pramods.box.com/shared/static/s87a60v38mfk5xbloe2r5i0ftvajj24h.png","tags":[{"id":"5c47a6f22037ef002282c26f","name":"avocado","slug":"avocado"},{"id":"5c47a6f22037ef002282c25a","name":"spinach","slug":"spinach"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c259","name":"mushroom","slug":"mushroom"},{"id":"5c47a6f22037ef002282c334","name":"crostini","slug":"crostini"},{"id":"5c47a6f22037ef002282c335","name":"snack","slug":"snack"},{"id":"5c47a6f22037ef002282c336","name":"sourdough","slug":"sourdough"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c350","uuid":"0471ace4-44cc-4677-a447-dd097e15cbcb","title":"Dirty Dancing: Salsa Nights","slug":"dirty-dancing-salsa-nights","published_at":"01 May, 2015","plaintext":"First of all, Dirty Dancing Havana Nights is one of my favorite movies. The\nmusic, the dancing, and let's not forget Diego Luna. In honor of Diego Luna and\nhis amazing dancing, play the song below while you read this post. Now that\nyou've set the mood, let's get started.\n\nHaving lived in Michigan most of my life, I've been used to eating sub par\nMexican food and grew to love that. However last month when me and my family\nwent to Cancun for a week, I knew I had been missing out on something big. The\namazing flavors of corn tortillas, super flavorful meat (or beans for you\nvegetarians), fresh salsas and Crema Mexicana mesh together for a completely\ndifferent experience of eating simple tacos. Now that I had officially been\nconverted to a taco snob, I was determined to only eat the best of tacos I could\nfind.\n\nConveniently the bay area is filled with the most amazing food, especially when\nit comes to taco trucks. Each taco truck I've visited usually has a side of a\nfew salsas. I was determined to recreate two of my favorite taco truck salsas,\nan avocado tomatillo salsa and a spicy red chili salsa, as authentic as\npossible.\n\n\n\nI found a few recipes online, and experimented on my own and finally ended up\nwith these recipes!\n\n\n\nAvocado Tomatillo Salsa\nFeel free to adjust the number of chilis based on your own spice tolerance. You\ncan also remove the seeds of the chilis to reduce their spice as well. Also keep\nin mind that this salsa tends to be the milder balance to the other super spicy\nred salsa.\n\nIngredients:\n4-5 tomatillos, husked, rinsed, and chopped\n 4-5 serrano chilies\n 1 cup packed cilantro, chopped\n ½ white onion minced\n ¼ cup water\n 1 ripe Hass Avocado\n Lime juice to taste\n Salt and pepper to taste\n Directions:\nBlend all ingredients together in your blender until smooth.\n\n\n\nRed Chili Tomatillo Salsa\nAgain, feel free to adjust the number of chilis based on your own spice\ntolerance. You can also remove the seeds of the chilis to reduce their spice as\nwell. I made mine super spicy and had no complaints so I say go for it!\n\nIngredients:\n5-6 tomatillos, husked, rinsed, and chopped\n 1-2 roma tomatoes chopped\n 6 cloves of garlic\n ½ white onion minced\n 6-7 hot dried red chilies, stemmed\n ½ tsp sugar\n Salt and pepper to taste\n Directions:\nDry roast the chilies and garlic until you can really smell them and they both\nhave darkened a bit. Blend these along with the rest of the ingredients together\nin your blender until smooth.\n\nMake sure to check out my post coming out soon about food truck style tacos I\nmade!","feature_image":"https://farm9.staticflickr.com/8743/17335026415_ff5458c370_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","name":"salsa","slug":"salsa"},{"id":"5c47a6f22037ef002282c26a","name":"spicy","slug":"spicy"},{"id":"5c47a6f22037ef002282c26c","name":"california","slug":"california"},{"id":"5c47a6f22037ef002282c26e","name":"tomatillo","slug":"tomatillo"},{"id":"5c47a6f22037ef002282c26f","name":"avocado","slug":"avocado"},{"id":"5c47a6f22037ef002282c270","name":"chilies","slug":"chilies"},{"id":"5c47a6f22037ef002282c271","name":"taco truck","slug":"taco-truck"}]}}]}},"pageContext":{"slug":"avocado","limit":6,"skip":0,"numPages":1,"currentPage":1}}