{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36a","uuid":"a5004992-c2ed-4f4b-beac-59baa322db49","title":"Everyone needs a 'Lil Dicky' in their life","slug":"everyone-needs-a-lil-dicky-in-their-life","published_at":"19 July, 2016","plaintext":"So recently it was one of my closest friend's, whom we lovingly call Lil Dicky,\nbirthdays. Can't say she's entirely fond of that nickname, but that's 1/2 the\npoint of nicknames anyways. In that spirit, here's some Lil' Dicky for you to\nlisten to while reading this post.\n\nThis may be one of my favorite cakes I've made so far. I've realized that I am a\nBIG BIG fan of chocolate whiskey cakes. The coffee and whiskey that you add in\ntend to cut the sweetness of the coffee perfectly and only leaves a slight\nwhiskey flavoring. It works perfectly! After scouring the internet and Pinterest\nfor recipes, and making myself extremely hungry in the process, I landed on \nthis\nglorious monstrosity [http://omgchocolatedesserts.com/chocolate-poke-cake/].\n\n\n\n\n\nI based my recipe of that cake but made a bunch of modifications to make it more\n\"adult-friendly.\" Enjoy because we sure did!\n\n\n\nChocolate Whiskey Poke Cake\nIngredients:\nChocolate Cake\n1 3/4 cups flour\n 2 cups sugar\n 3/4 unsweetened cocoa powder\n 1 1/2 tsp baking soda\n 1 1/2 tsp baking powder\n 1/4 tsp salt\n 2 eggs\n 1/2 cup brewed coffee\n 1/2 cup Jack Daniel's Whiskey\n 1 cup milk\n 1/2 cup vegetable oil\n 1 tsp vanilla extract\n Chocolate Filling\n1 cup semi-sweet chocolate chips\n 1 tbsp sugar\n 1/2 cup heavy cream\n Whiskey to taste\n Chocolate Whipped Cream Topping\n1 cups heavy whipping cream\n 1/2 cup powdered sugar\n 1/4 cup cocoa\n 1 tsp vanilla extract\n 1 1/2 cup mini chocolate chips\n Directions:\nPreheat oven to 350 degrees. Grease and flour a 9 inch cake pan.\n\nCombine the dry cake ingredients in a large bowl.\n\nAdd eggs, milk, oil, vanilla, and beat on medium speed for 2 minutes. Add coffee\nand whiskey and mix to combine and pour into the cake pan. Bake for 35-40\nminutes until a toothpick inserted into the center comes out clean.\n\nPoke holes all over the top of the cake with a wooden spoon.\n\nChocolate Filling: Melt the chocolate chips in the microwave.","feature_image":"https://pramods.box.com/shared/static/iedn3bzrza6m8jp0ni4cicl01ko1h27s.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c380","uuid":"b112724c-4311-432f-81e6-540c215fce32","title":"Ba-na-na Ba-na-nana Po-ta-tooo Po-ta-to-naaaa","slug":"ba-na-na-ba-na-nana-po-ta-tooo-po-ta-to-naaaa","published_at":"05 May, 2016","plaintext":"K this second post for the week took a bit longer than expected but I finally\nperfected the pictures so we're good now. YAY Post #2 for the week! And that\ntoo, to celebrate one of the nerdiest holidays out there! STAR WARS DAY!\n\n\n\nAll the wonderful puns.\n\nAlso because this recipe is banana filled, I HAD the little song by the Minions\nfrom Despicable Me stuck in my head. So I figured I should share that\nadorableness and mental torture with you guys.\n\nAnyways... after being home sick for an entire week in what I consider my\npersonal version of solitary confinement, I hit a new level of insanity. I was\ndeprived of social interaction to such a point that I legit LOL'd at a Buzzfeed\narticle of ridiculous snapchats for a good 20 minutes. And by LOL'd I mean\ncurled over laughing so hard I could barely breathe. No Buzzfeed article is THAT\nfunny. I had such bad sinus pain that working on my computer for long periods of\ntime was pretty rough. So I decided rather than wallowing in my bed, I was going\nto make SOME productive use of my time... baking for you guys!\n\nI found this recipe on Pinterest a while back of Cream Cheese Filled Chocolate\nChip Banana Coffee Cake\n[http://www.carlsbadcravings.com/cream-cheese-stuffed-chocolate-chip-banana-coffee-cake-recipe/]\n. I do want to preface my recipe with this:\n\n 1. I didn't some of the ingredients so this is my altered version for lazy\n    bakers :)\n 2. I also don't have a bundt cake pan, so mine didn't come out as gorgeous\n    looking as this but there is one thing I CAN guarantee, which is that they\n    came out DELICIOUS. Probably one of my favorite desserts I've ever made,\n    next to Tiramisu and my mom's Mush Cake.\n 3. I didn't have brown sugar and didn't want to bother making a second grocery\n    store trip for that so I just didn't bother making the streusel topping that\n    was in the original recipe. I can only imagine how much more mind blowing it\n    would have been had I added the streusel, maybe you can make yours with it\n    and let me know!\n\n\n\nOver the last few weeks I've been trying to figure out where in my new apartment\nI can do my food photography to optimize the natural light coming from my\nwindows. In my old apartment it was extremely easy, I had giant sliding doors\nwhich brought in ALL the light and shown over pretty much my entire living room;\nand if that wasn't enough then I could go out onto my balcony and take the\nphotos there! It was perfect. This week I discovered that if I angle one of my\nside tables properly and place the dish inside it, the light reflects off the\nwalls of the table perfectly onto the the food and really brings out all the\ndetails in the food! I HAD FINALLY FIGURED IT OUT! Although this weird\npositioning did lead to some old people back pain for me because of the weird\npositions that I laid in on the floor to get these photos. Such is the pain for\nbeauty.\n\n\n\nI mean just look at it...\n\nThis is one recipe I would HIGHLY recommend you try, whether it be my\ninterpretation or the original recipe itself. It was delicious and my coworkers\nand friends LOVED it.\n\n\n\nChocolate Chip Banana Cheesecake Coffee Cake \nIf you don't have over-ripe bananas, then Carlsbad Cravings gave a great\nsuggestion of sticking them in the oven at 325 F degrees until they're dark on\nthe outside and soft to the touch.\n\nIngredients:\nBanana Coffee Cake\n2 1/4 cups all purpose flour\n 1 1/4 tsp baking powder\n 1 1/4 tsp baking soda\n 1 tsp salt\n 2 tsp cinnamon\n 1/2 cup butter, softened\n 1 1/2 cup sugar\n 2 large eggs\n 4 large bananas, over-ripe and mashed\n 1 tbsp vanilla extract\n 1 1/4 cups non-fat plain yogurt (or greek yogurt)\n 3/4 cup chocolate chips\n Cheesecake filling\n16 oz cream cheese, softened\n 1/2 cup reserved batter (from banana coffee cake above)\n 1/2 cup sugar\n 2 tsp vanilla extract\n Directions:\nPreheat oven to 350 degrees F and spray your pan with nonstick cooking spray and\nflour the inside of your pan.\n\nIn a medium bowl, whisk together flour, baking powder, baking soda, salt, and\ncinnamon. Set aside.\n\nUsing a hand mixer, beat the butter and sugar together until fluffy. Add the\neggs in one at a time and beat until blended. Mix in the vanilla and bananas\nuntil just combined.\n\nGradually add the dry ingredients to the wet ingredients, alternating with the\nyogurt. Beat until just combined. Measure out 1/2 cup of batter and keep aside\nfor the cheesecake filling. Stir in the chocolate chips into the remaining\nbatter and keep aside. Measure out about 1 cup of the batter with chocolate\nchips and keep aside to layer on top of the cheesecake filling. Pour the\nremaining batter into your pan.\n\nIn a separate bowl, mix together the 1/2 cup batter you set aside earlier with\nthe rest of the cheesecake filling ingredients on high speed until smooth and\ncreamy.\n\nSpread the cheesecake filling on top of the current layer batter in the pan.\nIt's okay if it sinks in a bit, this cake is much more moist than the original\nrecipe so the cheesecake layer is more variable in size. Pour the top layer of\nbatter on top of the cheesecake filling. If you made a streusel, now is the time\nto sprinkle it on top.\n\nBake for 55-60 minutes at 350 degrees F or until toothpick inserted comes out\nclean (ignoring the melted chocolate chips and any possible cream cheese that\nstill may not be solid). Let it cool and enjoy!\n\n\n\n\n\n![] (https://pramods.box.com/shared/static/opdcb8ciiq9ib1qbz8nfbz84gtjvanxz.jpg)","feature_image":"https://pramods.box.com/shared/static/l2l9lmho8q088kczuewl9ll8ec4uz2b8.jpg","tags":[{"id":"5c47a6f22037ef002282c291","name":"banana","slug":"banana"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c32b","name":"chocolate chips","slug":"chocolate-chips"},{"id":"5c47a6f22037ef002282c32c","name":"experiments","slug":"experiments"},{"id":"5c47a6f22037ef002282c32d","name":"minions","slug":"minions"},{"id":"5c47a6f22037ef002282c32e","name":"star wars","slug":"star-wars"},{"id":"5c47a6f22037ef002282c32f","name":"sick days","slug":"sick-days"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c361","uuid":"90fcc5c1-73f9-4b23-a38e-697f92bdfb7e","title":"This Shit is Bananas, B-A-N-A-N-A-S","slug":"this-shit-is-bananas-b-a-n-a-n-a-s","published_at":"18 February, 2016","plaintext":"I konw this post can't come close to as sweet as the one Anagha wrote this week.\nBut I pinky promise, in addition to making up for last weeks missing post, I\nwill also make up for Valentine's day. I know, I know... lots of promises but\nyou don't mess with pinky promises!\n\nYou knew this song was coming... don't lie. Just relish in the throwback and\nketchup on some food blog reading ;)\n\nSince this past weekend was the SUPERBOWL I had this whole great plan on how I\nwas going to post about what I made to eat then. But of course my inner Dory\ncame out and I forgot to upload all the tantalizing pictures I took. A specific\nfriend of mine, cough cough Breane, had requested the recipe so I TOTALLY\napologize for my brain fart and promise I'll post it next week! But until then,\nyou'll have to bear with me and enjoy this post instead :).\n\nSo personally, I think my mom is the QUEEN of making banana bread. Like,\nseriously. Her banana bread the most glorious thing since, well, sliced bread\n(badum chhhhhhhhh). It's the perfect combination soft and moist and not too\nsweet. Of course, my banana bread can never live up to that standard but, hey, I\ncan try!\n\n\n\nOne thing I've learned about all of my mom's recipes is that her measurements\naren't always... Exact. She always shows me measurements using the length of her\nfingers. Problem is we have different sized hands AND how do you quantify that\nmeasurement so that you can replicate it? I've tried SO many times to get\nteaspoon measurements for everything but can't say I've been entirely\nsuccessful. This is the sole reason I haven't been able to make my food taste\nlike my mom's food.\n\nAnyways, a girl can try right? Now back to her mind-BLASTING banana bread.\n\n\n\nMany of my friends are aware that I don't particularly have a sweet tooth. I\nmean sure I get cravings on occasion, however, banana bread has always been one\nof my favorite things, mainly because it's just the right level of sweetness. It\nhas a strong taste of vanilla and of course banana! What could be better?!\n\nOnce when I was having said cravings, I really really wanted to eat my mom's\nbanana bread. So I decided to do my own take on her recipe, I know already going\ndownhill, by adding zucchini and carrot. You know, hiding a little bit of\nhealthy things in there to make you feel better about eating desserts.\n\n\n\nIt actually came out pretty good, not quite mom level, but still pretty amazing.\nI may have eaten an embarrassingly large number of these muffins. Let me know\nwhat you think!!!\n\nZucchini Carrot Banana Bread Muffins\nIngredients:\n1/2 cup shortening\n 1 cup sugar\n 2 eggs\n 4 mashed bananas\n 1 tsp lemon juice\n 2 cups sifted flour\n 1/2 tsp salt\n 1 cup chopped nuts\n 1 zucchini, shredded\n 1 carrot, shredded strips\n Directions:\nCream shortening and sugar together. Beat eggs until light and add. Mix in\nbananas and add lemon juice. Blend with creamed mixture. Sift flour, baking\npowder and salt together and mix quickly into the banana mixture. Add the nuts,\nzucchini, and carrots and mix. Pour batter into cupcake pans and bake at 375\ndegrees about 30 minutes, or until a toothpick comes out clean when you poke it.","feature_image":"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c296","name":"bananas","slug":"bananas"},{"id":"5c47a6f22037ef002282c294","name":"zucchini","slug":"zucchini"},{"id":"5c47a6f22037ef002282c295","name":"carrot","slug":"carrot"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35c","uuid":"1ac41982-aa36-47c5-997a-8cbb575d8814","title":"Started From the Batter, Now We're Here.","slug":"started-from-the-batter-now-were-here","published_at":"28 January, 2016","plaintext":"I know. I know. The title and the song I'm telling you to listen while reading\nthis post don't match, but I felt I needed to up my Drake game a bit. Plus, now\nevery time I think of Drake, I picture him doing his little \"dance\"\n[https://youtu.be/uxpDa-c-4Mc]  over and over again. It brings me a LOT  of joy.\nI also love the SNL parody of it [https://www.youtube.com/watch?v=cjeORm4LMDk] \nbut that's not really relevant.\n\nFirst off, HAPPY NATIONAL CHOCOLATE CAKE DAY! I was not aware that this was an \nACTUAL  holiday but I'm not gonna complain. I firmly believe that everyday\nshould be National Chocolate Cake Day! But hey, I'll take one day a year.\n\nSecond, it's your lucky week! You get TWO whole posts from me! I've been sick\nsince Sunday, so I've been vegetating on my couch, watching a few too many chick\nflicks, all whilst drinking the world's supply of ginger chai (hence my\ncaffeine-fueled poem on Sunday which you should also totally read and\nappreciate) [http://cookinginpjs.com/an-ode-to-chai/].\n\nSo, let's get to it!\n\nAs the self-designated baker for my friend group, I've been baking birthday\ncakes for pretty much everyone. I've been trying to tailor each cake to\nsomething either they've specifically requested or what I think they would\nenjoy. This cake in particular was for one of my friends who loves whiskey. Her\nonly requirement was that, and I quote, \"I do not kill her.\" I took it as a\nchallenge in that I was going to put as much alcohol as possible in the cake\nwhile retaining its ability to taste good.\n\nThree things happened with this:\n\n 1. I made a deliciously boozy cake\n 2. I finished a LOT of the whiskey bottle I bought for this very specific\n    purpose.\n 3. I ended up getting fairly tipsy after a few batter taste tests\n\nI also feel like I should include a warning: raw batter means raw eggs which\nalso means the potential for salmonella. So be careful not to eat spoonfuls of\nyour cake batter! That could get you very sick. Enjoy responsibly ;)\n\nHonestly, I'd say it was a completely successful experience. I totally recommend\nmaking boozy desserts to everyone (of legal age of course). :P Just don't expect\nto be productive after you put the cake in the oven. I had absolutely no\nattention span once I set that cake to bake. I ended up making one GIANT cake\nfor my friend, another little one for the rest of us to enjoy on our own, and a\nfew cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the\ncupcakes were gone within 20 minutes of me sending an email announcing the\narrival of whiskey cupcakes. I'm now officially known as the dessert lady at\nwork.\n\n\n\nChocolate Whiskey Cake\nFeel free to increase/decrease the amount of whiskey according to your\ntaste/tolerance. Just make sure to adjust the flour accordingly so your cake\nbatter isn't too liquidy. The general rule is for each extra tablespoon of\nWhiskey that you add, add an extra 2 tablespoons of flour to compensate.\n\nIngredients:\n2 1/2 cups flour\n 3/4 cups dark cocoa powder\n 2 cups granulated sugar\n 2 tsp baking soda\n 1 tsp baking powder\n 1 tsp salt\n 2 large eggs\n 1/2 cup strong black coffee (chilled)\n 1 cup whiskey\n 1 cup buttermilk\n 1/2 cup vegetable oil\n Directions:\nIf your coffee isn't chilled, then make sure to put it in your freezer to speed\nup that process. Otherwise the eggs will cook when you add the coffee to it. Set\nyour oven to preheat at 350 degrees.\n\nWhisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the\ncoffee is chilled, whisk that in as well.\n\nIn a separate bowl, stir the flour, cocoa powder, baking soda, baking powder,\nand salt together. Slowly pour the wet ingredients into the bowl with all the\ndry ingredients. Make sure to keep stirring while you pour.\n\nWhisk until smooth. Taste to make sure the whiskey level is right. If not add\nmore whiskey/flour accordingly.\n\nSpray your cake pan (or place cupcake liners in your cupcake pan if you're\nmaking cupcakes) and pour in the batter. Set your timer for about 25-30 minutes\n(or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick\n(something that can reach fairly deep inside the cake). If it comes out clean,\nyou're done! Cool the cake in the pan for 15 minutes, frost and devour!\n\nI did get lazy when it came to the frosting and just bought some chocolate\nfrosting from the store. I felt it might be a little TOO much if I spiked that\ntoo, so I just spread shit tons of frosting on top of the cake/cupcakes and ate\nit. I'd say that was the better choice! If you're going easy on the whiskey\ninside the cake itself (or in the words of my friend, \"are being a little\nbitch\"), then maybe you can spike the frosting. Otherwise you've got enough\nalcohol in there to get the deed done.\n\nYes. You know you needed all these gifs right now. Don't lie to yourself. I'm\npretty sure I just stared at this gif collection for a good 5 minutes, at least.\nYou're welcome.","feature_image":"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c368","uuid":"f874d388-7289-41a8-bdc1-129c0d14f429","title":"Gettin' your morning BUZZ","slug":"gettin-your-morning-buzz","published_at":"17 July, 2015","plaintext":"\n\nTo be completely honest... this song isn't quite perfect for this post but it\nwas the first one that came to mind for this post. Enjoy :P\n\nAnd no, in case you were wondering... I didn't spike these coffee cupcakes with\ncocaine.\n\nSo, I'm not sure how many of you know this but coffee cake doesn't ACTUALLY \nhave any coffee in it... I KNOW! I was just as disappointed as you are right\nnow. Despite these cakes being a COMPLETE and utter lie, I love them down to the\nvery last crumb.\n\nDeceit aside, this recipe was actually quite easy to make and also involved me\nhaving to make extra crumble topping to replace the amount I ate. I'd recommend\ndoing the same for yourself :P hehe\n\n\n\nNOTE: My crumble topping came out kind of clumpy but I think that was mainly\nbecause I got lazy and didn't add the ingredients one by one as described in the\nrecipe. Instead, I decided to add everything at the same time and mix it. It\ndoesn't really change the taste that much but I imagine the cinnamon sugar taste\nis more uniformly present if you make it right.\n\nSince I didn't really make a custom version of this recipe check out the recipe \nhere [http://damndelicious.net/2014/03/24/coffee-cake-muffins/].\n\nTry the recipe out yourself and let me know what you think!!!","feature_image":"https://lh3.googleusercontent.com/Py-geJ6eWoOITUr4mZ-ZH8QUboRguSauLNU_iOrtXuND=w1440-h960-no","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c282","name":"crumble","slug":"crumble"},{"id":"5c47a6f22037ef002282c29b","name":"cinnamon","slug":"cinnamon"}]}}]}},"pageContext":{"slug":"cake","limit":6,"skip":0,"numPages":1,"currentPage":1}}