{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35f","uuid":"e0f988c3-12d8-419a-b327-025e484d0fd2","title":"When a moon hits your eye like a big pizza pi(e)","url":"https://cookinginpjs.herokuapp.com/when-a-moon-hits-your-eye-like-a-big-pizza-pi/","published_at":"07 April, 2016","html":"<p>March 14th is a very famous day. Tis a day of celebration. Tis a day of learning. Tis a day that we call &quot;Pi Day.&quot; Tis also a day mostly famous amongst engineers, mathematicians, and physicists more than anyone else, but hey we're the awesome ones anyways ;)</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:7ha6LU5Dle7FGBh0I9LZIa\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>We had a pi(e) baking competition at work. Here's a look at some of the amazing creations that were submitted!</p>\n<p><img src=\"https://pramods.box.com/shared/static/nn8d2nka6ctmukq1xfdqmowwwailu5jq.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/rudqvq9eugx628537swax136zz26itbq.jpg\" alt=\"\"></p>\n<p>One of the best things about this competition was that began at exactly 1:59pm. It took me a LONG time until I realized that it was intended to begin at 3/14 1:59, which are the next few digits in pi.</p>\n<p>Once I got over how clutch that was, I began planning what I would bake to enter in this competition. There were tons of categories including best newbie, most creative, best savory, best sweet, etc. I decided I would do something different and make a savory pie, but what to make... THEN I realized I could make Indian savory pies (cover my dinner for a few days) and attempt to blow everyone's minds. I decided to enter 2 pies: a paneer tikka pie and a samosa pie. Yes, I am very well aware that a samosa pie is really just a LARGE samosa, it's just semantics. I have also realized I have watched too much Psych when I use the phrase &quot;it's just semantics&quot; excessively.</p>\n<p><img src=\"http://gif.co/rqOE.gif\" alt=\"\"></p>\n<p>Since I decided to experiment so much you guys get TWO recipes this week all wrapped up inside one post. I know we're terrible people who haven't posted in a bit, but I promise we'll make it up to you guys and more. Since I used frozen pie crust, the overall time I spent baking was actually not as long as I had anticipated. I'm not going to write out the whole pie recipe because its fairly generic and you can follow the timings/instructions on the pie crust box itself. I made double crusted pies (where theres crust below and on top of the filling) so I just followed the instructions on the top pie crust box. It was something like this <a href=\"http://www.pillsbury.com/products/pie-crust/refrigerated-pie-crust\">crust</a>, the kind you roll out and lay on top of the pie.</p>\n<p><img src=\"https://pramods.box.com/shared/static/exwct8krjwx28uvx3j7ksk7g91ey4yp5.jpg\" alt=\"\"></p>\n<p>There's actually some chicken tikka mini pies in that picture above but that was mainly for myself ;)</p>\n<p><img src=\"https://pramods.box.com/shared/static/to0z9d01k9mh9k6oawuos5lkkm3ftzrw.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Paneer Tikka Pi(e) Filling</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">Uncooked paneer, cubed</li>\n          <li class=\"ingredient\">4 tbsp tandoori masala powder (I really like Kissan Tandoori Masala)</li>\n          <li class=\"ingredient\">Dahi (curds)</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Mix the tandoori masala and 2-3 large spoons of dahi  together in a large bowl. Add the paneer and mix until the paneer pieces are fully covered in the marinade. Add more dahi and tandoori masala as needed. Let the paneer marinate for at least 2 hours.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/sfr8vtuwek90jbhoh95j3y8qnzul13hr.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Samosa Pi(e) Filling</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">3 medium sized potatoes</li>\n          <li class=\"ingredient\">1 cup green peas</li>\n          <li class=\"ingredient\">1 tsp ginger-garlic paste</li>\n          <li class=\"ingredient\">1 tsp garam masala powder</li>\n          <li class=\"ingredient\">1 tsp red chili powder</li>\n          <li class=\"ingredient\">1 tsp dry mango powder</li>\n          <li class=\"ingredient\">1 tsp coriander powder</li>\n          <li class=\"ingredient\">3/4 tsp cumin seeds</li>\n          <li class=\"ingredient\">2 tbsp chopped coriander</li>\n          <li class=\"ingredient\">1 tsp garam masala powder</li>\n          <li class=\"ingredient\">lemon juice (to taste)</li>\n          <li class=\"ingredient\">salt (to taste)</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Fill a pot 3/4 full with water and add the potatoes and a pinch of salt. Boil on medium-high heat until potatoes are cooked completely. Put the potatoes in a bowl of cold water to cool for a minute. Peel and chop the potatoes into cubes.</p>\n        <p>Heat a little oil in a pan. Add cumin and roast. When the cumin starts crackling, add the ginger-garlic paste and sauté until the smell of raw ginger goes away. Lower the heat and add all the dry spices and stir.</p>\n        <p>Add the potatoes and peas along with salt (to taste). Sauté for a few minutes and then mix in chopped coriander and lemon juice (to taste).</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/fglwwdpe205hfhwg8nd8zh9m4l3js191.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/vecllf8pl3l3j3p8wexj2hds0rjvixd4.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/zi4ft39h26bq7e732v0da587bmz9jsz4.jpg\" alt=\"\"></p>\n<p>I know this is terrible... but I HAD to. :D</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/nmXkDbGdD4Q?wmode=transparent\"></iframe>\n</div>","feature_image":"https://pramods.box.com/shared/static/exwct8krjwx28uvx3j7ksk7g91ey4yp5.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c309","name":"piday","slug":"piday"},{"id":"5c47a6f22037ef002282c30a","name":"samosa","slug":"samosa"},{"id":"5c47a6f22037ef002282c30b","name":"paneer","slug":"paneer"},{"id":"5c47a6f22037ef002282c30c","name":"tikka","slug":"tikka"},{"id":"5c47a6f22037ef002282c30d","name":"competition","slug":"competition"},{"id":"5c47a6f22037ef002282c312","name":"pie","slug":"pie"},{"id":"5c47a6f22037ef002282c313","name":"savory","slug":"savory"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c372","uuid":"329792b8-9854-417e-a287-153b2af1d843","title":"Bhaaji Re Bhaaji Re Bhaaji RE!","url":"https://cookinginpjs.herokuapp.com/bhaaji-re-bhaaji-re-bhaaji-re/","published_at":"03 March, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/g4ab45jrsci3hv02dt7a9s8744otld65.jpg\" alt=\"\"></p>\n<p>So just to make up for my epic fail(s) these past weeks, I'm giving you 2 songs to listen to during this post!! (And to console an angry friend of mine :) I love you!)</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/6VBAGMkTjTs?wmode=transparent\"></iframe>\n</div>\n<p>Last month was the Super Bowl. Probably one of the MOST hyped up events in the United States. Usually, I'm not affected by much of this hype. There have even been years where I've forgotten to watch the Super Bowl altogether. I know. HOW COULD I? How very un-American of me. But nonetheless, if my team wasn't playing I was generally not too interested.</p>\n<p>This year was different. I've been in a Super Bowl city before; Detroit hosting in 2006. I probably lived about the same distance from all the events then than I did this time around, but this time was different. Super Bowl 50 was hosted by the city of San Francisco this year. Hilariously enough, the ACTUAL stadium that the teams were going to play at was a good 50 miles away from San Francisco. So TECHNICALLY the Super Bowl was hosted by the city of Santa Clara, but how many people actually know where that is?</p>\n<p>Exactly.</p>\n<p>So all the official hubbub leading up to the Super Bowl was held in downtown San Francisco. They set up this huge thing called &quot;Super Bowl City&quot; with various events starting a little more than a week before the actual big game. They had EVERYTHING; the puppy bowl, player signings, concerts (including the amazing Alicia Keys). San Francisco really pulled out all the stops for the event.</p>\n<p>I live in Sunnyvale right now. It's a little suburb town about 45 miles from downtown San Francisco. Usually, no issue. It's a quiet little area with lots of families and anything and everything Indian you could ever want. I'm really not kidding about that. There's a Indian grocery or jewelry or clothing or something store in each and every strip mall complex (I think that's what they're called anyways...) I legitimately give people directions to my house by telling them to go to Madras Cafe (one of the most popular dosa places in all of the Bay Area) and then turn onto my street instead of going into that restaurant. Ultimately it means that I'm dragged to that restaurant more than I'd ever like, me being someone who dislikes dosa (go on...hate on me all you want I am that South Indian that doesn't like dosa).</p>\n<p>Anyways... why is this important you may ask? Sunnyvale just HAPPENS to be approximately a 10 minute drive from the new and shiny Levi's Stadium in Santa Clara. The very stadium that happened to be hosting the Super Bowl last weekend. I know, lucky me! I get to go see all these tailgates and do all these cool football related things. Don't get me wrong... I LOVE football but it made me very bitter all weekend. In case you forgot, all the cool and fun events that were happening for the Super Bowl were happening in downtown San Francisco. So no cool pre-Super Bowl events for me. You'd think that AT LEAST I'd get to do some fun things the day of.... NOPE you thought wrong. Apparently you either needed to have specific connections/be a season ticket holder OR you needed to cough up some serious money to participate in all of these tailgating events. Levi's Stadium also has a strict no-tailgating policy for their parking lots, so I didn't get to attend anything. Clearly I'm not bitter at all about this.</p>\n<p>Anyway, my Super Bowl plans consisted of making an large amount of Pav Bhaaji and watching the game with my friend whilst we stuffed our faces. I was going to add a little bit of a rant about the Coldplay halftime show but that's for another time. I may not be a complete fan of Coldplay's Hymn for the Weekend music video but I do love the song...so I was very disappointed that they cut it from the Super Bowl halftime performance.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:3RiPr603aXAoi4GHyXx0uy\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Regardless, we had pav bhaaji to console us over Chris Martin being the left shark of this year's Super Bowl. Pav Bhaji is a wonderful, buttery delicacy from the streets of Mumbai. I'm thoroughly convinced that pav bhaaji tastes better when you get it from grungier and shadier places, aka a variety of street vendors. What street food doesn't taste better, when it's made and served to you from a giant stove in the middle of some market?!</p>\n<p><img src=\"https://i.ytimg.com/vi/_LFy3UYws2Y/hqdefault.jpg\" alt=\"\"></p>\n<p>I did have a slight mishap in making the pav bhaaji. I was so concentrated on combining a few different recipes into one that I absent-mindedly added bisibelebaath masala instead of pav bhaaji masala. While I do love me some bisibelebaath... the masala doesn't quite give you the taste you're looking for in pav bhaaji. So there I was, watching my disaster simmer and cook on my stove while the clock ticked down to the start of the game. Then I realized that I may have some the ingredients in my spice rack to make my own make-shift pav bhaaji masala. Pav bhaaji masala is made by grinding cardamom, coriander seeds, cumin, fennel seeds, dry chilies, cinnamon sticks, cloves, and dry mango powder. I somehow had most of these things, so I proceeded to add varied amounts of dry mango powder, cumin powder, ground cardamoms, and coriander seeds until it tasted close to pav bhaaji I like.</p>\n<p>Not in any way perfect, but not bad either! My friend being the sweetheart that he is claimed that he loved it! I feel like he was just being a nice friend so I highly recommend getting the pav bhaaji masala and using that instead of making your own with w/e you have in your kitchen. It'll just taste better and closer to what you would have wanted to begin with.</p>\n<p><img src=\"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Pav Bhaaji</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">Ghee</li>\n          <li class=\"ingredient\">1 bell pepper, chopped</li>\n          <li class=\"ingredient\">1 cup water</li>\n          <li class=\"ingredient\">4 roma tomatoes, chopped</li>\n          <li class=\"ingredient\">4 medium potatoes, chopped</li>\n          <li class=\"ingredient\">1 cup cauliflower florets</li>\n          <li class=\"ingredient\">1 1/2 tsp ginger-garlic paste</li>\n          <li class=\"ingredient\">1 onion, chopped</li>\n          <li class=\"ingredient\">2 tbsp pav bhaaji masala</li>\n          <li class=\"ingredient\">1 1/2 tbsp red chili powder</li>\n          <li class=\"ingredient\">1 tsp garam masala powder</li>\n          <li class=\"ingredient\">1 tsp turmeric</li>\n          <li class=\"ingredient\">1 tbsp kasuri methi (dried fenugreek) powder</li>\n          <li class=\"ingredient\">lime wedges for garnish</li>\n          <li class=\"ingredient\">some chopped onion for garnish</li>\n          <li class=\"ingredient\">salt according to taste</li>\n          <li class=\"ingredient\">pav buns (plain slider buns can also work)</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>In your pressure cooker, cook the potatoes and cauliflower until soft and tender.</p>\n        <p>Add butter (or ghee :D) to a large pan. Once it's heated, add the chopped bell pepper to it. Once that has softened, add a little water and mash.</p>\n        <p>Stir in the tomatoes and boiled vegetables and cook for 2-3 minutes. Add ginger-garlic paste and sauté for 2 minutes. Once the tomatoes have cooked, mash everything with a masher (or anything close to that).</p>\n        <p>In a separate pan, sauté chopped onion in ghee until it becomes a pale brown color. Add all the spices and salt and sauté for a few more minutes. Add some more water if it starts getting dry.</p>\n        <p>Add the onion mixture to the bhaaji and mix. Add water until it reaches the desirable consistency. Similarly with the spices and lime juice. Toast some pav buns and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/g4ab45jrsci3hv02dt7a9s8744otld65.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/b903fi6yix0qdhtqymxc78bgoku8w9wb.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"},{"id":"5c47a6f22037ef002282c2e9","name":"super bowl","slug":"super-bowl"},{"id":"5c47a6f22037ef002282c2ea","name":"salman khan","slug":"salman-khan"},{"id":"5c47a6f22037ef002282c2eb","name":"bollywood","slug":"bollywood"},{"id":"5c47a6f22037ef002282c2ec","name":"pav bhaaji","slug":"pav-bhaaji"},{"id":"5c47a6f22037ef002282c2ed","name":"cravings","slug":"cravings"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c375","uuid":"1afdf9c1-368f-4d78-acab-73f49594829c","title":"Tere Ghar Ke Samne, Khana Banaunga","url":"https://cookinginpjs.herokuapp.com/tere-ghar-ke-samne-khana-banaunga/","published_at":"04 February, 2016","html":"<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/dg39NzgJZg4?wmode=transparent\"></iframe>\n</div>\n<p>Why this song you may ask? While growing up my mom always used to sing this song to me. The song literally translates to &quot;I'm going to build a house in front of your house.&quot; It's supposed to be this cute love song where the guy wants to &quot;build his world in front of her house.&quot; My question is, wouldn't it be more romantic if he built a house FOR them WITH her? Why does he only want to be in front of her house? I may be missing some context from the rest of the movie but regardless that's a whole different tangent.</p>\n<p>This song was pretty much just my mom telling me she wants to live right across the street from my and constantly spoil her future grandchildren. I'm pretty sure my mom wanted a full on re-enactment of &quot;Everybody loves Raymond.&quot; But hey, who's gonna complain about a free babysitter and delicious food? :P</p>\n<center>**Love you Amma! <3**< center=\"\">\n<p><img src=\"https://pramods.box.com/shared/static/qvuujqsw2q4cswg2630ahefurw3iyfnt.jpg\" alt=\"\"></p>\n<p>(While you're at it, you should also <a href=\"http://uppukhara.com\">check out her blog here</a>! It's basically every recipe she made for me growing up that I have random cravings for since I've moved out to California.)</p>\n<p>Sometimes I feel like I'm not a complete adult yet. Even though I'm currently supporting myself, paying my own bills, taxes, and insurance, I don't always feel like a &quot;real&quot; adult. Then, there are times when suddenly I feel like a full on housewife, which is something I NEVER EVER want to be.</p>\n<p>One such instance was this past weekend, when I was anxiously awaiting the arrival of my new electric pressure cooker. One thing I'm <em>sure</em> every child growing up in an Indian household can relate to, is the sound of a pressure cooker. That sound TERRIFIED me to my core throughout my childhood, and to this day. I always feel like something somewhere is going to explode. Even in college when my roommate decided to make dal and turned on the pressure cooker, we used to hide behind our bedroom doors waiting for it to go off enough times so could turn it off and continue hiding. You'd think that it wouldn't be worth the fear, but honestly have you ever had dal or even better, Bangalore-style saaru? Yea, it's worth it. (If you're wondering what that is, it's a less liquidy and better version of rasam with more dal in it). I've tried all sorts of cooking techniques, but saaru just doesn't taste quite the same unless you use a pressure cooker. And this way, you don't end up wasting hours and hours making your meal. THAT is not worth it.</p>\n<p>The sound of our pressure cooker is even worse for our dog because he can hear the noise WAY before we can. He panics and runs all the way up the stairs and cowers near my parent's bedroom door. This happens without fail every time my mom STARTS the pressure cooker. He knows it's coming and refuses to come down from his hiding spot until he's completely sure it's not going to go off again. Poor baby. But I'm sure you'll all realize why once you get your own pressure cookers!</p>\n<p><img src=\"https://pramods.box.com/shared/static/btjgsul6c32hvenzfsw74q4e2xc34mi3.jpg\" alt=\"\"></p>\n<p>But AHA! What is this?! An ELECTRIC pressure cooker? What is this magical device? So quiet and effective? Truly this can't be real! But miraculously, IT IS!</p>\n<p><img src=\"http://ecx.images-amazon.com/images/I/51jpKXz6EuL._AC_UL320_SR308,320_.jpg\" alt=\"\"></p>\n<p>I've never been so excited for any adult purchase in my life, except <em>maybe</em> my car. This was a glorious purchase. NOT ONLY can it make dal in 4 minutes, but I can use it to make dahi (yogurt or curds generally eaten with indian food), rice, and basically anything else in life I could ever think of! ALL WITHOUT MAKING A SOUND! I didn't even realize it had even started and it made a beeping noise indicating that my food was READY! It's wonderful.</p>\n<p>Amidst all this excitement over the pressure cooker, I got kind of homesick for my mom's food. I then proceeded to facetime my mom for an hour while she carefully explained step by step instructions on how to make one of my favorite childhood dishes, Bendekai Huli or for you non-Kannada speaking people out there, Okra Sambar. Most kids hate okra, but honestly it's one of my favorite vegetables, especially when it's in Indian food.</p>\n<p>I know this might not be the most flattering picture of any of us (mainly my brother) but whatever.</p>\n<p>One thing I will mention is that I am not sure where to get the huli pudi (sambar powder). My parents usually bring bags back from this little store in Bangalore every time anyone visits, but I'm sure you can find something similar in local Indian stores. I mean, I know I couldn't live without sambar so I'm sure there are other people who feel the same way and have found a way! There are also instant mixes available at the Indian store - while these aren't quite as good, they can satisfy the occasional craving!</p>\n<p>Now that you've learned a little bit of Kannada, and hopefully are as excited as I was, let's begin!</p>\n<p><img src=\"https://pramods.box.com/shared/static/gqm35vb6v2zox6pbikr2rrwd7fwe0y6u.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Okra Sambar or Bendekai Huli</h2>\n    <div class=\"summary\">\n      <p><em>I'm giving these instructions based on my electric pressure cooker. You may have to adjust the dal portion of the recipe according to however you make it. Pressure cookers scare the bejesus out of me so be careful!</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <h4>Dal</h4>\n          <li class=\"ingredient\">1 cup toor dal</li>\n          <li class=\"ingredient\">1/2-3/4 tsp turmeric powder</li>\n          <li class=\"ingredient\">2 1/2 cup water</li>\n          <h4>Sambar</h4>\n          <li class=\"ingredient\">oil</li>\n          <li class=\"ingredient\">1/2-3/4 tsp mustard seeds</li>\n          <li class=\"ingredient\">1 small package frozen okra</li>\n          <li class=\"ingredient\">1/2-3/4 tsp tamarind paste</li>\n          <li class=\"ingredient\">1 1/2 spoons huli powder (sambar powder)</li>\n          <li class=\"ingredient\">water</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Add the toor dal to your pressure cooker and rinse. Add the water and turmeric and turn on the pressure cooker. I did the Manual setting for 4 minutes. Also make sure its set to low pressure and all the pieces are in place. When the pressure cooker was done it went into keep warm (displayed \"L00:00\") and started counting up. I unplugged it and let it release the pressure on its own.</p>\n        <p>In a pot, add some oil and mustard seeds on medium heat, this is called vagarne. When the mustard seeds start popping, add the frozen okra. When the okra starts to get kinda sticky and stringy, add the tamarind paste and a little bit of water. Keep cooking and mixing the okra occasionally until it is cooked through.</p>\n![](https://pramods.box.com/shared/static/uq45bcrldnses3q369jmzcs1v1srqmqv.jpg)\n        <p>Add huli powder and salt to taste and let it come to a boil. Add the dal and more water until it's the right consistency. Taste it as you go. I needed to add a little more tamarind paste and huli powder to fit my taste but that depends person to person.</p>\n        <p>Let it cook for a few minutes and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/wlq7z13f7uqkm9b2jpei4zk2ruai6hp2.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/4y2jxv3s81ef223fs8ejkb5fp2bhxwf7.jpg\" alt=\"\"></p>\n</3**<></center>","feature_image":"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c297","name":"mom","slug":"mom"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2d1","name":"pressure cooker","slug":"pressure-cooker"},{"id":"5c47a6f22037ef002282c2d2","name":"crock pot","slug":"crock-pot"},{"id":"5c47a6f22037ef002282c2d3","name":"okra","slug":"okra"},{"id":"5c47a6f22037ef002282c2d4","name":"sambar","slug":"sambar"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c369","uuid":"7be4e4ee-6239-411d-952a-c769fc32ade5","title":"It's DOSA TIME.","url":"https://cookinginpjs.herokuapp.com/ada-dosa/","published_at":"11 January, 2016","html":"<p>I have not always been a fan of dosa. In fact, for years  I would only eat it if it was accompanied by tanks of chutney (why yes, I would like some dosa with that). But then I tried ada (a-day) dosa, and my life changed.</p>\n<p><img src=\"https://pramods.box.com/shared/static/0j9f1d0d2h32k4m8xb7lvrjwkgy70xna.jpg\" alt=\"alt\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/1jdp190c55wmmzwkmv74olff2o32roj0.jpg\" alt=\"alt\"></p>\n<p>Dosa is a south asian savory crepe - type bread. It's made of rice which is soaked, ground, and allowed to ferment. Ada dosa is the simpler, and to me, much tastier cousin - made entirely of rice, lentils, and legumes, it is both extraordinarily healthy and delicious.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z076rz6071j19sd1oyknxa21aqd4os6c.jpg\" alt=\"alt\"></p>\n<p>This is the food I beg my mom to make every time I visit home, and is one of the first things I learned to make when I set out on my quest to learn to cook Indian food.</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Ada Dosa</h2>\n    <div class=\"summary\">\n      <p><em>The recipe I'm sharing today is one that I know works, but you can substitute all the lentils and legumes with pretty much any other lentil or legume. You just have to make sure that you soak the hardier legumes (black eyes peas, kidney beans, black beans, etc.) overnight, and the lentils and rice for three or four hours. It's also important to have a good rice to lentil ratio. You want to make sure that approximately one third of the total quantity is rice, so if you have two cups combined of lentils and legumes, you would want one cup of rice in there.\n      These dosas can be eaten with yogurt, any chutney or pickle you like, or, if you're so inclined, plain. They would also be wonderful with sauteed vegetables. </em></p>\n      <p>Yield: Approximately 10 10-inch dosas, 3 - 4 servings</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour active, 12 hours passive</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <li class=\"ingredient\">1/2 cup black beans</li>\n      <li class=\"ingredient\">1/2 cup chana dal</li>\n      <li class=\"ingredient\">1/2 cup toor dal</li>\n      <li class=\"ingredient\">1/2 cup split peas</li>\n      <li class=\"ingredient\">1 cup brown rice</li>\n      <li class=\"ingredient\">1 1/2 tbls fresh ginger</li>\n      <li class=\"ingredient\">1/2 tbls whole black pepper</li>\n      <li class=\"ingredient\">1/2 tbls cumin</li>\n      <li class=\"ingredient\">1/2 cup coconut (dry and fresh both fine)</li>\n      <li class=\"ingredient\">1/2 bunch cilantro</li>\n      <li class=\"ingredient\">fresh green chili, to taste</li>\n      <li class=\"ingredient\">salt, to taste</li>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n1.) Soak the black beans the night before, and start soaking the lentils about six hours before you want to eat them. \n</p><p>\n2.) Combine all ingredients including spices in the food processor with the water you soaked them in, and let it run. The resulting mixture shouldn't be too runny or too thick, and will be a little grainy, but not chunky. While it won't be as smooth as pancake batter, the lentils should be broken down quite well. \n</p><p>\n3.) Once your batter is ready, turn on your stove and let a skillet heat with a small amount of oil. You want the skillet to be hot and the oil covering the surface - if you put your batter on the skillet too soon it will stick! Put a small amount of batter in the center of your skillet, and careful spread it out with a spiraling motion until it's the desired size. Pour a small amount of oil (1/4 teaspoon) on the surface of the dosa, and then cover the pan. \n</p><p>\n4.) Let it cook for three - four minutes, before removing the cover, and flipping the dosa so the other side can cook.\n</p><p>\n5.) Cooking time varies based on the stove and the pan you're using, so give yourself a bit of leeway here. If your first dosa falls apart (as mine did) scrape it off, rinse your skillet, and start fresh - with a bit of trial and error, these become super easy! Once both sides of your dosa are cooked, it's ready! Pull up a plate and dig in :)\n        </p>\n      </div>\n    </div>\n  </div>\n</div>","feature_image":"https://lh3.googleusercontent.com/KWBBMYdzG5jqFpPXoOT5tZ1XsclaWzt3q4QXau3omGevmZidRFmpBSyJzvwum8K3YWVTaBFm3A4sgYrTCSYsfqErYq2A1UvLd7xEfm7jSmFkzQUUmjkEVWf5aySOjbmoQApXNZcDaBjGOb19JaK_mmg2KemL_-8Ggno5E-Rzck0QJLwUvBIT_ocr1v_V7iMgvSFZWO5OuPz0fDLU4XpknoQc0F5mueX1giHpDA3HHrUSSys4zeK5hyDv6iyyLnoYi5FbHl7dpEkG4DRQRv0cZvMa3LL_j-sfWNdD6mCGBQvyZFN3txUUgf6TDvqlC--0GXgzZAXVLP-G6Fnu2KK5qXXXJUPjkQz8quqmgBlA317IANaRjhBJ8gSFvd-2WYHySPHE7SPadbtaA6tbxGPxrEFppYuar1bLl4Lw3LbG-ieBLG0Gb_b1QED316YX4aN9VErOpOgI-9IxxhPjWOUIovADqIdpB9U0haOTqsOWUTbUO-kSAN5Zjh05RIqfUhco5hrzNw_Y4B5bQqR-E0OQ6X0e2xOMV5Xo9PWVUA-JxlsQSCb1NNlymaRk_5oR5xKXofyX=w362-h643-no","tags":[{"id":"5c47a6f22037ef002282c2ac","name":"dosa","slug":"dosa"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"slug":"indian","limit":6,"skip":0,"numPages":1,"currentPage":1}}