{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Sweet Potato Pie","slug":"sweet-potato-pie","feature_image":"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg","published_at":"25 January, 2016","html":"<p>I made some sweet potato pie today.</p>\n<p><img src=\"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg\" alt=\"\"></p>\n<p>This was my second time making this dessert, and I made it in a more or less similar way.</p>\n<p>The first time I made it, I bragged to my housemate, and he asked me if my making a sweet potato pie was cultural appropriation, and I had no idea, because I had no idea sweet potato pie was a thing that black people did. To be honest, I thought it was an all-American thing (immigrant probs, amirite?) So I researched - and I found out that historically, sweet potato pie was a food slaves made in the south. And I had no idea until I made it and someone else called me out on it!</p>\n<p><img src=\"https://pramods.box.com/shared/static/iw7ilzj11mwwevcfd9rwv4255nyunmla.jpg\" alt=\"\"></p>\n<p>Here's the thing about cultural appropriation in food - it happens ALL THE TIME. People love to take foods from other cultures - frequently every day, commonplace foods - and remake them with slight tweaks and giant price tags. So how do you avoid it? I personally advocate for research.</p>\n<p>I think it's important to know where the food you're making comes from, especially when you're modifying it. I tend to modify a lot of recipes to make them vegetarian or vegan, but I try to do it in a way that feels as respectful to me as possible.</p>\n<p>I think there's space in food for innovation, but it has to be accompanied by respect for the important place that food has in culture.</p>\n<p>So, the moral of this story? Don't appropriate. Don't glorify the food of another culture without trying to understand that culture itself. Accept that you'll probably be clueless even with additional information, and do your best to be respectful.</p>\n<p>And also, have some pie.</p>\n<p><img src=\"https://pramods.box.com/shared/static/b9pw4yztlvyi87dno5qfnd1tryy08fyw.jpeg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Sweet Potato Pie</h2>\n    <div class=\"summary\">\n      <p><em>This is a filling dessert. You could tell yourself it's healthy because it has a vegetable as a filling, but let's be real - this is not a healthy dessert. And that's a good thing - sometimes dessert just needs to be decadent.</em></p>\n      <p>Yield: 1 Pie</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">2 hours active cooking time</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Pie Crust</h4>\n          <li class=\"ingredient\">3 C Flour</li>\n          <li class=\"ingredient\">1 Tsp Salt</li>\n<li class=\"ingredient\">3/4 C Coconut Oil</li>\n<li class=\"ingredient\">Ice water, as needed</li>\n        <h4>Sweet Potato Filling</h4>\n          <li class=\"ingredient\">Three Medium Sweet Potatoes</li>\n          <li class=\"ingredient\">1 C Coconut Milk Liquid or 1/2 C Almond Butter</li>\n<li class=\"ingredient\">Maple Syrup, to taste</li>\n<li class=\"ingredient\">1 1/2 Tsp Cinnamon</li>\n<li class=\"ingredient\">1/2 Tsp Cardamom</li>\n<li class=\"ingredient\">1/2 Tsp Pumpkin Pie Spice</li>\n<li class=\"ingredient\">1 Tsp Vanilla Extract</li>\n<li class=\"ingredient\">1 Tsp Orange Extract</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n<p>\n1.) The pie crust recipe is the same dough as that of my  [Love Triangles](http://cookinginpjs.com/love_triangles/) from last week. The first time I did it, I added a little bit too much ice water - perhaps a couple tablespoons too much - and I wound up with a loose dough I didn't want to add more flour to. So that time, I rolled it out hastily, trying not to handle it too much to avoid the coconut oil melting prior to baking. This time I managed to avoid that pitfall, and carefully added only as much water as was necessary, resulting in a soft, elastic, and close-to-perfect dough. I recommend prepping and chilling that before you do anything else.  \n</p><p>\n2.) I went the simple route; I chopped the sweet potato small, into pieces about a half inch wide. After you do that, douse them in spices and throw them in the oven until they are melt-in-your-mouth cooked. Or, you know, about thirty minutes.\n</p><p>\n3.) Mashed them, add maple syrup, the some almond butter, or the liquid from a can of coconut milk for creaminess, and your spices and extracts. You want to make sure it isn't too sweet, tasting every time you add a new ingredient to - ahem - \"assess quality.\" Make sure that the pie isn't so sweet that you can't taste the sweet potato. The goal is to enhance it so it can be the star, not mask it. \n</p><p>\n4.) Preheat the oven to 375 F. Take out your pie dough which has, of course, chilled for at least four hours at this point, and roll it out gently. Set it into a pie pan/tin, and crimp the edges however you're like. Reserve the cut off bits to create a decoration for your pie. Pop the crust in the oven for about fifteen minutes. \n</p><p>\n5.) After the pie crust has baked for about fifteen, take the pie out of the oven and layer in your filling. You want it to be up until the rim of the pie pan - this filling won't expand, so you can fill it right up. Put the pie back in the oven for about twenty minutes. \n</p><p>\n6.) In the meantime, roll out your spare dough and get creative! I went the way of stars and diamonds because those are the cookie cutters I found, but the world is your oyster. When twenty minutes have passed, take your pie out of the oven and carefully place the decorations on top. Put it back in for another 20 minutes. Proceed to turn on the oven light and watch excitedly, as I did (I think I mistook it for a television).\n</p><p>\n7.) After another twenty minutes have passed, increase the oven temperature to 400 F, and place your pies on the top rack - I like my top crust to be a little brown, and this makes that happen!\n</p><p>\n8.) Take your pie out of the oven and serve it up! I loved it with a dollop of coconut whipped cream, but it would likely also taste good with ice cream, or normal whipped cream, or any manner of things. It was also excellent all on its own. \n        </p>\n      </div>\n    </div>\n  </div>\n</div>\n","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c3","name":"sweetpotato","slug":"sweetpotato"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c2bc","name":"pastry","slug":"pastry"},{"id":"5c47a6f22037ef002282c2c4","name":"piecrust","slug":"piecrust"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},"pageContext":{"slug":"sweet-potato-pie","previous":{"html":"<p>This Christmas vacation, Anagha and I were reunited for the first time in almost a year. There are many phases of a best friend reunion, according to this <a href=\"http://www.buzzfeed.com/kelseydarragh/when-your-bff-comes-to-town#.nsbQEmYJq\">buzzfeed article</a>. Pretty much every single thing in that article happened, except in our friendship instead of drinking our weight in wine, we cook. And eat.</p>\n<p><strong>A LOT OF FOOD</strong></p>\n<p><img src=\"https://ak-hdl.buzzfed.com/static/2015-12/8/18/enhanced/webdr11/anigif_original-21914-1449616517-5.gif\" alt=\"\"></p>\n<p>I'm pretty sure Anagha spent 50% of her time at my place and the other 50% at her own parents' house. We didn't even do anything most of the time... I would be working and she would be reading at the opposite end of the table. She had also never met the newest addition to my family, Miggy Pramod, who is basically the most adorable dog known to man.</p>\n<p>True to form, they became best friends immediately.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ijnjkbtgaycn5ddhbx2dwakh9gcrq3ua.jpg\" alt=\"\"></p>\n<p>Seriously though, who couldn't love a weirdo that sleeps like this regularly?</p>\n<p><img src=\"https://pramods.box.com/shared/static/j1fczq8yhjzxhz0ae852f1lu4wqdp00s.jpg\" alt=\"\"></p>\n<p>Just look at him.</p>\n<p><img src=\"https://pramods.box.com/shared/static/8429t2jqhh8zkgv3fuc8vszlqh3y8dbj.jpg\" alt=\"\"></p>\n<p>This past August, my dad decided that my mom's birthday gift would be to finally get a puppy. My entire family, brimming with excitement, spent hours and hours looking on petfinder.com and various shelter sites for the perfect little CALM addition to our family. After countless shelter visits and close calls with various puppies, we were extremely tired and disheartened. The process of finding the perfect dog for our family had become a lot more emotionally draining than we had originally thought. My mom wasn't sure if she could get attached to another dog and see him/her join another family. Then one day, my parents went to this small little animal hospital in Sterling Heights, MI and instantly became smitten with, what we were told, was a little beagle mix. He was an adorable 18 pound ball of affection who just wanted to play. One week later, he was ready to come home.</p>\n<p><img src=\"https://pramods.box.com/shared/static/dcypl744jtl2r4ey4gb8xydob6hi09g6.jpg\" alt=\"\"></p>\n<p>He was a VERY little 5 month old puppy. Little did we know that the tiny little boy that we brought home was a little more German Shepherd than Beagle. Currently, Miggy is a happy 40 pounds and the obsession of my entire family, weird sleeping positions, ear licking fetishes and all.</p>\n<p>ANYWAYS putting the puppy love aside, whenever we weren't spoiling Miggles with never ending attention, we were watching Netflix and eating All The Brunch. If it hasn't become obvious from some of our <a href=\"http://cookinginpjs.com/brunch-conquers-all/\">previous posts</a>, We <strong>LOVE</strong> brunch. Best of all, it means that we can roll out of bed in our pajamas and enjoy some scrumptiousness that we could concoct using eggs and veggies. Yay Pajamas! YAY Brunch!</p>\n<p>Then, it's time for a relaxing, vacation time food coma. There's that one episode of friends where Joey and Ross discover that they are each other's best nap buddies. Exactly. Who <em>DOESN'T</em> want a nap buddy and best of all your best friend?! So we spent most of our afternoons watching Netflix and chilling (no not like that you perv!) but literally watching Netflix reruns and napping with my puppy.</p>\n<p><strong>Best. Break. Ever.</strong></p>\n<p><img src=\"https://45.media.tumblr.com/78bddaf03bdfb59b75a09a3c3db38b10/tumblr_ngbxx0rIAb1snhpyjo1_r1_500.gif\" alt=\"\"></p>\n<p>We also love Mexican food. No explanation needed. It's just the best. So OBVIOUSLY nothing could be better than combining the two things we are always craving. In came chilaquiles.</p>\n<p>I've had varieties of chilaquiles in the past. From the beaches of Cancun to the streets of San Francisco and San Diego. Everywhere, they put their own spin on the classic Mexican dish. Traditionally it's kept very simple with just fried tortillas, salsa, egg, and beans (and/or meat). California, on the other hand, tends to add avocado to everything so it's very colorful. Our variation probably includes WAY more vegetables than most but I love it and it tasted delicious.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/9r2pggwyj4j7fre2tlxu47nhkj2be8mh.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/3g098w0hj52qe8k9d45ddalcfxo4a2oh.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/eb3enu78qybtf2rl2qygx4gx64l9r7zn.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chilaquiles</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">1 bottle <a href=\"http://www.lavictoria.com/products/salsa/thickn-chunky-salsa-verde-medium/\">Salsa Verde</a></li>\n          <li class=\"ingredient\">1 bag tortilla chips</li>\n          <li class=\"ingredient\">1 can black beans</li>\n          <li class=\"ingredient\"><a href=\"http://cookinginpjs.com/estoy-cantando/\">Sumedha's Super Secret Fajita Seasoning</a></li>\n          <li class=\"ingredient\">1 avocado cubed</li>\n          <li class=\"ingredient\">1 egg per person</li>\n          <li class=\"ingredient\">sour cream</li>\n          <li class=\"ingredient\">cheese (shredded or Cotija)</li>\n          <li class=\"ingredient\">chopping cilantro to garnish</li>\n        <h4>Pico De Gallo Salsa</h4>\n          <li class=\"ingredient\">2 roma tomatoes</li>\n          <li class=\"ingredient\">1/2 onion diced</li>\n          <li class=\"ingredient\">1/4 cup chopped cilantro</li>\n          <li class=\"ingredient\">lemon juice to taste</li>\n          <li class=\"ingredient\">salt to taste</li>\n        <h4>Corn Salsa</h4>\n          <li class=\"ingredient\">1 can sweet corn kernels</li>\n          <li class=\"ingredient\">4 sliced jalapeños (more or less based on your spice tolerance)</li>\n          <li class=\"ingredient\">lemon juice to taste</li>\n          <li class=\"ingredient\">salt to taste</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Put two handfuls of tortilla chips in a pan and cover with the salsa verde. Let the chips soak on low-medium heat while completing the remaining steps. Make sure to stir occasionally so all of the chips are covered in salsa</p>\n        <img src=\"https://pramods.box.com/shared/static/h40kxa1n2f931rxbfyg2ckvllshtz13o.jpg\">\n        <p>Cook the beans with as much of Sumedha's Super Secret Fajita Seasoning as you like. For each salsa, combine the ingredients in a bowl and keep to the side.</p>\n        <p>When the beans are almost done, make one sunny side up egg for each person. You are more than welcome to scramble them if you don't like runny eggs.</p>\n        <p>Spread the soaked tortilla chips on each plate. Layer the beans, egg, salsas, avocado, cheese, sour cream and cilantro on top of the chips. Grab your fork and knife and let the egg yolk flow. ;)</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/t03aga3evw84924kvc9harwbozrs50a9.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/1fcrzhi9xfs643a73eziigxq1qmtnkah.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/sl6dcu7i0xy3w2cv0wxx6bduskqus5r7.jpg\" alt=\"\"></p>\n","title":"Netflix and Chilaquiles","slug":"netflix-and-chilaquiles","published_at":"20 January, 2016","feature_image":"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg","tags":[{"id":"5c47a6f22037ef002282c243","slug":"mexican"},{"id":"5c47a6f22037ef002282c29c","slug":"friends"},{"id":"5c47a6f22037ef002282c2b8","slug":"puppy"},{"id":"5c47a6f22037ef002282c2b9","slug":"chilaquiles"},{"id":"5c47a6f22037ef002282c23d","slug":"brunch"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ba","slug":"reunion"},{"id":"5c47a6f22037ef002282c23f","slug":"breakfast"},{"id":"5c47a6f22037ef002282c2bf","slug":"naps"},{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"}]},"next":{"html":"<p>There are some days where all you want to do is vegetate on your couch with your stuffed penguin, some Netflix and chai. Today is one of those days.</p>\n<p><img src=\"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg\" alt=\"\"></p>\n<center>For the days of exhaust.\nFor the days of woe.\nFor the days of rain\nAnd those few in a row.\n<p>The magical potion,<br>\nWhich may many amaze,<br>\nSimple preparation,<br>\nPowerful result.</p>\n<p>A hint of ginger,<br>\nA drop of milk,<br>\nA spoonful of sugar,<br>\nAnd sore throat no more.</p>\n<p>What magical mystical wonder is this?<br>\nOh? You didn't you hear?<br>\nJust some simple and plain and regular tea!</p>\n</center>\n<p><em>Side note: this may have been inspired by one too many cups of ginger chai. I may have a problem.</em></p>\n<p><img src=\"https://pramods.box.com/shared/static/2m0iqspxp5v9az5sbsd5f7vo6wdbaasd.jpg\" alt=\"\"></p>\n","title":"An Ode to Chai","slug":"an-ode-to-chai","published_at":"25 January, 2016","feature_image":"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg","tags":[{"id":"5c47a6f22037ef002282c2a2","slug":"chai"},{"id":"5c47a6f22037ef002282c2c0","slug":"drinks"},{"id":"5c47a6f22037ef002282c2c1","slug":"tea"},{"id":"5c47a6f22037ef002282c2c2","slug":"ginger"},{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"}]}}}