{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c354","uuid":"7c0032d9-e246-4e10-b832-c5f5b48f107d","title":"Dear Sumedha, (a love letter)","url":"https://cookinginpjs.herokuapp.com/galentines-day-scones/","published_at":"15 February, 2016","html":"<p>I've been watching Parks and Recreation lately, and I am constantly inspired by the friendships Leslie cultivated with the women in her life. So, this post, I'm taking a page out of her book, and writing a love letter to Sumu, my co-writer, soul sister, and fellow adventurer.</p>\n<p>Special shout-out to the lady who taught me how to be a friend; my mom. My mom is intelligent, beautiful, and determined. But above all, she's caring and real. She has a loving and compassionate heart, and seeing her with her friends is something I will always cherish. I am so glad that we've grown into a friendship. I'm the lame kid whose mom is her best friend. And I am really really really lucky.</p>\n<p><img src=\"https://pramods.box.com/shared/static/w65ikv2f7p9cikic7cfgohsnl30monso.jpeg\" alt=\"\"></p>\n<p>Dear Sumedha,</p>\n<p>Thanks for being amazing. For coming to the rescue every time my pictures are sideways, or I can't figure out my own cellphone. For bringing Mindy's and Aziz's books home because you knew I was dying to read them, making me a scrapbook so I wouldn't have to make my own, and putting together an otter watching road trip itinerary, so that I could go on a stress free but totally planned ride.</p>\n<p>Thanks for putting up with me when I get temporarily obsessed with boy bands. Thanks for laughing at me when I snap back to my senses. With your love, nobody can drag me down.</p>\n<iframe src=\"https://embed.spotify.com/?uri=[https://play.spotify.com/track/70OTIpw8x8UXUsuCHW9i1i]\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Thanks for being brown with me. And watching Meet the Patels with me over the phone. This is what dreams are made of.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ab4cjd78mehqrd0dy00zex9e7isvgu0i.jpg\" alt=\"\"></p>\n<p>Thanks for always reassuring me about my admittedly glorious self, and being honest but kind when I look bad in something. Thanks for encouraging my dreams, and constantly believing in me. You are the person I send selfies to when I feel good about myself, and I love that about our relationship.</p>\n<p>You're incandescent, smart, lovely, talented, kind, caring, and authentic. You are an incredible friend, which is perhaps one of the best things I could say about a person. I am so lucky to have you in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/hbi46on7awfpk8te5ce1o79ai8wn4ju8.jpg\" alt=\"\"></p>\n<p>Thanks for being my otter watching and blog partner. Thanks for being the Joey to my Chandler, the Ann to my Knope, and the Tina to my Amy.</p>\n<p><img src=\"https://pramods.box.com/shared/static/c5kl7gputj9wtxoxg752vpc90yh51njq.png\" alt=\"\"></p>\n<p>Also, thanks for being the first of the two of us to not post on her day. It really took the pressure off of me (I think we BOTH thought it would be me!), so thanks. I love you, man.</p>\n<p>In honor of our friendship, Friends, and Valentines Day itself, I made scones. I hope you like them.</p>\n<p><img src=\"https://pramods.box.com/shared/static/alz3hmrfnxx5jg01e9bfshpzuoqjx9jc.jpg\" alt=\"\"></p>\n<p>&lt;3 Anu</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Apricot - Pistachio Scones</h2>\n    <div class=\"summary\">\n      <p><em>These scones are part whole wheat, part all purpose flour, and I think they would benefit from the addition of a floral note. If it's available to you, I would try adding orange blossom water or rose water, and experimenting a bit. \n<p>\nAlso, the Xanthan gum is optional. If you do use it, I used Bob's Red Mill. I've never used it before, and I found it to be really helpful in keeping the dough together, but a lot of recipes I read didn't use it, and the recipe authors in those cases were fine. \n![](https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg)\n</p></em></p>\n      <p>Yield: 12 scones</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Scones</h4>\n          <li class=\"ingredient\">1 1/4 C All Purpose Flour</li>\n          <li class=\"ingredient\">3/4 C Whole Wheat Flour</li>\n          <li class=\"ingredient\">1/2 Tsp Cardamom</li>\n          <li class=\"ingredient\">1 1/2 Tsp Cinnamon</li>\n<li class=\"ingredient\">3 Tbsp Sugar </li>\n<li class=\"ingredient\">2 Tsp Baking Powder</li>\n<li class=\"ingredient\">1 Tsp Salt</li>\n<li class=\"ingredient\">1/3 C Pistachios</li>\n<li class=\"ingredient\">1/2 C Dry Apricots</li>\n<li class=\"ingredient\">3/4 C Cashews</li>\n<li class=\"ingredient\">1 Tbsp Xanthan Gum</li>\n<li class=\"ingredient\">Maple Syrop (for brushing the tops)</li>\n<pre><code>  &lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;right&quot;&gt;\n  &lt;h3 id=&quot;directions&quot;&gt;Directions:&lt;/h3&gt;\n  &lt;div class=&quot;instructions&quot;&gt;\n    &lt;p&gt;\n    1.) Preheat the oven to 375 F, and oil/grease a cookie sheet. Put Cashews and Xanthan Gum in a bowl, and add boiling water to submerge cashews. You want to let the cashews hydrate a bit while you're mixing up other stuff.\n</code></pre>\n<p>\n2.) Chop your apricots into bits - 1/4 - 1/2 inch in size, and put them in a bowl. Add boiling water to those too - re-hydrating them keeps them juicy during the baking process. \n</p><p>\n3.) Mix your flours, salt, baking powder, sugar, cardamom, and cinnamon. Make sure all ingredients are fully mixed in. \n</p><p>\n4.) Roughly chop your pistachios, and throw them into the flour. Give it a quick toss to make sure your pistachios are even incorporated. \n</p><p>\n5.) Drain the apricot water into the bowl with cashews and Xanthan gum. Throw the cashews, gum, and some water into the blender. You want it to be the consistency of a thick greek yogurt, so add as much water as you need to get it there, a little bit at a time. \n</p><p>\n6.) Add your apricots to the flour and give it a quick toss, making sure the apricots are even through the dough. \n</p><p>\n7.) Add your cashew mixture a half cup at a time, until the dough is slightly sticky, and shaggy, but holds together. You don't want to over-knead. This is VERY IMPORTANT. DO NOT OVER-KNEAD. \n</p><p>\n8.) Once your dough has just come together, dump it onto a floured surface, and fold it over twice - once top to bottom, flatten out, then from the other side. THAT'S IT. LEAVE IT ALONE. It's done. \n</p><p>\n9.) Form into a disk about 1 - 1/2 inch thick, and cut into whatever shape you want. I went with the classic triangles, but it's up to you. \n</p><p>\n10.) Brush the bottoms with a touch of flour, and the tops with maple syrup. Pop into the oven, and bake for 15 - 20 minutes. I checked on them at 15, and discovered that they needed a bit more time to not be dense and dough-y. \n</p><p> \n11.) Eat piping hot! Slice them open, enjoy them with a bit of additional maple syrup or a pat of butter, and a delicious cup of tea!\n        </p>\n      </div>\n    </div>\n  </div>\n</div>","feature_image":"https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d7","name":"scones","slug":"scones"},{"id":"5c47a6f22037ef002282c2d8","name":"greatbritishbaking","slug":"greatbritishbaking"},{"id":"5c47a6f22037ef002282c2d9","name":"galentinesday","slug":"galentinesday"},{"id":"5c47a6f22037ef002282c2da","name":"valentinesday","slug":"valentinesday"},{"id":"5c47a6f22037ef002282c2db","name":"parksandrecreation","slug":"parksandrecreation"},{"id":"5c47a6f22037ef002282c2dc","name":"leslieknope","slug":"leslieknope"},{"id":"5c47a6f22037ef002282c2dd","name":"leslieandann","slug":"leslieandann"},{"id":"5c47a6f22037ef002282c2de","name":"amypoehler","slug":"amypoehler"}]}}]}},"pageContext":{"slug":"galentinesday","limit":6,"skip":0,"numPages":1,"currentPage":1}}