{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35e","uuid":"28e9fca4-1790-4afe-9663-c046b09f3043","title":"FoodChella","url":"https://cookinginpjs.herokuapp.com/foodchella/","published_at":"04 May, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg\" alt=\"\"></p>\n<p>So I was terribly sick last week whilst recovering from Coachella so I've decided to treat you guys with not one but TWO whole posts! I know right?! So awesome. You can thank me later. AND to make things better... instead of sharing just a single song... I'm going to gift you with a whole playlist of my favorite songs from Coachella!</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify%3Auser%3A1217494097%3Aplaylist%3A7vHswNAsv4lLIjCNrjvzeZ\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>So very typical of me, I didn't double check my flight timings when booking so I ended up flying out to LAX a whole 10 hours before the rest of my group. I decided to start the trip out right, eggs Benedict and a mimosa at the airport with a side of Gilmore Girls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/egnkhg8zefh3rl0xkh1co74s074cr4c0.jpg\" alt=\"\"></p>\n<p>Usually 10 hours stranded at an airport is a bummer, but there are worse places to get stranded than LAX. It kind of ended up working out for me because I took my camera and explored! I walked from Santa Monica Pier to Venice Beach and soaked in the gorgeous SoCal sun.</p>\n<p>In Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously, probably the best I've ever had in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/0i02gxp1jckp0svdv6cu8wi5ewctzsvm.jpg\" alt=\"\"></p>\n<p>In Venice Beach, I decided to have a lighter option and enjoyed some Burrata and Beets at Larry's Bar &amp; Grill.</p>\n<p><img src=\"https://pramods.box.com/shared/static/6dynwvyb7q9fon9luvmogmd3wbei2szk.jpg\" alt=\"\"></p>\n<p>The most adventurous meal was at dinner with a friend at Wurstküche. We enjoyed some cold beers and Rattlesnake Sausages. It honestly didn't taste much different from other sausages and was actually pretty good but I can't say I'd comfortably eat that again.</p>\n<p><img src=\"https://pramods.box.com/shared/static/aypjyy5024v7hcfqhqa4dwl3x6injkm7.jpg\" alt=\"\"></p>\n<p>The weekend was filled with new musical obsessions, including Zhu &amp; Flume (seriously check out that playlist ^), new friends, delicious eats, and lots and lots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the unfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon, Sean Paul, and Nico&amp;Vinz during Matoma's set.</p>\n<p><img src=\"https://pramods.box.com/shared/static/duq94s8q18b3qklwj730gkuu2l5szcpm.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/ie4gkxnr4yruv5grnjyaya1iunyoj6pm.jpg\" alt=\"\"></p>\n<p>I came back home the following Monday sunburned (what happens when you wander around LA without sunscreen) and exhausted out of my mind; Cue sickness.</p>\n<p>This was my first year attending Coachella, every instagrammer's and basic bitch's haven. Of course I had to have ONE basic picture myself to commemorate the experience.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z7gfp3dlql2f2wag911y4lvsznp2q06v.jpg\" alt=\"insert basic watermelon picture here\"></p>\n<p>Coachella is also a GREAT place for foodies. While you needed to be a VIP to get access to some of the tastiest and more exclusive food, there was plenty of delicious options to spare. Looking back at my food photos, I realize that I basically survived off fries. Just fries. And obviously watermelon, because it IS Coachella. But these fries were no ordinary fries my friends. They were all loaded with various toppings and delicious goodness.</p>\n<p>Veggie Monster Fries with lots of types of slaw and jalapeños!<br>\n<img src=\"https://pramods.box.com/shared/static/z4ge00bngygbfezcdyv3x4gdsve5p72u.jpg\" alt=\"\"></p>\n<p>Vegetarian Poutin Fries with cheese curds!<br>\n<img src=\"https://pramods.box.com/shared/static/uyr9jkumf8n2a6mzue6bxdrimbfblro2.jpg\" alt=\"\"></p>\n<p>Crab Fries! This meant crab aioli AND crab topping! Double yum!<br>\n<img src=\"https://pramods.box.com/shared/static/bcjeq6dasdfv4jbihq44hhsudjks88eh.jpg\" alt=\"\"></p>\n<p>Chicharones Fries with Sriracha and curry aioli!<br>\n<img src=\"https://pramods.box.com/shared/static/2uta04ogd3ap0dy1aw8ya7xit7ocqvul.jpg\" alt=\"\"></p>\n<p>I honestly have no idea how most of these things were made but my stomach was hella happy. :)</p>\n","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","tags":[{"id":"5c47a6f22037ef002282c321","name":"coachella","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","name":"poutin","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","name":"crab","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","name":"chicharones","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","name":"music","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","name":"venice beach","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","name":"santa monica","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","name":"LA","slug":"la"},{"id":"5c47a6f22037ef002282c329","name":"rattlesnake","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","name":"burrata","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35a","uuid":"015353ea-56fa-417c-983c-c5350fb3c81a","title":"Sweet Potato Pie","url":"https://cookinginpjs.herokuapp.com/sweet-potato-pie/","published_at":"25 January, 2016","html":"<p>I made some sweet potato pie today.</p>\n<p><img src=\"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg\" alt=\"\"></p>\n<p>This was my second time making this dessert, and I made it in a more or less similar way.</p>\n<p>The first time I made it, I bragged to my housemate, and he asked me if my making a sweet potato pie was cultural appropriation, and I had no idea, because I had no idea sweet potato pie was a thing that black people did. To be honest, I thought it was an all-American thing (immigrant probs, amirite?) So I researched - and I found out that historically, sweet potato pie was a food slaves made in the south. And I had no idea until I made it and someone else called me out on it!</p>\n<p><img src=\"https://pramods.box.com/shared/static/iw7ilzj11mwwevcfd9rwv4255nyunmla.jpg\" alt=\"\"></p>\n<p>Here's the thing about cultural appropriation in food - it happens ALL THE TIME. People love to take foods from other cultures - frequently every day, commonplace foods - and remake them with slight tweaks and giant price tags. So how do you avoid it? I personally advocate for research.</p>\n<p>I think it's important to know where the food you're making comes from, especially when you're modifying it. I tend to modify a lot of recipes to make them vegetarian or vegan, but I try to do it in a way that feels as respectful to me as possible.</p>\n<p>I think there's space in food for innovation, but it has to be accompanied by respect for the important place that food has in culture.</p>\n<p>So, the moral of this story? Don't appropriate. Don't glorify the food of another culture without trying to understand that culture itself. Accept that you'll probably be clueless even with additional information, and do your best to be respectful.</p>\n<p>And also, have some pie.</p>\n<p><img src=\"https://pramods.box.com/shared/static/b9pw4yztlvyi87dno5qfnd1tryy08fyw.jpeg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Sweet Potato Pie</h2>\n    <div class=\"summary\">\n      <p><em>This is a filling dessert. You could tell yourself it's healthy because it has a vegetable as a filling, but let's be real - this is not a healthy dessert. And that's a good thing - sometimes dessert just needs to be decadent.</em></p>\n      <p>Yield: 1 Pie</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">2 hours active cooking time</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Pie Crust</h4>\n          <li class=\"ingredient\">3 C Flour</li>\n          <li class=\"ingredient\">1 Tsp Salt</li>\n<li class=\"ingredient\">3/4 C Coconut Oil</li>\n<li class=\"ingredient\">Ice water, as needed</li>\n        <h4>Sweet Potato Filling</h4>\n          <li class=\"ingredient\">Three Medium Sweet Potatoes</li>\n          <li class=\"ingredient\">1 C Coconut Milk Liquid or 1/2 C Almond Butter</li>\n<li class=\"ingredient\">Maple Syrup, to taste</li>\n<li class=\"ingredient\">1 1/2 Tsp Cinnamon</li>\n<li class=\"ingredient\">1/2 Tsp Cardamom</li>\n<li class=\"ingredient\">1/2 Tsp Pumpkin Pie Spice</li>\n<li class=\"ingredient\">1 Tsp Vanilla Extract</li>\n<li class=\"ingredient\">1 Tsp Orange Extract</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n<p>\n1.) The pie crust recipe is the same dough as that of my  [Love Triangles](http://cookinginpjs.com/love_triangles/) from last week. The first time I did it, I added a little bit too much ice water - perhaps a couple tablespoons too much - and I wound up with a loose dough I didn't want to add more flour to. So that time, I rolled it out hastily, trying not to handle it too much to avoid the coconut oil melting prior to baking. This time I managed to avoid that pitfall, and carefully added only as much water as was necessary, resulting in a soft, elastic, and close-to-perfect dough. I recommend prepping and chilling that before you do anything else.  \n</p><p>\n2.) I went the simple route; I chopped the sweet potato small, into pieces about a half inch wide. After you do that, douse them in spices and throw them in the oven until they are melt-in-your-mouth cooked. Or, you know, about thirty minutes.\n</p><p>\n3.) Mashed them, add maple syrup, the some almond butter, or the liquid from a can of coconut milk for creaminess, and your spices and extracts. You want to make sure it isn't too sweet, tasting every time you add a new ingredient to - ahem - \"assess quality.\" Make sure that the pie isn't so sweet that you can't taste the sweet potato. The goal is to enhance it so it can be the star, not mask it. \n</p><p>\n4.) Preheat the oven to 375 F. Take out your pie dough which has, of course, chilled for at least four hours at this point, and roll it out gently. Set it into a pie pan/tin, and crimp the edges however you're like. Reserve the cut off bits to create a decoration for your pie. Pop the crust in the oven for about fifteen minutes. \n</p><p>\n5.) After the pie crust has baked for about fifteen, take the pie out of the oven and layer in your filling. You want it to be up until the rim of the pie pan - this filling won't expand, so you can fill it right up. Put the pie back in the oven for about twenty minutes. \n</p><p>\n6.) In the meantime, roll out your spare dough and get creative! I went the way of stars and diamonds because those are the cookie cutters I found, but the world is your oyster. When twenty minutes have passed, take your pie out of the oven and carefully place the decorations on top. Put it back in for another 20 minutes. Proceed to turn on the oven light and watch excitedly, as I did (I think I mistook it for a television).\n</p><p>\n7.) After another twenty minutes have passed, increase the oven temperature to 400 F, and place your pies on the top rack - I like my top crust to be a little brown, and this makes that happen!\n</p><p>\n8.) Take your pie out of the oven and serve it up! I loved it with a dollop of coconut whipped cream, but it would likely also taste good with ice cream, or normal whipped cream, or any manner of things. It was also excellent all on its own. \n        </p>\n      </div>\n    </div>\n  </div>\n</div>\n","feature_image":"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c3","name":"sweetpotato","slug":"sweetpotato"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c2bc","name":"pastry","slug":"pastry"},{"id":"5c47a6f22037ef002282c2c4","name":"piecrust","slug":"piecrust"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"slug":"vegetarian","limit":6,"skip":0,"numPages":1,"currentPage":1}}