{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c372","uuid":"329792b8-9854-417e-a287-153b2af1d843","title":"Bhaaji Re Bhaaji Re Bhaaji RE!","url":"https://cookinginpjs.herokuapp.com/bhaaji-re-bhaaji-re-bhaaji-re/","published_at":"03 March, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/g4ab45jrsci3hv02dt7a9s8744otld65.jpg\" alt=\"\"></p>\n<p>So just to make up for my epic fail(s) these past weeks, I'm giving you 2 songs to listen to during this post!! (And to console an angry friend of mine :) I love you!)</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/6VBAGMkTjTs?wmode=transparent\"></iframe>\n</div>\n<p>Last month was the Super Bowl. Probably one of the MOST hyped up events in the United States. Usually, I'm not affected by much of this hype. There have even been years where I've forgotten to watch the Super Bowl altogether. I know. HOW COULD I? How very un-American of me. But nonetheless, if my team wasn't playing I was generally not too interested.</p>\n<p>This year was different. I've been in a Super Bowl city before; Detroit hosting in 2006. I probably lived about the same distance from all the events then than I did this time around, but this time was different. Super Bowl 50 was hosted by the city of San Francisco this year. Hilariously enough, the ACTUAL stadium that the teams were going to play at was a good 50 miles away from San Francisco. So TECHNICALLY the Super Bowl was hosted by the city of Santa Clara, but how many people actually know where that is?</p>\n<p>Exactly.</p>\n<p>So all the official hubbub leading up to the Super Bowl was held in downtown San Francisco. They set up this huge thing called &quot;Super Bowl City&quot; with various events starting a little more than a week before the actual big game. They had EVERYTHING; the puppy bowl, player signings, concerts (including the amazing Alicia Keys). San Francisco really pulled out all the stops for the event.</p>\n<p>I live in Sunnyvale right now. It's a little suburb town about 45 miles from downtown San Francisco. Usually, no issue. It's a quiet little area with lots of families and anything and everything Indian you could ever want. I'm really not kidding about that. There's a Indian grocery or jewelry or clothing or something store in each and every strip mall complex (I think that's what they're called anyways...) I legitimately give people directions to my house by telling them to go to Madras Cafe (one of the most popular dosa places in all of the Bay Area) and then turn onto my street instead of going into that restaurant. Ultimately it means that I'm dragged to that restaurant more than I'd ever like, me being someone who dislikes dosa (go on...hate on me all you want I am that South Indian that doesn't like dosa).</p>\n<p>Anyways... why is this important you may ask? Sunnyvale just HAPPENS to be approximately a 10 minute drive from the new and shiny Levi's Stadium in Santa Clara. The very stadium that happened to be hosting the Super Bowl last weekend. I know, lucky me! I get to go see all these tailgates and do all these cool football related things. Don't get me wrong... I LOVE football but it made me very bitter all weekend. In case you forgot, all the cool and fun events that were happening for the Super Bowl were happening in downtown San Francisco. So no cool pre-Super Bowl events for me. You'd think that AT LEAST I'd get to do some fun things the day of.... NOPE you thought wrong. Apparently you either needed to have specific connections/be a season ticket holder OR you needed to cough up some serious money to participate in all of these tailgating events. Levi's Stadium also has a strict no-tailgating policy for their parking lots, so I didn't get to attend anything. Clearly I'm not bitter at all about this.</p>\n<p>Anyway, my Super Bowl plans consisted of making an large amount of Pav Bhaaji and watching the game with my friend whilst we stuffed our faces. I was going to add a little bit of a rant about the Coldplay halftime show but that's for another time. I may not be a complete fan of Coldplay's Hymn for the Weekend music video but I do love the song...so I was very disappointed that they cut it from the Super Bowl halftime performance.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:3RiPr603aXAoi4GHyXx0uy\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Regardless, we had pav bhaaji to console us over Chris Martin being the left shark of this year's Super Bowl. Pav Bhaji is a wonderful, buttery delicacy from the streets of Mumbai. I'm thoroughly convinced that pav bhaaji tastes better when you get it from grungier and shadier places, aka a variety of street vendors. What street food doesn't taste better, when it's made and served to you from a giant stove in the middle of some market?!</p>\n<p><img src=\"https://i.ytimg.com/vi/_LFy3UYws2Y/hqdefault.jpg\" alt=\"\"></p>\n<p>I did have a slight mishap in making the pav bhaaji. I was so concentrated on combining a few different recipes into one that I absent-mindedly added bisibelebaath masala instead of pav bhaaji masala. While I do love me some bisibelebaath... the masala doesn't quite give you the taste you're looking for in pav bhaaji. So there I was, watching my disaster simmer and cook on my stove while the clock ticked down to the start of the game. Then I realized that I may have some the ingredients in my spice rack to make my own make-shift pav bhaaji masala. Pav bhaaji masala is made by grinding cardamom, coriander seeds, cumin, fennel seeds, dry chilies, cinnamon sticks, cloves, and dry mango powder. I somehow had most of these things, so I proceeded to add varied amounts of dry mango powder, cumin powder, ground cardamoms, and coriander seeds until it tasted close to pav bhaaji I like.</p>\n<p>Not in any way perfect, but not bad either! My friend being the sweetheart that he is claimed that he loved it! I feel like he was just being a nice friend so I highly recommend getting the pav bhaaji masala and using that instead of making your own with w/e you have in your kitchen. It'll just taste better and closer to what you would have wanted to begin with.</p>\n<p><img src=\"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Pav Bhaaji</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">Ghee</li>\n          <li class=\"ingredient\">1 bell pepper, chopped</li>\n          <li class=\"ingredient\">1 cup water</li>\n          <li class=\"ingredient\">4 roma tomatoes, chopped</li>\n          <li class=\"ingredient\">4 medium potatoes, chopped</li>\n          <li class=\"ingredient\">1 cup cauliflower florets</li>\n          <li class=\"ingredient\">1 1/2 tsp ginger-garlic paste</li>\n          <li class=\"ingredient\">1 onion, chopped</li>\n          <li class=\"ingredient\">2 tbsp pav bhaaji masala</li>\n          <li class=\"ingredient\">1 1/2 tbsp red chili powder</li>\n          <li class=\"ingredient\">1 tsp garam masala powder</li>\n          <li class=\"ingredient\">1 tsp turmeric</li>\n          <li class=\"ingredient\">1 tbsp kasuri methi (dried fenugreek) powder</li>\n          <li class=\"ingredient\">lime wedges for garnish</li>\n          <li class=\"ingredient\">some chopped onion for garnish</li>\n          <li class=\"ingredient\">salt according to taste</li>\n          <li class=\"ingredient\">pav buns (plain slider buns can also work)</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>In your pressure cooker, cook the potatoes and cauliflower until soft and tender.</p>\n        <p>Add butter (or ghee :D) to a large pan. Once it's heated, add the chopped bell pepper to it. Once that has softened, add a little water and mash.</p>\n        <p>Stir in the tomatoes and boiled vegetables and cook for 2-3 minutes. Add ginger-garlic paste and sauté for 2 minutes. Once the tomatoes have cooked, mash everything with a masher (or anything close to that).</p>\n        <p>In a separate pan, sauté chopped onion in ghee until it becomes a pale brown color. Add all the spices and salt and sauté for a few more minutes. Add some more water if it starts getting dry.</p>\n        <p>Add the onion mixture to the bhaaji and mix. Add water until it reaches the desirable consistency. Similarly with the spices and lime juice. Toast some pav buns and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/g4ab45jrsci3hv02dt7a9s8744otld65.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/b903fi6yix0qdhtqymxc78bgoku8w9wb.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"},{"id":"5c47a6f22037ef002282c2e9","name":"super bowl","slug":"super-bowl"},{"id":"5c47a6f22037ef002282c2ea","name":"salman khan","slug":"salman-khan"},{"id":"5c47a6f22037ef002282c2eb","name":"bollywood","slug":"bollywood"},{"id":"5c47a6f22037ef002282c2ec","name":"pav bhaaji","slug":"pav-bhaaji"},{"id":"5c47a6f22037ef002282c2ed","name":"cravings","slug":"cravings"}]}}]}},"pageContext":{"slug":"salman-khan","limit":6,"skip":0,"numPages":1,"currentPage":1}}