{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37e","uuid":"a95f8d2d-1470-4844-aa6e-784a730e7ce2","title":"Estoy Cantando","slug":"estoy-cantando","published_at":"06 January, 2016","plaintext":"\n\nAnyone who has had the honor  of being in my presence this week knows that I've\nbeen playing one song on repeat. One song. All week. Why you may ask?\nDUH...BECAUSE IT'S AMAZING.\n\n(Now's when you play this song and dance along while finishing to read this\npost.)\n\nMy brother was visiting me for a week and I quickly realized 1) apparently no\none comes to work during the holidays in my office, meaning sub-par lunches and\ndinners all week and 2) I hadn't done groceries in weeks, meaning I didn't have\nanything to feed the kid while he was staying with me. Being the ever so\nresponsible adult that I am, I decided that I could muster enough patience to\ncook lunches and dinners for my brother a few times, or at least while I was\nworking from home. We braved it out to a farmers market and brought back a\ncollection of various vegetables without any idea of what to make. While\nbrainstorming ideas my brother decided that since he was spending a week in\nCalifornia, he was going to try and eat Mexican food for each and every meal.\n\nMy next step was to figure out what kind of Mexican dish to make when all I had\nbought was stir fry vegetables. Voilà! MEXICAN \"STIR FRY\"! Or I guess as normal\npeople call it... TOSTADA BOWLS!\n\n\n\nThere's not really a recipe for this post because honestly I kind of made it up\non the spot. BUT I can give you some bits and pieces of what went in this so you\ncan make your own variation of this dish at home! (I KNOW, how sweet of me.)\n\nThis dish is essentially a layer of cilantro lime rice, refried beans,\nvegetables sautéd fajita style, salmon (totally optional and honestly kinda\nruined the dish for me, my brother's vegetarian one was on point), guacamole,\nsour cream and cotija cheese a.k.a. fancy Mexican cheese. Plus you can throw\nsome chopped green onions on top to make it look all pretty and fancy.\n\n\n\nI've always loved making Mexican food. It's so flavorful and deliciously\nrewarding every time! Every single part of a burrito/taco/bowl is overflowing\nwith unique tastes that seem extremely complicated and intricate. I'll let you\nin on a little secret...I use the same seasoning to cook every single part of\nany Mexican dish I make. Whether it be the refried beans or fajita vegetables,\nit's all various spice levels of the same recipe. I'm sure that's not how\nauthentic Mexican food is made, but hey...mine tastes pretty damn good too.\n\nSumedha's Super Secret Fajita Seasoning\nFeel free to mess around with the proportions of each ingredient! Make as much\nor as little seasoning to go in\n\nIngredients:\n2 tsp cumin\n 1 tsp cayenne pepper\n 1 tsp paprika\n 1 tsp salt\n 1 tsp garlic powder\n Directions:\nMix it all together\n\nFor the guacamole, I generally use the recipe graciously provided by Chipotle\n[https://www.chipotle.com/guac-recipe]. Sometimes I add some cumin or replace\nthe jalapeños with cayenne pepper if I'm feeling dangerous. To go off on a\ntangent, couldn't you watch this gif of guacamole being made forever? 1) I feel\nreally bad for/impressed by the person who disrobed all those avocados and 2) I\njust want to dive into that bowl tongue first. (Excuse me while I make myself a\nbowl)\n\n\n\nSeveral minutes later\n\nThat's about it! Just sauté the vegetables of your choosing with some oil and\nfajita seasoning, heat up a can of black beans on the stove with fajita\nseasoning, whip up a bowl of guac, season some rice, and pile it all into a bowl\nfor maximum enjoyment.\n\nYUM\n\n\n\n\n\nALSO! If you haven't already check out our instagram with all sorts of\ndelectable pictures of recipes past and future! Do it! Click on the adorable\ninstagram logo!\n\n  [https://www.instagram.com/cookinginpjs/?ref=badge]","feature_image":"https://lh3.googleusercontent.com/On_C3sVekW8RNs9hpoj0MIDrJT00W5fWI7kTOe_-IafE3KppeMwwGQAH0hgHyAsyIfL0wcNPMy-hTHPG82rQYEp8TEFp7rBq798cchUmZcuhpvMACjbfBzZ-s4Rtcd1RwDYNgy3zczqZOCNIyXnMYDeYs6vp3vzsKvQ2_iof13Ye06I5qP97pXrlGz6nC5EE8M23IhTLrpxphEXlJH5eNQ3BRbRiEy7BtKmu-GQwEqzLnrysk4oHdhk_2pFU0xY_CeIhJEkOEvgt2snl16cvP-F1inJW_1D_38G0UgDDF8dFm-y95hNIYY1TYOsiTSDB2nr3jCdw4ii6utGU3k7isNNOlOSGf6sqjnBhEd-ufwL0AiQ1CU5CCle5p4-t7MNW7BTP-xSrKu_fhQPd2yshC_ZL4X2ZDrgFU5rXcJzDjfALGCGlqoO6hegUnK8XBblYqP5p0ENlI6_Tpt3GZ1VuC77PDn-SKSSvig-jqbgxU6IaUFtZwSF26m75wFdl-bwm-Qg1hIzlE8RIp1cXg2MYJwg4lj_PRxjxfZ8eWPtIkuklJI_Z2NS5MXtweiWc5EaIAbm74w=w1186-h790-no","tags":[{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2ab","name":"bowls","slug":"bowls"},{"id":"5c47a6f22037ef002282c25d","name":"stir fry","slug":"stir-fry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"slug":"stir-fry","limit":6,"skip":0,"numPages":1,"currentPage":1}}