{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c355","uuid":"aeba9047-837a-4828-a485-b8159f4c7424","title":"Use microwaves, not microaggressions!","slug":"use-microwaves-not-microaggressions","published_at":"09 May, 2016","plaintext":"I am something of a potato aficionado. I have eaten far more than my fair share\nof potato, roasted, baked, chipped, fried, stir fried, mashed - you name it, I\nhave probably tried it. I love potatoes, and today I decided I wanted to eat\npotatoes for lunch, and this is what I came up with.\n\n\n\nThese are not especially nutritious, but they're not necessarily bad for you\neither. I would, however, recommend adding a vegetable or something somewhere on\nthe plate. Or you could just eat potatoes for lunch. Nobody in this corner will\njudge you.\n\n\n\nThese potatoes are the easiest thing ever, and you have no reason not to make\nthem. Go make them!\n\nEasy Microwave Potatoes\nThese potatoes get a lot of flavor from the type of potato you use, so use your\nfavorite. I used\nIdaho potatoes and really enjoyed them. \n\nYield: 1 bowl; 2 side servings, 1 lunch\n\nTotal Time:  10 minutes\n\nIngredients:\n  <li class=\"ingredient\">2 Small Potatoes, or 1 Large Potato</li>\n  <li class=\"ingredient\">2 Tsp. Butter (can use vegan butter)</li>\n  <li class=\"ingredient\">1 Tsp. Miso</li>\n  <li class=\"ingredient\">1 Tsp. Tahini</li>\n  <li class=\"ingredient\">3 Large Basil Leaves</li>\n  \n</div>\n<div class=\"right\">\n  <h3 id=\"directions\">Directions:</h3>\n  <div class=\"instructions\">\n    <p>\n      1.) Stab your potato(es) and stick them in the microwave in a ceramic or glass bowl. Microwave for three minutes.\n      </p>\n      <p>\n        2.) Combine your butter, miso, and tahini in a bowl, and beat it lightly with a fork. It should be creamy at the end.\n        </p>\n      <p>\n        3.) Take your potatoes out of the microwave, cut them in half, and put them back in the microwave for three or four  more minutes.\n        </p>\n      <p>\n        4.) Shred your basil, and keep it ready. When your potatoes are done, chop them roughly into bite-sized pieces. Throw the hot potatoes into the bowl with the butter mixture, and stir until the potatoes are coated in the butter. Sprinkle with basil and eat!\n      </p>\n    </div>\n</div>","feature_image":"https://pramods.box.com/shared/static/hylt0nyiky2u1ox43pvzqs19mzp7w51x.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c311","name":"basil","slug":"basil"},{"id":"5c47a6f22037ef002282c330","name":"potatoes","slug":"potatoes"},{"id":"5c47a6f22037ef002282c331","name":"10 minute meals","slug":"10-minute-meals"},{"id":"5c47a6f22037ef002282c332","name":"miso","slug":"miso"},{"id":"5c47a6f22037ef002282c333","name":"butter","slug":"butter"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34e","uuid":"3ad5b0c8-60ad-4f56-8eb5-5be3b0848c58","title":"Spring(roll) has sprung!","slug":"its-spring-rolls","published_at":"03 April, 2016","plaintext":"Hey y'all, we're back! Sorry for the brief and awkward hiatus; it was certainly\nnot our intention, and won't be happening again! Sumu was moving, and I was\nletting law school rain on my parade. But we're back now!\n\n\n\nSumu's all settled into her new apartment in the city, and while law school is\nstill kicking my ass, I've decided to chill out. Law school itself was never the\npoint, and forgetting that is the number one cause of stress for me.\n\nSo, we're kicking off our triumphant return with a throwback recipe. When I got\nto California to visit Sumu, we made fresh rolls. I'll be honest and say that I\ndon't know the difference between a spring roll and a fresh roll. What I do know\nis that fresh rolls, full of bright, delicious veggies and sauces, feel like\nspring time to me.\n\n\n\nThis recipe is easily customizable, for which reason there are no specific\nquantities in the recipe. Do what your heart tells you. Go with your gut. Feel\nout your local grocer and figure out what you can get in what quantities.\n\nSpring is finally here, and while spring break has long since passed, these\nrolls will pretty much always be in season.\n\nSpring Rolls\nThese are the best way to deliver a quick, one two punch of veggies to yo' bod.\nYour mouth and your stomach deserve this meal. This is a pretty sexy recipe,\nwith all the crisp, fresh veggies, the sharp kick from the sriracha and the\nsilky sweetness of hoisin, with some big fresh basil leaves bringing it full\ncircle...I'm drooling just thinking about it! \n\nYield: negotiable\n\nTotal Time:  45 minutes\n\nIngredients:\nComponent 1\nRice paper sheets. Can be found at Asian groceries\n Fresh basil leavesBok choyCarrotsCilantroBeetsBean sproutsHoisin SauceSriracha\nSauceTofuAlfalfa sprouts\n Directions:\n\n1.) Prepare your vegetables. Slice your carrots into matchsticks, steam your bok\nchoy, saute the beets, cook your tofu how you like (we did fried tofu sauted in\nbarbecue sauce) and rinse your bean sprouts, before arranging everything in\nbowls around your workstation.\n\n\n2.) Set a shallow plate full of hot water beside you, and take out a rice paper\nsheet. Dip it into the water for ten seconds, and then lay it out on a cutting\nboard.\n\n\n3.) Layer your veggies and tofu in a mound in the middle of the sheet, then\ndrizzle sauces over it. Fold the two sides over, then roll smoothly from top to\nbottom.\n\n\n4.) Enjoy. Delicious!","feature_image":"https://pramods.box.com/shared/static/7d95dkz95g5gdrlfsv8xdqd6bp2yxbic.jpg","tags":[{"id":"5c47a6f22037ef002282c2f3","name":"spring break","slug":"spring-break"},{"id":"5c47a6f22037ef002282c30e","name":"spring rolls","slug":"spring-rolls"},{"id":"5c47a6f22037ef002282c30f","name":"fresh rolls","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c310","name":"rice paper","slug":"rice-paper"},{"id":"5c47a6f22037ef002282c311","name":"basil","slug":"basil"},{"id":"5c47a6f22037ef002282c269","name":"sriracha","slug":"sriracha"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"slug":"basil","limit":6,"skip":0,"numPages":1,"currentPage":1}}