{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c345","uuid":"a36cd4bb-ea95-40c9-825a-ecfaa379ce90","title":"Wasted away again in Margaritaville, Searchin' for my lost shaker of salt.","slug":"wasted-away-again-in-margaritaville-searchin-for-my-lost-shaker-of-salt","published_at":"23 February, 2016","plaintext":"\n\nHappy National Margarita Day!!! Bet you didn't know that was a thing! Well now\nyou do so you're welcome.\n\nIn case you weren't aware... Jimmy Buffett actually had a cameo in Jurassic\nWorld last year. Of course he was one of the people escaping the pterodactyls.\nBut of course, in true Margaritaville fashion, he makes sure to grab BOTH of his\nmargaritas before making a run for it.\n\n\n\nThis man is a hero. He clearly knows what today is about. If you haven't\nalready, definitely play the song I linked to above while reading the post. I\npromise the lyrics won't disappoint. If you're really digging the song, I\ntotally recommend checking out the entire album. It's a gold mine of amazing\nsongs like \"Cheeseburger in Paradise\", \"Pencil Thin Mustache\", \"Grapefruit -\nJuicy Fruit\", \"Son of a Son of a Sailor\", and last but not least \"Why Don't We\nGet Drunk.\" I've linked the entire album here for your enjoyment. Do it. I\npromise it's totally worth it.\n\nUsing the great Jimmy Buffett and National Margarita Day as inspiration, I\nfigured I can FINALLY share the amazing strawberry margaritas with you guys. I\nmade these margaritas last year for a Cinco de Mayo celebration at my cousin's\nplace. Technically it was Seis de Mayo because May 5th last year was a Tuesday\nand everyone was busy that day. These were a HUGE hit and best part is that when\nyou run out of strawberries you can just use more lime juice and make plain\nmargaritas. It's the best.\n\nIn case you needed more convincing to actually listen to that song:\n\n\"But there's booze in the blender, and soon it will render that frozen\nconcoction that helps me hang on.\"\n\nYeah... I know. He sings from the heart. Now turn on the song and start blending\nup some delicious margaritas for you and your friends!\n\n\n\nFrozen Strawberry Margaritas\nJust as a warning, these are quite strong so I'd recommend tasting as you add\nthe tequila. However... It's always 5 o'clock somewhere!\n\nYield: about 4-5 margaritas\n\nIngredients:\n2 cups frozen strawberries\n 1 cup silver tequila\n 2/3 cup freshly squeezed lemon or lime juice (save a few wedges for garnish)\n 1/3 cup honey or agave\n 1/4 cup Triple Sec (or Cointreau)\n Coarse salt to rim the glasses\n Directions:\nBlend all the ingredients except salt together in the blender. Taste and adjust\ntequila or honey/agave as you wish\n\nRun a lime wedge along the rim of each of your margarita glasses. Dip the glass\nupside-down in a bowl of salt. Fill each glass with the drink and garnish with a\nlemon or lime wedge.","feature_image":"https://pramods.box.com/shared/static/6917hfisdaydben1ot5yvzlfxep4kef1.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c278","name":"margaritas","slug":"margaritas"},{"id":"5c47a6f22037ef002282c279","name":"strawberry","slug":"strawberry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ee","name":"jimmy buffett","slug":"jimmy-buffett"},{"id":"5c47a6f22037ef002282c2ef","name":"Margaritaville","slug":"margaritaville"},{"id":"5c47a6f22037ef002282c277","name":"cinco de mayo","slug":"cinco-de-mayo"},{"id":"5c47a6f22037ef002282c2f0","name":"tequila","slug":"tequila"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"}]}}]}},"pageContext":{"slug":"jimmy-buffett","limit":6,"skip":0,"numPages":1,"currentPage":1}}