{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37a","uuid":"38072c55-2abc-41d8-8cd1-7c995002e516","title":"Little Bites of Heaven","slug":"little-bites-of-heaven","published_at":"05 May, 2015","plaintext":"\n\nI LOVE baking but since I don't really like eating desserts its usually pretty\nhard to come up with reasons to actually make anything. I usually just end up\nmaking really small quantities which barely justifies all the ingredients I\nwould have needed to get to make the desserts. At work I noticed that anytime\nsomeone brought in donuts or anything else, people would hunt the food down and\ndevour it. Figuring this the was the best opportunity to kill two birds with one\nstone, so I whipped up a few batches of the brownies and brought them to work.\n\nFirst, I sent an email to my team and only a few people grabbed some. I thought\nI had made a complete mistake making so many brownies, or maybe I was delusional\nabout how the brownies tasted since I had made them. As a last option, I sent an\nemail out to the whole company and left them in the common area of my floor.\nTwenty minutes later when I went to go check on them, I saw an empty box.\nClearly the brownies had been a huge hit! Now that I've found the perfect group\nto sample all of my treats, I can bake without worries! My coworkers can expect\na flood of baked goods at least once a month from here on out while I use them\nas guinea pigs for all the different desserts I've always wanted to make! :)\n\n\n\n\n\nPersonally, I'm not a huge fan of cheesecake, but these little bites are\namazing. At first when I bit into one, it was perfectly gooey and chocolatey and\nwith a little bit of cheesecake to top off the flavor. I honestly wasn't sure if\nI hadn't cooked them all the way, but after thoroughly inspecting and devouring\na few, I realized that that's just the way the brownies cook! Each brownie was\nperfectly gooey yet filled with flavors just melting in your mouth. The\ncheesecake portion was the perfect compliment for the sweetness of the brownies.\nTry the recipe yourself and let me know how you like it!\n\nChocolate Chip Cheesecake Brownie Bites\nIngredients:\nBrownie Part:\n¾ cup melted unsalted butter\n 1¼ cup sugar\n 1 cup unsweetened cocoa powder\n ¼ tsp salt\n 1 tsp vanilla extract\n 2 large eggs\n ½ cup all-purpose flour\n ¾ cups semi-sweet chocolate chips\n Cheesecake Part:\n8 oz softened cream cheese\n ½ cup sugar\n ¼ tsp vanilla extract\n 1 egg yolk\n Directions:\nPreheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and\nkeep it aside. I used a mini cupcake pan but feel free to use a normal size\ncupcake pan if you want bigger brownies!\n\nBrownie Part: Mix the cocoa, sugar, salt, melted butter, and vanilla together.\nMix the eggs into this mixture until the batter is fully mixed. Add the\nchocolate chips (more if you want it super chocolatey :D) and keep aside.\n\nCheesecake Part: In a separate bowl, mix all the cheesecake ingredients together\nuntil smooth.\n\nFill each well in your cupcake pan ¾ full with brownie batter. Add a spoonful of\ncheesecake batter on top of the brownie batter in each well and swirl the\ncheesecake and brownie parts together! Put the pan in the oven and bake for\nabout 20 minutes (I used a 24 mini cupcake pan so it was 20 minutes for me but\nif you have use a smaller/larger pan adjust the time accordingly).","feature_image":"https://farm9.staticflickr.com/8772/17361867465_b5793fb7f7_b.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c273","name":"brownies","slug":"brownies"},{"id":"5c47a6f22037ef002282c274","name":"mini","slug":"mini"},{"id":"5c47a6f22037ef002282c275","name":"swirl","slug":"swirl"}]}}]}},"pageContext":{"slug":"brownies","limit":6,"skip":0,"numPages":1,"currentPage":1}}