{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c365","uuid":"4f72efc4-4172-4a09-a4ad-9aa43784c7d8","title":"Well Son, When a Croissant Loves a Donut...","slug":"well-son-when-a-croissant-loves-a-donut","published_at":"27 June, 2015","plaintext":"\n\n(Here's some music for inspiration :P)\n\nIn 2013, New York was swept over with a new kind of fever.... Cronut Fever. A\nchef in New York City decided that he would take croissant dough and fry it like\na donut. This scrumptious flaky dessert became SO  popular that there was even a\nblack market for them! People would pay $100 on the black market for a cronut\nthat could be bought for $5 if they waited in line for a day.\n\nI'd never tasted a cronut before in my life, so I decided to make use of a bunch\nof stale croissants I had lying around after a road trip. I tore the croissants\ninto bite size pieces and fried them in hot oil and count to 4. Quickly flip\neach cronut and fry again for 4 counts. Make sure not to cook them for too long\nor they get a little too crunchy and burn.\n\n\n\nPlace the fried bites onto paper towels to drain any excess oil. When cooled,\ndrizzle with any icing of your choice or enjoy them by themselves!\n\nThey were flaky yet crunchy, salty yet buttery. It was amazing! I completely\nunderstand what the fuss was in New York City at the time.\n\n\n\n\n\nHowever, I learned a few things while making these. Making them with\nstore-bought croissants is fine, however you get the proper ratio of flakiness\nto fried crunchiness when you use croissant dough. It is also easier not to burn\nthem while frying when you use dough. I am not a huge fan of too much oil, so\nfrying the croissants wasn't my favorite. Maybe there's a way to shallow fry\nthem where they won't pick up too much oil, but I have no idea. Next time I try\nmaking cronut bites, I will try to bake store-bought croissants and see if that\nmakes a difference. Who knows!\n\nFor the mean time, I completely suggest you try making these at home! They're\nsimple to make and taste amazing! If you're too lazy then I'd recommend going to\nyour local pastry shop and seeing if they make something similar!","feature_image":"https://lh3.googleusercontent.com/I3bLdLcbLHBZH2QIeDqAX55etYu-5I1Tz94-7LJ62KRW=s800","tags":[{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c283","name":"cronut","slug":"cronut"},{"id":"5c47a6f22037ef002282c284","name":"fried","slug":"fried"},{"id":"5c47a6f22037ef002282c285","name":"croissant","slug":"croissant"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37a","uuid":"38072c55-2abc-41d8-8cd1-7c995002e516","title":"Little Bites of Heaven","slug":"little-bites-of-heaven","published_at":"05 May, 2015","plaintext":"\n\nI LOVE baking but since I don't really like eating desserts its usually pretty\nhard to come up with reasons to actually make anything. I usually just end up\nmaking really small quantities which barely justifies all the ingredients I\nwould have needed to get to make the desserts. At work I noticed that anytime\nsomeone brought in donuts or anything else, people would hunt the food down and\ndevour it. Figuring this the was the best opportunity to kill two birds with one\nstone, so I whipped up a few batches of the brownies and brought them to work.\n\nFirst, I sent an email to my team and only a few people grabbed some. I thought\nI had made a complete mistake making so many brownies, or maybe I was delusional\nabout how the brownies tasted since I had made them. As a last option, I sent an\nemail out to the whole company and left them in the common area of my floor.\nTwenty minutes later when I went to go check on them, I saw an empty box.\nClearly the brownies had been a huge hit! Now that I've found the perfect group\nto sample all of my treats, I can bake without worries! My coworkers can expect\na flood of baked goods at least once a month from here on out while I use them\nas guinea pigs for all the different desserts I've always wanted to make! :)\n\n\n\n\n\nPersonally, I'm not a huge fan of cheesecake, but these little bites are\namazing. At first when I bit into one, it was perfectly gooey and chocolatey and\nwith a little bit of cheesecake to top off the flavor. I honestly wasn't sure if\nI hadn't cooked them all the way, but after thoroughly inspecting and devouring\na few, I realized that that's just the way the brownies cook! Each brownie was\nperfectly gooey yet filled with flavors just melting in your mouth. The\ncheesecake portion was the perfect compliment for the sweetness of the brownies.\nTry the recipe yourself and let me know how you like it!\n\nChocolate Chip Cheesecake Brownie Bites\nIngredients:\nBrownie Part:\n¾ cup melted unsalted butter\n 1¼ cup sugar\n 1 cup unsweetened cocoa powder\n ¼ tsp salt\n 1 tsp vanilla extract\n 2 large eggs\n ½ cup all-purpose flour\n ¾ cups semi-sweet chocolate chips\n Cheesecake Part:\n8 oz softened cream cheese\n ½ cup sugar\n ¼ tsp vanilla extract\n 1 egg yolk\n Directions:\nPreheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and\nkeep it aside. I used a mini cupcake pan but feel free to use a normal size\ncupcake pan if you want bigger brownies!\n\nBrownie Part: Mix the cocoa, sugar, salt, melted butter, and vanilla together.\nMix the eggs into this mixture until the batter is fully mixed. Add the\nchocolate chips (more if you want it super chocolatey :D) and keep aside.\n\nCheesecake Part: In a separate bowl, mix all the cheesecake ingredients together\nuntil smooth.\n\nFill each well in your cupcake pan ¾ full with brownie batter. Add a spoonful of\ncheesecake batter on top of the brownie batter in each well and swirl the\ncheesecake and brownie parts together! Put the pan in the oven and bake for\nabout 20 minutes (I used a 24 mini cupcake pan so it was 20 minutes for me but\nif you have use a smaller/larger pan adjust the time accordingly).","feature_image":"https://farm9.staticflickr.com/8772/17361867465_b5793fb7f7_b.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c273","name":"brownies","slug":"brownies"},{"id":"5c47a6f22037ef002282c274","name":"mini","slug":"mini"},{"id":"5c47a6f22037ef002282c275","name":"swirl","slug":"swirl"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c350","uuid":"0471ace4-44cc-4677-a447-dd097e15cbcb","title":"Dirty Dancing: Salsa Nights","slug":"dirty-dancing-salsa-nights","published_at":"01 May, 2015","plaintext":"First of all, Dirty Dancing Havana Nights is one of my favorite movies. The\nmusic, the dancing, and let's not forget Diego Luna. In honor of Diego Luna and\nhis amazing dancing, play the song below while you read this post. Now that\nyou've set the mood, let's get started.\n\nHaving lived in Michigan most of my life, I've been used to eating sub par\nMexican food and grew to love that. However last month when me and my family\nwent to Cancun for a week, I knew I had been missing out on something big. The\namazing flavors of corn tortillas, super flavorful meat (or beans for you\nvegetarians), fresh salsas and Crema Mexicana mesh together for a completely\ndifferent experience of eating simple tacos. Now that I had officially been\nconverted to a taco snob, I was determined to only eat the best of tacos I could\nfind.\n\nConveniently the bay area is filled with the most amazing food, especially when\nit comes to taco trucks. Each taco truck I've visited usually has a side of a\nfew salsas. I was determined to recreate two of my favorite taco truck salsas,\nan avocado tomatillo salsa and a spicy red chili salsa, as authentic as\npossible.\n\n\n\nI found a few recipes online, and experimented on my own and finally ended up\nwith these recipes!\n\n\n\nAvocado Tomatillo Salsa\nFeel free to adjust the number of chilis based on your own spice tolerance. You\ncan also remove the seeds of the chilis to reduce their spice as well. Also keep\nin mind that this salsa tends to be the milder balance to the other super spicy\nred salsa.\n\nIngredients:\n4-5 tomatillos, husked, rinsed, and chopped\n 4-5 serrano chilies\n 1 cup packed cilantro, chopped\n ½ white onion minced\n ¼ cup water\n 1 ripe Hass Avocado\n Lime juice to taste\n Salt and pepper to taste\n Directions:\nBlend all ingredients together in your blender until smooth.\n\n\n\nRed Chili Tomatillo Salsa\nAgain, feel free to adjust the number of chilis based on your own spice\ntolerance. You can also remove the seeds of the chilis to reduce their spice as\nwell. I made mine super spicy and had no complaints so I say go for it!\n\nIngredients:\n5-6 tomatillos, husked, rinsed, and chopped\n 1-2 roma tomatoes chopped\n 6 cloves of garlic\n ½ white onion minced\n 6-7 hot dried red chilies, stemmed\n ½ tsp sugar\n Salt and pepper to taste\n Directions:\nDry roast the chilies and garlic until you can really smell them and they both\nhave darkened a bit. Blend these along with the rest of the ingredients together\nin your blender until smooth.\n\nMake sure to check out my post coming out soon about food truck style tacos I\nmade!","feature_image":"https://farm9.staticflickr.com/8743/17335026415_ff5458c370_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","name":"salsa","slug":"salsa"},{"id":"5c47a6f22037ef002282c26a","name":"spicy","slug":"spicy"},{"id":"5c47a6f22037ef002282c26c","name":"california","slug":"california"},{"id":"5c47a6f22037ef002282c26e","name":"tomatillo","slug":"tomatillo"},{"id":"5c47a6f22037ef002282c26f","name":"avocado","slug":"avocado"},{"id":"5c47a6f22037ef002282c270","name":"chilies","slug":"chilies"},{"id":"5c47a6f22037ef002282c271","name":"taco truck","slug":"taco-truck"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c346","uuid":"6f57be9e-a31d-449e-ba29-b0f2b7c8535e","title":"Galentine's Day Cupcakes","slug":"galentines-day-cupcakes","published_at":"01 May, 2015","plaintext":"\n\nWhat's Galentine's Day you ask? No one could have answered that question better\nthan Amy Poehler herself, \"it's only the best day of the year. Every February\n13th, my lady friends and I leave our husbands and our boyfriends at home, and\nwe just come and kick it, breakfast-style. Ladies celebrating ladies. It's like\nLilith Fair, minus the angst. Plus frittatas.\"\n\nEver year on Valentine's Day, my mom sends me a special gift. When I lived it at\nhome, she used to give me and my brother cute small stuffed animals with hearts\non them. When I moved to Ann Arbor for college, she took a different approach.\nEvery year, she would send me a heart shaped pizza with my favorite toppings,\nMUSHROOMS!\n\nThis past Valentine's Day, however, I was in India so neither was possible. So\nmy cousins and I decided to celebrate Galentine's Day instead! We made some\ndelicious red velvet cupcakes from scratch, enjoyed some leftover batter, and\nwatched some light hearted chick flicks. All in all, a great way to celebrate\nour fellow ladies.\n\n\n\nWe were pretty lazy about experimenting with the recipe so I will just leave you\nwith the recipe we used\n[http://sallysbakingaddiction.com/2014/10/29/red-velvet-cupcakes/]  for the\ncupcakes and made a basic chocolate icing following the instructions on the bag\nof confectioners sugar.\n\n\n\n\n\n\n\n\"February 14th, Valentine's Day, is about romance. But February 13th,\nGalentine's Day, is about celebrating lady friends. It's wonderful and it should\nbe a national holiday.\"\n\n * Leslie Knope","feature_image":"https://farm9.staticflickr.com/8573/16406140367_5c5b265be3_b.jpg","tags":[{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c254","name":"galentines day","slug":"galentines-day"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c256","name":"red velvet","slug":"red-velvet"},{"id":"5c47a6f22037ef002282c257","name":"valentines day","slug":"valentines-day-2"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c373","uuid":"7dfb9b35-e35e-4d3e-a667-6a982763e05c","title":"Did you fall for a shooting star?","slug":"did-you-fall-for-a-shooting-star","published_at":"21 April, 2015","plaintext":"\n\nAnyone who knows me, knows I'm obsessed with a wine called \"Drops of Jupiter.\"\nAnd why not?! One of my favorite bands, Train, partnered with a California\nwinery to make a line of wines named after some of their most famous songs! What\ncould be better than that!\n\nThis was a great wine for me and my friends, especially because we all have\ndifferent preferences when it comes to wine. I prefer a really deep spicy red,\nwhereas most of my friends like drier whites or dessert wines. Surprisingly,\nthis wine solved most of our dilemmas. Each glass is smooth, sweet and spicy,\nbut doesn't lean too far in either direction. It has something for all shades of\nwine lovers! (Plus it doesn't hurt that it's under $10) It's a college wine\nlover's dream! :)\n\n\n\nDrops of Jupiter is not even the only type of wine that the Save Me San\nFrancisco Wine Co makes. They also make Calling All Angels, California 37,\nBulletproof Picasso, Hella Fine, and Soul Sister.\n\nJust pour yourself a glass, blast Drops of Jupiter\n[https://www.youtube.com/watch?v=7Xf-Lesrkuc], and take a trip back to the 90's!","feature_image":"https://farm9.staticflickr.com/8782/17033305629_16faa89701_b.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c247","name":"wine","slug":"wine"},{"id":"5c47a6f22037ef002282c248","name":"drops of jupiter","slug":"drops-of-jupiter"},{"id":"5c47a6f22037ef002282c249","name":"train","slug":"train"},{"id":"5c47a6f22037ef002282c24a","name":"red wine","slug":"red-wine"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34f","uuid":"7e8c442d-4c8d-4c6b-8667-33acc5c95e1a","title":"The Glorious Monstrosities of Frita Batidos","slug":"frita-batidos","published_at":"27 March, 2015","plaintext":"\n\nFrita Batidos is one of the crown jewels of Ann Arbor, MI. It is a small cuban\nstreet food restaurant in downtown Ann Arbor. While it may be a slight walk from\nthe University of Michigan campus, many students make the trek despite any\nridiculous weather conditions to get a bite of these burgers.\n\nThey have the one of the most delicious, insanely huge and jam packed burgers\nI’ve ever eaten in my life. No matter the patty you want inside your burger,\nwhether it be black bean, chicken, or chorizo, you’re bound to get a tasty\nconcoction which will blow your mind. Honestly I have yet to meet a person at\nthe University of Michigan who doesn’t like their burgers.\n\nThe basic burger (or Frita) is simple, just the patty between two egg buns and\nstuffed with fries. I also added some cilantro-lime salsa and tropical slaw to\njuice it up a little. Safe to say, I don’t think I would be trying to impress\nanyone while eating this monstrosity.\n\n\n\nMy brother always goes with a sunny side up egg and avocado spread on his frita.\nAs soon as you bite into the burger, the yolk bursts, spreading that wonderful\nflavor into every bite thereafter.\n\n\n\nThis trip to Frita Batidos was special because we brought one of my friends here\nfor her first time. She decided to go big or go home and made her frita “loco.”\nThis means that they just go “loco” and add ALL of their available toppings on\ntop of your burger: muenster, a sunny side up egg, cilantro lime salsa, tropical\nslaw, AND avocado spread! This is pretty much the mother of all burgers. I mean\nits GINORMOUS. My friend wasn’t even able to attempt to eat this with her hands.\nBut oh was it delicious.\n\n\n\nDon’t get me started on their garlic-cilantro fries. Frita Batidos has some of\nthe simplest yet most amazing fries I’ve had. I can’t even describe them, you\nhave to try them yourself!\n\n\n\nIf you are ever in Ann Arbor MAKE SURE  you head to downtown to taste one of\nthese monstrosities, these glorious monstrosities of Frita Batidos.\n\nCheck them out [http://www.fritabatidos.com]!","feature_image":"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c263","name":"frita batidos","slug":"frita-batidos"},{"id":"5c47a6f22037ef002282c264","name":"burgers","slug":"burgers"},{"id":"5c47a6f22037ef002282c265","name":"cuban","slug":"cuban"},{"id":"5c47a6f22037ef002282c266","name":"garlic","slug":"garlic"}]}}]}},"pageContext":{"limit":6,"skip":42,"numPages":10,"currentPage":8}}