{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37f","uuid":"eaed4c13-ea2f-4325-9310-725d55d2c0ea","title":"Scrambled","slug":"scrambled-tofu","published_at":"18 April, 2016","plaintext":"My brain feels scrambled. I've thrown all sorts of information in there and\ngiven it a good shake, and things are tumbling about pretty wildly right now.\n\nExam season is upon me, and I am not bearing up well under the stress. Just\ndon't ask me how many hot Cheetos I've consumed, because that could get super\nembarrassing super fast. My food consumption these days in 50% leftovers, 30%\neggs, 10% random free food, and 10% cheese, so you could say things are a bit\nmad right now.\n\nI'm so excited to finish the semester and start cooking again. In the meantime\nthough, I want to leave this recipe I made a bit ago here.\n\n\n\nI'd never made tofu scramble before, so there was quite a bit of googling\ninvolved. In the end, I came up with a recipe that hit all the right spots, and\nwas healthy to boot! I would recommend this for anyone who enjoys savory\nbreakfast, even the pledged carnivores; this tofu is delicious!\n\nTofu Scramble\nThere are two keys to making this a good recipe: (1) extremely firm tofu - the\nfirmest you can locate at the store, and (2) marinate it over night.\n\nYield: 2 servings\n\nTotal Time:  30 minutes\n\nIngredients:\nMarinade\n2 Tbsp Soy Sauce\n 2 Tbsp C Vinegar4 Tbsp Nutritional Year1 Tsp Garlic Powder1 Tsp Onion Powder\n Scramble\n1 Package Extremely Firm Tofu\n Handful of BroccoliHandful of Kale5-6 Mushrooms\n Directions:\n\n1.) Mix your marinade ingredients together, and add water if you need to so that\nit's not too thick. It should be roughly the consistency of gravy.\n\n  \n2.) Rip your tofu into bit sized chunks with forks or with your hands, and mix\nthe marinade into the tofu. Set the mixture in the fridge overnight.\n\n  \n3.) Chop your broccoli, kale, and mushrooms, and cook your veg - broccoli, then\nkale and mushrooms together. Be sure to add some salt and spices to the\nvegetables!\n\n  \n4.) When the vegetables are half cooked, create a space, and pour your tofu\nscramble in. Let it cook for a few minutes, 5-7 should be just enough.\n\n  \n5.) Pour into a bowl with some hashbrowns and enjoy!    </p>\n  </div>\n</div>","feature_image":"https://pramods.box.com/shared/static/tj5saknljx5vewphutanvgu2he6w75gg.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c313","name":"savory","slug":"savory"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c319","name":"scramble","slug":"scramble"},{"id":"5c47a6f22037ef002282c31a","name":"noms","slug":"noms"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c359","uuid":"a15671eb-987c-4a1e-b6cb-d2b26eff884a","title":"Netflix and Chilaquiles","slug":"netflix-and-chilaquiles","published_at":"20 January, 2016","plaintext":"This Christmas vacation, Anagha and I were reunited for the first time in almost\na year. There are many phases of a best friend reunion, according to this \nbuzzfeed article\n[http://www.buzzfeed.com/kelseydarragh/when-your-bff-comes-to-town#.nsbQEmYJq].\nPretty much every single thing in that article happened, except in our\nfriendship instead of drinking our weight in wine, we cook. And eat.\n\nA LOT OF FOOD\n\n\n\nI'm pretty sure Anagha spent 50% of her time at my place and the other 50% at\nher own parents' house. We didn't even do anything most of the time... I would\nbe working and she would be reading at the opposite end of the table. She had\nalso never met the newest addition to my family, Miggy Pramod, who is basically\nthe most adorable dog known to man.\n\nTrue to form, they became best friends immediately.\n\n\n\nSeriously though, who couldn't love a weirdo that sleeps like this regularly?\n\n\n\nJust look at him.\n\n\n\nThis past August, my dad decided that my mom's birthday gift would be to finally\nget a puppy. My entire family, brimming with excitement, spent hours and hours\nlooking on petfinder.com and various shelter sites for the perfect little CALM\naddition to our family. After countless shelter visits and close calls with\nvarious puppies, we were extremely tired and disheartened. The process of\nfinding the perfect dog for our family had become a lot more emotionally\ndraining than we had originally thought. My mom wasn't sure if she could get\nattached to another dog and see him/her join another family. Then one day, my\nparents went to this small little animal hospital in Sterling Heights, MI and\ninstantly became smitten with, what we were told, was a little beagle mix. He\nwas an adorable 18 pound ball of affection who just wanted to play. One week\nlater, he was ready to come home.\n\n\n\nHe was a VERY little 5 month old puppy. Little did we know that the tiny little\nboy that we brought home was a little more German Shepherd than Beagle.\nCurrently, Miggy is a happy 40 pounds and the obsession of my entire family,\nweird sleeping positions, ear licking fetishes and all.\n\nANYWAYS putting the puppy love aside, whenever we weren't spoiling Miggles with\nnever ending attention, we were watching Netflix and eating All The Brunch. If\nit hasn't become obvious from some of our previous posts\n[http://cookinginpjs.com/brunch-conquers-all/], We LOVE  brunch. Best of all, it\nmeans that we can roll out of bed in our pajamas and enjoy some scrumptiousness\nthat we could concoct using eggs and veggies. Yay Pajamas! YAY Brunch!\n\nThen, it's time for a relaxing, vacation time food coma. There's that one\nepisode of friends where Joey and Ross discover that they are each other's best\nnap buddies. Exactly. Who DOESN'T  want a nap buddy and best of all your best\nfriend?! So we spent most of our afternoons watching Netflix and chilling (no\nnot like that you perv!) but literally watching Netflix reruns and napping with\nmy puppy.\n\nBest. Break. Ever.\n\n\n\nWe also love Mexican food. No explanation needed. It's just the best. So\nOBVIOUSLY nothing could be better than combining the two things we are always\ncraving. In came chilaquiles.\n\nI've had varieties of chilaquiles in the past. From the beaches of Cancun to the\nstreets of San Francisco and San Diego. Everywhere, they put their own spin on\nthe classic Mexican dish. Traditionally it's kept very simple with just fried\ntortillas, salsa, egg, and beans (and/or meat). California, on the other hand,\ntends to add avocado to everything so it's very colorful. Our variation probably\nincludes WAY more vegetables than most but I love it and it tasted delicious.\n\n\n\n\n\n\n\n\n\nChilaquiles\nIngredients:\n1 bottle Salsa Verde\n[http://www.lavictoria.com/products/salsa/thickn-chunky-salsa-verde-medium/]\n 1 bag tortilla chips\n 1 can black beans\n Sumedha's Super Secret Fajita Seasoning\n[http://cookinginpjs.com/estoy-cantando/]\n 1 avocado cubed\n 1 egg per person\n sour cream\n cheese (shredded or Cotija)\n chopping cilantro to garnish\n Pico De Gallo Salsa\n2 roma tomatoes\n 1/2 onion diced\n 1/4 cup chopped cilantro\n lemon juice to taste\n salt to taste\n Corn Salsa\n1 can sweet corn kernels\n 4 sliced jalapeños (more or less based on your spice tolerance)\n lemon juice to taste\n salt to taste\n Directions:\nPut two handfuls of tortilla chips in a pan and cover with the salsa verde. Let\nthe chips soak on low-medium heat while completing the remaining steps. Make\nsure to stir occasionally so all of the chips are covered in salsa\n\nCook the beans with as much of Sumedha's Super Secret Fajita Seasoning as you\nlike. For each salsa, combine the ingredients in a bowl and keep to the side.\n\nWhen the beans are almost done, make one sunny side up egg for each person. You\nare more than welcome to scramble them if you don't like runny eggs.\n\nSpread the soaked tortilla chips on each plate. Layer the beans, egg, salsas,\navocado, cheese, sour cream and cilantro on top of the chips. Grab your fork and\nknife and let the egg yolk flow. ;)","feature_image":"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg","tags":[{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2b9","name":"chilaquiles","slug":"chilaquiles"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ba","name":"reunion","slug":"reunion"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c2bf","name":"naps","slug":"naps"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c365","uuid":"4f72efc4-4172-4a09-a4ad-9aa43784c7d8","title":"Well Son, When a Croissant Loves a Donut...","slug":"well-son-when-a-croissant-loves-a-donut","published_at":"27 June, 2015","plaintext":"\n\n(Here's some music for inspiration :P)\n\nIn 2013, New York was swept over with a new kind of fever.... Cronut Fever. A\nchef in New York City decided that he would take croissant dough and fry it like\na donut. This scrumptious flaky dessert became SO  popular that there was even a\nblack market for them! People would pay $100 on the black market for a cronut\nthat could be bought for $5 if they waited in line for a day.\n\nI'd never tasted a cronut before in my life, so I decided to make use of a bunch\nof stale croissants I had lying around after a road trip. I tore the croissants\ninto bite size pieces and fried them in hot oil and count to 4. Quickly flip\neach cronut and fry again for 4 counts. Make sure not to cook them for too long\nor they get a little too crunchy and burn.\n\n\n\nPlace the fried bites onto paper towels to drain any excess oil. When cooled,\ndrizzle with any icing of your choice or enjoy them by themselves!\n\nThey were flaky yet crunchy, salty yet buttery. It was amazing! I completely\nunderstand what the fuss was in New York City at the time.\n\n\n\n\n\nHowever, I learned a few things while making these. Making them with\nstore-bought croissants is fine, however you get the proper ratio of flakiness\nto fried crunchiness when you use croissant dough. It is also easier not to burn\nthem while frying when you use dough. I am not a huge fan of too much oil, so\nfrying the croissants wasn't my favorite. Maybe there's a way to shallow fry\nthem where they won't pick up too much oil, but I have no idea. Next time I try\nmaking cronut bites, I will try to bake store-bought croissants and see if that\nmakes a difference. Who knows!\n\nFor the mean time, I completely suggest you try making these at home! They're\nsimple to make and taste amazing! If you're too lazy then I'd recommend going to\nyour local pastry shop and seeing if they make something similar!","feature_image":"https://lh3.googleusercontent.com/I3bLdLcbLHBZH2QIeDqAX55etYu-5I1Tz94-7LJ62KRW=s800","tags":[{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c283","name":"cronut","slug":"cronut"},{"id":"5c47a6f22037ef002282c284","name":"fried","slug":"fried"},{"id":"5c47a6f22037ef002282c285","name":"croissant","slug":"croissant"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c383","uuid":"64999048-482e-4f3b-9b9b-dc46e14cb5c8","title":"Brunch Conquers All","slug":"brunch-conquers-all","published_at":"14 February, 2015","plaintext":"\n\nWhen I was younger, my family rarely did breakfast all together; on weekdays we\nwere all rushing around, and on weekends we would all emerge from our rooms at\nour own times, grazing on whatever acceptable breakfast food was around. For\nmany years, breakfast on Saturday meant spending the entire morning alone on the\ncouch, watching cartoons, dodging my mother's attempts to make me a productive\ncitizen, and eating sugary cereal with abandon. Occasionally, we would have\nguests and my mother would cook some traditional Indian breakfast items - dosa,\nroti, upma, etc. - and we would have brunch. But these days were usually paired\nwith pre and post cleaning and formal clothing, so while we loved the company,\nthe whole situation was no bueno.\n\nIt wasn't until I got to college that I really understood brunch. On our campus,\nLandon dining hall had the most amazing brunch you can imagine - everything from\nice cream to omelettes to fresh fruit and berries was represented, and you could\nliterally eat your heart out. In addition to that, we lived in close proximity\nto Golden Harvest, a small brunch area in Lansing that has a following that\nborders on obsessive. In East Lansing, brunch does not just pass you by, and\nfrom the minute I stepped into Landon, with a slight headache and stomache,\ncraving grease and comfort food, I was a convert.\n\n\n\nBrunch is neither breakfast nor lunch; it's an in between meal, and as such,\ndoesn't have the conventions of the other two. You can enjoy some giggle juice\nwith brunch. You can dip strawberries in chocolate and throw it on a waffle with\nsugar and it won't count as dessert. You can show up all smelly at your best\nfriend's house at eleven o'clock, post late wake up call and workout, demand\neggs, toast, and avocados, and call THAT brunch.\n\nYou can wake up at eight AM and race to Golden Harvest, wait in line for over an\nhour and a half in the freezing cold, and earn your brunch. Or you can have a\nlie in at home and make yourself some waffles or toast and watch television, and\nit could be the most lovely brunch you'll ever have.\n\n\n\nBrunch is the most welcoming of the meals.\n\nBrunch is patient, brunch is kind. It does not envy, it does not boast, it is\nnot proud. It is not rude, it is not self-seeking, it is not easily angered, it\nkeeps no record of wrongs. Brunch does not delight in evil but rejoices with the\ntruth. It always protects, always trusts, always hopes, always perseveres.\nBrunch never fails.*\n\nBrunch is love, y'all. Show someone a little love and pan fry some potatoes and\nthrow a poached egg on top. Give yourself a little treat and stick an overeasy\nfried egg in a sandwhich with some mixed greens and tomatoes. Use avocado\nliberally, and consider experimenting with sriracha and truffle oil. Kale and\nwhite sugar are both invited to this party, because brunch does not\ndiscriminate.\n\nLet your creative juices and chocolate sauce flow; brunch is a meal without\nprotocol or limitations, and you definitely deserve that business in your life.\n\n\n\n*I took some creative licenses with Corinthians 13:4-8a. I did it with utmost\nrespect for the original verse.","feature_image":"https://farm6.staticflickr.com/5612/15837068312_eeff7d20e1_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c23b","name":"eggs","slug":"eggs"},{"id":"5c47a6f22037ef002282c23c","name":"hash","slug":"hash"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23e","name":"sandwich","slug":"sandwich"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c24e","name":"love","slug":"love"},{"id":"5c47a6f22037ef002282c2a4","name":"valentines day","slug":"valentines-day"}]}}]}},"pageContext":{"slug":"breakfast","limit":6,"skip":0,"numPages":1,"currentPage":1}}