{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c377","uuid":"5ebea30f-90a4-4799-b90f-666b7ffe5d0a","title":"It's about \"Pho\"-king time!","url":"https://cookinginpjs.herokuapp.com/its-about-pho-king-time/","published_at":"31 January, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7484/15215553514_6e88dc3524_b.jpg\" alt=\"\"></p>\n<p>Before 2 summers ago, I had never experienced Pho. Once I tasted it, I knew that I had been missing out on something delicious my entire life. Pho is a simple vietnamese noodle soup. Traditionally, it is made with beef or chicken with some meat broth, which gives it its rich flavor. However we found a vegetarian way of mimicking the flavor! There's a great recipe <a href=\"http://ohmyveggies.com/30-minute-vegetarian-pho/\">here</a> that also had some great flavors.</p>\n<p>Pho works best if you have fresh bean sprouts, jalapenos, and basil. When you drop these into your soup, it brings out the most amazing flavors. I also chopped some onions, cilantro and some green onions for a little something extra.</p>\n<p><img src=\"https://farm8.staticflickr.com/7549/15215550764_63933ed924_b.jpg\" alt=\"\"></p>\n<p>The first step in the process is preparing the stock. My mom and I made a vegetable stock using celery, carrots, and onions among other things. All you need to do is simmer vegetables and herbs in a pot and after 30-40 minutes it should be done! You can also use store bought stock, as that is likely far less labor intensive! If you don't mind chicken or beef broth, feel free to use one of those instead and add some cooked shredded chicken or beef too.</p>\n<p>Next, you want to prepare your noodles - you can buy premade rice noodles, or get dry noodles and cook them yourself. But be careful; if they come pre-cooked and packaged they may be extremely fragile and broken. This is what happened to me, as you can see from my pictures. Ideally, the noodles shouldn't break the minute you pick them up with your chopsticks.</p>\n<p><img src=\"https://farm8.staticflickr.com/7513/15650093948_27967e5c09_b.jpg\" alt=\"\"></p>\n<p>Now all that's left for you to do is to pour yourself a bowl of hot broth, toss some noodles, vegetables and garnishes and top it off with some sauces. Personally, I just use a little hoisin sauce and chili garlic sauce but feel free to add soy sauce, sriracha, basically anything you want! The best part about Pho is that it can be easily modified to suit each individual's taste!</p>\n<p>If you haven't already, drop everything you're doing, go to the nearest Vietnamese restaurant and dive into a HUGE bowl of Pho!</p>\n<p><img src=\"https://farm6.staticflickr.com/5615/15837085352_70e3c9fa9c_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7551/15811883866_29a5cdf02b_b.jpg\" alt=\"\"></p>\n","feature_image":"https://farm6.staticflickr.com/5615/15837085352_70e3c9fa9c_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c236","name":"pho","slug":"pho"}]}}]}},"pageContext":{"slug":"pho","limit":6,"skip":0,"numPages":1,"currentPage":1}}