{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c375","uuid":"1afdf9c1-368f-4d78-acab-73f49594829c","title":"Tere Ghar Ke Samne, Khana Banaunga","slug":"tere-ghar-ke-samne-khana-banaunga","published_at":"04 February, 2016","plaintext":"Why this song you may ask? While growing up my mom always used to sing this song\nto me. The song literally translates to \"I'm going to build a house in front of\nyour house.\" It's supposed to be this cute love song where the guy wants to\n\"build his world in front of her house.\" My question is, wouldn't it be more\nromantic if he built a house FOR them WITH her? Why does he only want to be in\nfront of her house? I may be missing some context from the rest of the movie but\nregardless that's a whole different tangent.\n\nThis song was pretty much just my mom telling me she wants to live right across\nthe street from my and constantly spoil her future grandchildren. I'm pretty\nsure my mom wanted a full on re-enactment of \"Everybody loves Raymond.\" But hey,\nwho's gonna complain about a free babysitter and delicious food? :P\n\n**Love you Amma! \n\n(While you're at it, you should also check out her blog here\n[http://uppukhara.com]! It's basically every recipe she made for me growing up\nthat I have random cravings for since I've moved out to California.)\n\nSometimes I feel like I'm not a complete adult yet. Even though I'm currently\nsupporting myself, paying my own bills, taxes, and insurance, I don't always\nfeel like a \"real\" adult. Then, there are times when suddenly I feel like a full\non housewife, which is something I NEVER EVER want to be.\n\nOne such instance was this past weekend, when I was anxiously awaiting the\narrival of my new electric pressure cooker. One thing I'm sure  every child\ngrowing up in an Indian household can relate to, is the sound of a pressure\ncooker. That sound TERRIFIED me to my core throughout my childhood, and to this\nday. I always feel like something somewhere is going to explode. Even in college\nwhen my roommate decided to make dal and turned on the pressure cooker, we used\nto hide behind our bedroom doors waiting for it to go off enough times so could\nturn it off and continue hiding. You'd think that it wouldn't be worth the fear,\nbut honestly have you ever had dal or even better, Bangalore-style saaru? Yea,\nit's worth it. (If you're wondering what that is, it's a less liquidy and better\nversion of rasam with more dal in it). I've tried all sorts of cooking\ntechniques, but saaru just doesn't taste quite the same unless you use a\npressure cooker. And this way, you don't end up wasting hours and hours making\nyour meal. THAT is not worth it.\n\nThe sound of our pressure cooker is even worse for our dog because he can hear\nthe noise WAY before we can. He panics and runs all the way up the stairs and\ncowers near my parent's bedroom door. This happens without fail every time my\nmom STARTS the pressure cooker. He knows it's coming and refuses to come down\nfrom his hiding spot until he's completely sure it's not going to go off again.\nPoor baby. But I'm sure you'll all realize why once you get your own pressure\ncookers!\n\n\n\nBut AHA! What is this?! An ELECTRIC pressure cooker? What is this magical\ndevice? So quiet and effective? Truly this can't be real! But miraculously, IT\nIS!\n\n\n\nI've never been so excited for any adult purchase in my life, except maybe  my\ncar. This was a glorious purchase. NOT ONLY can it make dal in 4 minutes, but I\ncan use it to make dahi (yogurt or curds generally eaten with indian food),\nrice, and basically anything else in life I could ever think of! ALL WITHOUT\nMAKING A SOUND! I didn't even realize it had even started and it made a beeping\nnoise indicating that my food was READY! It's wonderful.\n\nAmidst all this excitement over the pressure cooker, I got kind of homesick for\nmy mom's food. I then proceeded to facetime my mom for an hour while she\ncarefully explained step by step instructions on how to make one of my favorite\nchildhood dishes, Bendekai Huli or for you non-Kannada speaking people out\nthere, Okra Sambar. Most kids hate okra, but honestly it's one of my favorite\nvegetables, especially when it's in Indian food.\n\nI know this might not be the most flattering picture of any of us (mainly my\nbrother) but whatever.\n\nOne thing I will mention is that I am not sure where to get the huli pudi\n(sambar powder). My parents usually bring bags back from this little store in\nBangalore every time anyone visits, but I'm sure you can find something similar\nin local Indian stores. I mean, I know I couldn't live without sambar so I'm\nsure there are other people who feel the same way and have found a way! There\nare also instant mixes available at the Indian store - while these aren't quite\nas good, they can satisfy the occasional craving!\n\nNow that you've learned a little bit of Kannada, and hopefully are as excited as\nI was, let's begin!\n\n\n\nOkra Sambar or Bendekai Huli\nI'm giving these instructions based on my electric pressure cooker. You may have\nto adjust the dal portion of the recipe according to however you make it.\nPressure cookers scare the bejesus out of me so be careful!\n\nIngredients:\nDal\n1 cup toor dal\n 1/2-3/4 tsp turmeric powder\n 2 1/2 cup water\n Sambar\noil\n 1/2-3/4 tsp mustard seeds\n 1 small package frozen okra\n 1/2-3/4 tsp tamarind paste\n 1 1/2 spoons huli powder (sambar powder)\n water\n Directions:\nAdd the toor dal to your pressure cooker and rinse. Add the water and turmeric\nand turn on the pressure cooker. I did the Manual setting for 4 minutes. Also\nmake sure its set to low pressure and all the pieces are in place. When the\npressure cooker was done it went into keep warm (displayed \"L00:00\") and started\ncounting up. I unplugged it and let it release the pressure on its own.\n\nIn a pot, add some oil and mustard seeds on medium heat, this is called vagarne.\nWhen the mustard seeds start popping, add the frozen okra. When the okra starts\nto get kinda sticky and stringy, add the tamarind paste and a little bit of\nwater. Keep cooking and mixing the okra occasionally until it is cooked through.\n\n![](https://pramods.box.com/shared/static/uq45bcrldnses3q369jmzcs1v1srqmqv.jpg)\n Add huli powder and salt to taste and let it come to a boil. Add the dal and\nmore water until it's the right consistency. Taste it as you go. I needed to add\na little more tamarind paste and huli powder to fit my taste but that depends\nperson to person.\n\nLet it cook for a few minutes and enjoy!","feature_image":"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c297","name":"mom","slug":"mom"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2d1","name":"pressure cooker","slug":"pressure-cooker"},{"id":"5c47a6f22037ef002282c2d2","name":"crock pot","slug":"crock-pot"},{"id":"5c47a6f22037ef002282c2d3","name":"okra","slug":"okra"},{"id":"5c47a6f22037ef002282c2d4","name":"sambar","slug":"sambar"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c359","uuid":"a15671eb-987c-4a1e-b6cb-d2b26eff884a","title":"Netflix and Chilaquiles","slug":"netflix-and-chilaquiles","published_at":"20 January, 2016","plaintext":"This Christmas vacation, Anagha and I were reunited for the first time in almost\na year. There are many phases of a best friend reunion, according to this \nbuzzfeed article\n[http://www.buzzfeed.com/kelseydarragh/when-your-bff-comes-to-town#.nsbQEmYJq].\nPretty much every single thing in that article happened, except in our\nfriendship instead of drinking our weight in wine, we cook. And eat.\n\nA LOT OF FOOD\n\n\n\nI'm pretty sure Anagha spent 50% of her time at my place and the other 50% at\nher own parents' house. We didn't even do anything most of the time... I would\nbe working and she would be reading at the opposite end of the table. She had\nalso never met the newest addition to my family, Miggy Pramod, who is basically\nthe most adorable dog known to man.\n\nTrue to form, they became best friends immediately.\n\n\n\nSeriously though, who couldn't love a weirdo that sleeps like this regularly?\n\n\n\nJust look at him.\n\n\n\nThis past August, my dad decided that my mom's birthday gift would be to finally\nget a puppy. My entire family, brimming with excitement, spent hours and hours\nlooking on petfinder.com and various shelter sites for the perfect little CALM\naddition to our family. After countless shelter visits and close calls with\nvarious puppies, we were extremely tired and disheartened. The process of\nfinding the perfect dog for our family had become a lot more emotionally\ndraining than we had originally thought. My mom wasn't sure if she could get\nattached to another dog and see him/her join another family. Then one day, my\nparents went to this small little animal hospital in Sterling Heights, MI and\ninstantly became smitten with, what we were told, was a little beagle mix. He\nwas an adorable 18 pound ball of affection who just wanted to play. One week\nlater, he was ready to come home.\n\n\n\nHe was a VERY little 5 month old puppy. Little did we know that the tiny little\nboy that we brought home was a little more German Shepherd than Beagle.\nCurrently, Miggy is a happy 40 pounds and the obsession of my entire family,\nweird sleeping positions, ear licking fetishes and all.\n\nANYWAYS putting the puppy love aside, whenever we weren't spoiling Miggles with\nnever ending attention, we were watching Netflix and eating All The Brunch. If\nit hasn't become obvious from some of our previous posts\n[http://cookinginpjs.com/brunch-conquers-all/], We LOVE  brunch. Best of all, it\nmeans that we can roll out of bed in our pajamas and enjoy some scrumptiousness\nthat we could concoct using eggs and veggies. Yay Pajamas! YAY Brunch!\n\nThen, it's time for a relaxing, vacation time food coma. There's that one\nepisode of friends where Joey and Ross discover that they are each other's best\nnap buddies. Exactly. Who DOESN'T  want a nap buddy and best of all your best\nfriend?! So we spent most of our afternoons watching Netflix and chilling (no\nnot like that you perv!) but literally watching Netflix reruns and napping with\nmy puppy.\n\nBest. Break. Ever.\n\n\n\nWe also love Mexican food. No explanation needed. It's just the best. So\nOBVIOUSLY nothing could be better than combining the two things we are always\ncraving. In came chilaquiles.\n\nI've had varieties of chilaquiles in the past. From the beaches of Cancun to the\nstreets of San Francisco and San Diego. Everywhere, they put their own spin on\nthe classic Mexican dish. Traditionally it's kept very simple with just fried\ntortillas, salsa, egg, and beans (and/or meat). California, on the other hand,\ntends to add avocado to everything so it's very colorful. Our variation probably\nincludes WAY more vegetables than most but I love it and it tasted delicious.\n\n\n\n\n\n\n\n\n\nChilaquiles\nIngredients:\n1 bottle Salsa Verde\n[http://www.lavictoria.com/products/salsa/thickn-chunky-salsa-verde-medium/]\n 1 bag tortilla chips\n 1 can black beans\n Sumedha's Super Secret Fajita Seasoning\n[http://cookinginpjs.com/estoy-cantando/]\n 1 avocado cubed\n 1 egg per person\n sour cream\n cheese (shredded or Cotija)\n chopping cilantro to garnish\n Pico De Gallo Salsa\n2 roma tomatoes\n 1/2 onion diced\n 1/4 cup chopped cilantro\n lemon juice to taste\n salt to taste\n Corn Salsa\n1 can sweet corn kernels\n 4 sliced jalapeños (more or less based on your spice tolerance)\n lemon juice to taste\n salt to taste\n Directions:\nPut two handfuls of tortilla chips in a pan and cover with the salsa verde. Let\nthe chips soak on low-medium heat while completing the remaining steps. Make\nsure to stir occasionally so all of the chips are covered in salsa\n\nCook the beans with as much of Sumedha's Super Secret Fajita Seasoning as you\nlike. For each salsa, combine the ingredients in a bowl and keep to the side.\n\nWhen the beans are almost done, make one sunny side up egg for each person. You\nare more than welcome to scramble them if you don't like runny eggs.\n\nSpread the soaked tortilla chips on each plate. Layer the beans, egg, salsas,\navocado, cheese, sour cream and cilantro on top of the chips. Grab your fork and\nknife and let the egg yolk flow. ;)","feature_image":"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg","tags":[{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2b9","name":"chilaquiles","slug":"chilaquiles"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ba","name":"reunion","slug":"reunion"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c2bf","name":"naps","slug":"naps"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"slug":"puppy","limit":6,"skip":0,"numPages":1,"currentPage":1}}