{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35c","uuid":"1ac41982-aa36-47c5-997a-8cbb575d8814","title":"Started From the Batter, Now We're Here.","slug":"started-from-the-batter-now-were-here","published_at":"28 January, 2016","plaintext":"I know. I know. The title and the song I'm telling you to listen while reading\nthis post don't match, but I felt I needed to up my Drake game a bit. Plus, now\nevery time I think of Drake, I picture him doing his little \"dance\"\n[https://youtu.be/uxpDa-c-4Mc]  over and over again. It brings me a LOT  of joy.\nI also love the SNL parody of it [https://www.youtube.com/watch?v=cjeORm4LMDk] \nbut that's not really relevant.\n\nFirst off, HAPPY NATIONAL CHOCOLATE CAKE DAY! I was not aware that this was an \nACTUAL  holiday but I'm not gonna complain. I firmly believe that everyday\nshould be National Chocolate Cake Day! But hey, I'll take one day a year.\n\nSecond, it's your lucky week! You get TWO whole posts from me! I've been sick\nsince Sunday, so I've been vegetating on my couch, watching a few too many chick\nflicks, all whilst drinking the world's supply of ginger chai (hence my\ncaffeine-fueled poem on Sunday which you should also totally read and\nappreciate) [http://cookinginpjs.com/an-ode-to-chai/].\n\nSo, let's get to it!\n\nAs the self-designated baker for my friend group, I've been baking birthday\ncakes for pretty much everyone. I've been trying to tailor each cake to\nsomething either they've specifically requested or what I think they would\nenjoy. This cake in particular was for one of my friends who loves whiskey. Her\nonly requirement was that, and I quote, \"I do not kill her.\" I took it as a\nchallenge in that I was going to put as much alcohol as possible in the cake\nwhile retaining its ability to taste good.\n\nThree things happened with this:\n\n 1. I made a deliciously boozy cake\n 2. I finished a LOT of the whiskey bottle I bought for this very specific\n    purpose.\n 3. I ended up getting fairly tipsy after a few batter taste tests\n\nI also feel like I should include a warning: raw batter means raw eggs which\nalso means the potential for salmonella. So be careful not to eat spoonfuls of\nyour cake batter! That could get you very sick. Enjoy responsibly ;)\n\nHonestly, I'd say it was a completely successful experience. I totally recommend\nmaking boozy desserts to everyone (of legal age of course). :P Just don't expect\nto be productive after you put the cake in the oven. I had absolutely no\nattention span once I set that cake to bake. I ended up making one GIANT cake\nfor my friend, another little one for the rest of us to enjoy on our own, and a\nfew cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the\ncupcakes were gone within 20 minutes of me sending an email announcing the\narrival of whiskey cupcakes. I'm now officially known as the dessert lady at\nwork.\n\n\n\nChocolate Whiskey Cake\nFeel free to increase/decrease the amount of whiskey according to your\ntaste/tolerance. Just make sure to adjust the flour accordingly so your cake\nbatter isn't too liquidy. The general rule is for each extra tablespoon of\nWhiskey that you add, add an extra 2 tablespoons of flour to compensate.\n\nIngredients:\n2 1/2 cups flour\n 3/4 cups dark cocoa powder\n 2 cups granulated sugar\n 2 tsp baking soda\n 1 tsp baking powder\n 1 tsp salt\n 2 large eggs\n 1/2 cup strong black coffee (chilled)\n 1 cup whiskey\n 1 cup buttermilk\n 1/2 cup vegetable oil\n Directions:\nIf your coffee isn't chilled, then make sure to put it in your freezer to speed\nup that process. Otherwise the eggs will cook when you add the coffee to it. Set\nyour oven to preheat at 350 degrees.\n\nWhisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the\ncoffee is chilled, whisk that in as well.\n\nIn a separate bowl, stir the flour, cocoa powder, baking soda, baking powder,\nand salt together. Slowly pour the wet ingredients into the bowl with all the\ndry ingredients. Make sure to keep stirring while you pour.\n\nWhisk until smooth. Taste to make sure the whiskey level is right. If not add\nmore whiskey/flour accordingly.\n\nSpray your cake pan (or place cupcake liners in your cupcake pan if you're\nmaking cupcakes) and pour in the batter. Set your timer for about 25-30 minutes\n(or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick\n(something that can reach fairly deep inside the cake). If it comes out clean,\nyou're done! Cool the cake in the pan for 15 minutes, frost and devour!\n\nI did get lazy when it came to the frosting and just bought some chocolate\nfrosting from the store. I felt it might be a little TOO much if I spiked that\ntoo, so I just spread shit tons of frosting on top of the cake/cupcakes and ate\nit. I'd say that was the better choice! If you're going easy on the whiskey\ninside the cake itself (or in the words of my friend, \"are being a little\nbitch\"), then maybe you can spike the frosting. Otherwise you've got enough\nalcohol in there to get the deed done.\n\nYes. You know you needed all these gifs right now. Don't lie to yourself. I'm\npretty sure I just stared at this gif collection for a good 5 minutes, at least.\nYou're welcome.","feature_image":"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c376","uuid":"20792daa-31be-4587-acd6-d7f7951d8b6d","title":"An Ode to Chai","slug":"an-ode-to-chai","published_at":"25 January, 2016","plaintext":"There are some days where all you want to do is vegetate on your couch with your\nstuffed penguin, some Netflix and chai. Today is one of those days.\n\n\n\nFor the days of exhaust.\nFor the days of woe.\nFor the days of rain\nAnd those few in a row.The magical potion,\nWhich may many amaze,\nSimple preparation,\nPowerful result.\n\nA hint of ginger,\nA drop of milk,\nA spoonful of sugar,\nAnd sore throat no more.\n\nWhat magical mystical wonder is this?\nOh? You didn't you hear?\nJust some simple and plain and regular tea!\n\nSide note: this may have been inspired by one too many cups of ginger chai. I\nmay have a problem.","feature_image":"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg","tags":[{"id":"5c47a6f22037ef002282c2a2","name":"chai","slug":"chai"},{"id":"5c47a6f22037ef002282c2c0","name":"drinks","slug":"drinks"},{"id":"5c47a6f22037ef002282c2c1","name":"tea","slug":"tea"},{"id":"5c47a6f22037ef002282c2c2","name":"ginger","slug":"ginger"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c359","uuid":"a15671eb-987c-4a1e-b6cb-d2b26eff884a","title":"Netflix and Chilaquiles","slug":"netflix-and-chilaquiles","published_at":"20 January, 2016","plaintext":"This Christmas vacation, Anagha and I were reunited for the first time in almost\na year. There are many phases of a best friend reunion, according to this \nbuzzfeed article\n[http://www.buzzfeed.com/kelseydarragh/when-your-bff-comes-to-town#.nsbQEmYJq].\nPretty much every single thing in that article happened, except in our\nfriendship instead of drinking our weight in wine, we cook. And eat.\n\nA LOT OF FOOD\n\n\n\nI'm pretty sure Anagha spent 50% of her time at my place and the other 50% at\nher own parents' house. We didn't even do anything most of the time... I would\nbe working and she would be reading at the opposite end of the table. She had\nalso never met the newest addition to my family, Miggy Pramod, who is basically\nthe most adorable dog known to man.\n\nTrue to form, they became best friends immediately.\n\n\n\nSeriously though, who couldn't love a weirdo that sleeps like this regularly?\n\n\n\nJust look at him.\n\n\n\nThis past August, my dad decided that my mom's birthday gift would be to finally\nget a puppy. My entire family, brimming with excitement, spent hours and hours\nlooking on petfinder.com and various shelter sites for the perfect little CALM\naddition to our family. After countless shelter visits and close calls with\nvarious puppies, we were extremely tired and disheartened. The process of\nfinding the perfect dog for our family had become a lot more emotionally\ndraining than we had originally thought. My mom wasn't sure if she could get\nattached to another dog and see him/her join another family. Then one day, my\nparents went to this small little animal hospital in Sterling Heights, MI and\ninstantly became smitten with, what we were told, was a little beagle mix. He\nwas an adorable 18 pound ball of affection who just wanted to play. One week\nlater, he was ready to come home.\n\n\n\nHe was a VERY little 5 month old puppy. Little did we know that the tiny little\nboy that we brought home was a little more German Shepherd than Beagle.\nCurrently, Miggy is a happy 40 pounds and the obsession of my entire family,\nweird sleeping positions, ear licking fetishes and all.\n\nANYWAYS putting the puppy love aside, whenever we weren't spoiling Miggles with\nnever ending attention, we were watching Netflix and eating All The Brunch. If\nit hasn't become obvious from some of our previous posts\n[http://cookinginpjs.com/brunch-conquers-all/], We LOVE  brunch. Best of all, it\nmeans that we can roll out of bed in our pajamas and enjoy some scrumptiousness\nthat we could concoct using eggs and veggies. Yay Pajamas! YAY Brunch!\n\nThen, it's time for a relaxing, vacation time food coma. There's that one\nepisode of friends where Joey and Ross discover that they are each other's best\nnap buddies. Exactly. Who DOESN'T  want a nap buddy and best of all your best\nfriend?! So we spent most of our afternoons watching Netflix and chilling (no\nnot like that you perv!) but literally watching Netflix reruns and napping with\nmy puppy.\n\nBest. Break. Ever.\n\n\n\nWe also love Mexican food. No explanation needed. It's just the best. So\nOBVIOUSLY nothing could be better than combining the two things we are always\ncraving. In came chilaquiles.\n\nI've had varieties of chilaquiles in the past. From the beaches of Cancun to the\nstreets of San Francisco and San Diego. Everywhere, they put their own spin on\nthe classic Mexican dish. Traditionally it's kept very simple with just fried\ntortillas, salsa, egg, and beans (and/or meat). California, on the other hand,\ntends to add avocado to everything so it's very colorful. Our variation probably\nincludes WAY more vegetables than most but I love it and it tasted delicious.\n\n\n\n\n\n\n\n\n\nChilaquiles\nIngredients:\n1 bottle Salsa Verde\n[http://www.lavictoria.com/products/salsa/thickn-chunky-salsa-verde-medium/]\n 1 bag tortilla chips\n 1 can black beans\n Sumedha's Super Secret Fajita Seasoning\n[http://cookinginpjs.com/estoy-cantando/]\n 1 avocado cubed\n 1 egg per person\n sour cream\n cheese (shredded or Cotija)\n chopping cilantro to garnish\n Pico De Gallo Salsa\n2 roma tomatoes\n 1/2 onion diced\n 1/4 cup chopped cilantro\n lemon juice to taste\n salt to taste\n Corn Salsa\n1 can sweet corn kernels\n 4 sliced jalapeños (more or less based on your spice tolerance)\n lemon juice to taste\n salt to taste\n Directions:\nPut two handfuls of tortilla chips in a pan and cover with the salsa verde. Let\nthe chips soak on low-medium heat while completing the remaining steps. Make\nsure to stir occasionally so all of the chips are covered in salsa\n\nCook the beans with as much of Sumedha's Super Secret Fajita Seasoning as you\nlike. For each salsa, combine the ingredients in a bowl and keep to the side.\n\nWhen the beans are almost done, make one sunny side up egg for each person. You\nare more than welcome to scramble them if you don't like runny eggs.\n\nSpread the soaked tortilla chips on each plate. Layer the beans, egg, salsas,\navocado, cheese, sour cream and cilantro on top of the chips. Grab your fork and\nknife and let the egg yolk flow. ;)","feature_image":"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg","tags":[{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2b9","name":"chilaquiles","slug":"chilaquiles"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ba","name":"reunion","slug":"reunion"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c2bf","name":"naps","slug":"naps"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c357","uuid":"37a98e77-e446-4f06-bbf8-6fbc1677f180","title":"The only thing weird would be if someone didn't like Mexican food, because I'm making FAJITAS!!","slug":"im-making-fajitas","published_at":"14 January, 2016","plaintext":"We all love Ross. Despite his many divorces and nerdy dinosaur quirks, Dr.\nGellar (no not that kind of doctor) was one of my favorite characters on\nFriends. Every time I make fajitas I remember Ross absolutely \"NOT\" being weird\nabout Joey and Rachel starting to go out. One of the most classic Ross moments\non the show.\n\n\n\nI was in India when Netflix released all ten seasons of Friends.\n\nALL. TEN. SEASONS. EASILY. ACCESSIBLE. ON. THE. INTERNET.\n\nThis was huge. I can't even begin to count the endless number of illegally\nuploaded episodes I've watched on YouTube with Spanish subtitles. I ended up\nlearning various inappropriate words through context. Made for some fun giggles\nduring Spanish class.\n\nWhile I was searching a mood song for this post, I stumbled onto this gem. It's\nso weird that it HAD to make it into the post.\n\nBack to the point. So this January when I was in India, my cousin had major\ncravings for Mexican food. We decided to enhance our existing Galentine's Day\nplans from just red velvet cupcakes\n[http://cookinginpjs.com/galentines-day-cupcakes/]  to include some simple yet\ndelicious Mexican food.\n\nA lot of the parts of this recipe have already been posted in other posts, so\nI'm just going to link those rather than retyping. I just sautéd a some spinach,\nbell peppers, onions, and mushrooms with my own fajita seasoning\n[http://cookinginpjs.com/estoy-cantando/]  recipe. Added some corn salsa and \nhomemade sour cream [http://cookinginpjs.com/taco-tuesday/]  and flour tortillas\n[http://cookinginpjs.com/taco-tuesday/]. All you have left to do is roll it up\nand enjoy!\n\nRecipes:\n\n * fajita seasoning [http://cookinginpjs.com/estoy-cantando/]\n * homemade sour cream & flour tortillas [http://cookinginpjs.com/taco-tuesday/]","feature_image":"https://pramods.box.com/shared/static/3chnt4gzvs3sg5exnvkiiy2q53zgqxfd.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c252","name":"fajitas","slug":"fajitas"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c29d","name":"ross","slug":"ross"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37e","uuid":"a95f8d2d-1470-4844-aa6e-784a730e7ce2","title":"Estoy Cantando","slug":"estoy-cantando","published_at":"06 January, 2016","plaintext":"\n\nAnyone who has had the honor  of being in my presence this week knows that I've\nbeen playing one song on repeat. One song. All week. Why you may ask?\nDUH...BECAUSE IT'S AMAZING.\n\n(Now's when you play this song and dance along while finishing to read this\npost.)\n\nMy brother was visiting me for a week and I quickly realized 1) apparently no\none comes to work during the holidays in my office, meaning sub-par lunches and\ndinners all week and 2) I hadn't done groceries in weeks, meaning I didn't have\nanything to feed the kid while he was staying with me. Being the ever so\nresponsible adult that I am, I decided that I could muster enough patience to\ncook lunches and dinners for my brother a few times, or at least while I was\nworking from home. We braved it out to a farmers market and brought back a\ncollection of various vegetables without any idea of what to make. While\nbrainstorming ideas my brother decided that since he was spending a week in\nCalifornia, he was going to try and eat Mexican food for each and every meal.\n\nMy next step was to figure out what kind of Mexican dish to make when all I had\nbought was stir fry vegetables. Voilà! MEXICAN \"STIR FRY\"! Or I guess as normal\npeople call it... TOSTADA BOWLS!\n\n\n\nThere's not really a recipe for this post because honestly I kind of made it up\non the spot. BUT I can give you some bits and pieces of what went in this so you\ncan make your own variation of this dish at home! (I KNOW, how sweet of me.)\n\nThis dish is essentially a layer of cilantro lime rice, refried beans,\nvegetables sautéd fajita style, salmon (totally optional and honestly kinda\nruined the dish for me, my brother's vegetarian one was on point), guacamole,\nsour cream and cotija cheese a.k.a. fancy Mexican cheese. Plus you can throw\nsome chopped green onions on top to make it look all pretty and fancy.\n\n\n\nI've always loved making Mexican food. It's so flavorful and deliciously\nrewarding every time! Every single part of a burrito/taco/bowl is overflowing\nwith unique tastes that seem extremely complicated and intricate. I'll let you\nin on a little secret...I use the same seasoning to cook every single part of\nany Mexican dish I make. Whether it be the refried beans or fajita vegetables,\nit's all various spice levels of the same recipe. I'm sure that's not how\nauthentic Mexican food is made, but hey...mine tastes pretty damn good too.\n\nSumedha's Super Secret Fajita Seasoning\nFeel free to mess around with the proportions of each ingredient! Make as much\nor as little seasoning to go in\n\nIngredients:\n2 tsp cumin\n 1 tsp cayenne pepper\n 1 tsp paprika\n 1 tsp salt\n 1 tsp garlic powder\n Directions:\nMix it all together\n\nFor the guacamole, I generally use the recipe graciously provided by Chipotle\n[https://www.chipotle.com/guac-recipe]. Sometimes I add some cumin or replace\nthe jalapeños with cayenne pepper if I'm feeling dangerous. To go off on a\ntangent, couldn't you watch this gif of guacamole being made forever? 1) I feel\nreally bad for/impressed by the person who disrobed all those avocados and 2) I\njust want to dive into that bowl tongue first. (Excuse me while I make myself a\nbowl)\n\n\n\nSeveral minutes later\n\nThat's about it! Just sauté the vegetables of your choosing with some oil and\nfajita seasoning, heat up a can of black beans on the stove with fajita\nseasoning, whip up a bowl of guac, season some rice, and pile it all into a bowl\nfor maximum enjoyment.\n\nYUM\n\n\n\n\n\nALSO! If you haven't already check out our instagram with all sorts of\ndelectable pictures of recipes past and future! Do it! Click on the adorable\ninstagram logo!\n\n  [https://www.instagram.com/cookinginpjs/?ref=badge]","feature_image":"https://lh3.googleusercontent.com/On_C3sVekW8RNs9hpoj0MIDrJT00W5fWI7kTOe_-IafE3KppeMwwGQAH0hgHyAsyIfL0wcNPMy-hTHPG82rQYEp8TEFp7rBq798cchUmZcuhpvMACjbfBzZ-s4Rtcd1RwDYNgy3zczqZOCNIyXnMYDeYs6vp3vzsKvQ2_iof13Ye06I5qP97pXrlGz6nC5EE8M23IhTLrpxphEXlJH5eNQ3BRbRiEy7BtKmu-GQwEqzLnrysk4oHdhk_2pFU0xY_CeIhJEkOEvgt2snl16cvP-F1inJW_1D_38G0UgDDF8dFm-y95hNIYY1TYOsiTSDB2nr3jCdw4ii6utGU3k7isNNOlOSGf6sqjnBhEd-ufwL0AiQ1CU5CCle5p4-t7MNW7BTP-xSrKu_fhQPd2yshC_ZL4X2ZDrgFU5rXcJzDjfALGCGlqoO6hegUnK8XBblYqP5p0ENlI6_Tpt3GZ1VuC77PDn-SKSSvig-jqbgxU6IaUFtZwSF26m75wFdl-bwm-Qg1hIzlE8RIp1cXg2MYJwg4lj_PRxjxfZ8eWPtIkuklJI_Z2NS5MXtweiWc5EaIAbm74w=w1186-h790-no","tags":[{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2ab","name":"bowls","slug":"bowls"},{"id":"5c47a6f22037ef002282c25d","name":"stir fry","slug":"stir-fry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"slug":"sumuchallenge2016","limit":6,"skip":12,"numPages":3,"currentPage":3}}