{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c358","uuid":"9e154487-bd40-42d8-b6a9-c7b35fe895a0","title":"DAMN SON, Those are Some Seriously Loaded Fries","url":"https://cookinginpjs.herokuapp.com/damn-son-those-are-some-seriously-loaded-fries/","slug":"damn-son-those-are-some-seriously-loaded-fries","published_at":"10 March, 2015","html":"<p><img src=\"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg\" alt=\"\"></p>\n<p>For the few weeks, I've been bored at home while my parents are away at work. I've been taking some time off between graduation and when I start work next month. So when one of my friends was also bored at home during her spring break, she decided to come over and join me in being a bum for a day. And what better food to have while lazing around then some Mexican loaded fries.</p>\n<p><img src=\"https://farm9.staticflickr.com/8616/16520615948_6bcba795e9_b.jpg\" alt=\"\"></p>\n<p>Feel free to use sour cream instead of ranch or even add guacamole and other toppings you usually put on nachos! We didn't really want to leave the house and go grocery shopping, so we went with whatever was in the fridge. I usually make my own mexican seasoning, but feel free to replace the spices with a store bought seasoning if you want.</p>\n<p><img src=\"https://farm9.staticflickr.com/8585/16708189875_07f14b40ee_b.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>Mexican Loaded Fries</h2>\n    <div class=\"summary\">\n      <p><em>This is a very rough recipe. Feel free to throw in whatever you feel would taste best!</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n        <li class=\"ingredient\">½ bag of fries (I used crinkle cut)</li>\n        <li class=\"ingredient\">ranch (or sour cream)</li>\n        <li class=\"ingredient\">as much shredded cheese as you want</li>\n      \t<h4>Refried Beans</h4>\n        <li class=\"ingredient\">1 can black beans</li>\n        <li class=\"ingredient\">1½ teaspoons cumin powder</li>\n        <li class=\"ingredient\">1 teaspoon paprika</li>\n        <li class=\"ingredient\">salt to taste</li>\n        <li class=\"ingredient\">cayenne pepper to taste</li>\n        <li class=\"ingredient\">chili lime hot sauce to taste (optional)</li>\n      \t<h4>Pico De Gallo Salsa</h4>\n        <li class=\"ingredient\">3 roma tomatoes diced</li>\n        <li class=\"ingredient\">½ large onion diced</li>\n        <li class=\"ingredient\">juice of ½ a lime</li>\n        <li class=\"ingredient\">salt to taste</li>\n        <li class=\"ingredient\">few sprigs of cilantro </li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p><strong>Refried Beans:</strong> Pour the black beans onto a skillet on the stove. Add all of the spices and keep stirring until the beans are soft and are super flavorful.</p>\n        <p><strong>Salsa:</strong>Mix all the ingredients in a bowl and let it sit so that the salt and lime can bring out the flavor in the tomatoes.</p>\n        <p>Bake the fries according to the directions on the packet. When the fries are done, don't turn off the oven. Top with the bean mixture and sprinkle all the cheese that your heart desires. Bake the topped fries in the oven until the cheese has melted. Take out the fries and top with salsa and ranch. Dig in!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm9.staticflickr.com/8643/16500861107_eaf23d7f64_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8578/16706850181_8b7f0f3366_b.jpg\" alt=\"\"></p>\n","feature_image":"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","name":"salsa","slug":"salsa"},{"id":"5c47a6f22037ef002282c25f","name":"beans","slug":"beans"},{"id":"5c47a6f22037ef002282c260","name":"appetizers","slug":"appetizers"},{"id":"5c47a6f22037ef002282c261","name":"loaded","slug":"loaded"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c370","uuid":"d9ce1d74-5a37-463a-8cb8-d33efe58626f","title":"The Love Child of Pumpkin Pie and Tiramisu","url":"https://cookinginpjs.herokuapp.com/the-love-child-of-pumpkin-pie-and-tiramisu/","slug":"the-love-child-of-pumpkin-pie-and-tiramisu","published_at":"27 February, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7398/16297798177_79beaa8237_o.jpg\" alt=\"\"></p>\n<p>Thanksgiving in our house is quite different that the traditional American Thanksgiving. First off, there's no turkey. Secondly, <a href=\"http://uppukhara.com\">my mom</a> makes a glorious display of Thanksgiving inspired Indian dishes! From masala dosa with cranberry chutney to stuffing upma (or bread upit) and spicy herb yams, we always enjoy a large variety of dishes. The only thing I personally demand every year is pumpkin pie! I love pumpkin pie. The wonderful blend of spices and sweet, and yet it's not that sweet; perfect for someone without a strong sweet tooth!</p>\n<p>What do you get when you combine two of my favorite desserts in the world, pumpkin pie and tiramisu? Basically, it's one of the greatest desserts ever created by man. I was a little skeptical about how well this combination of flavors would be received by all of our thanksgiving guests, but it was a hit. Even without adding the usual brandy, rum, or amaretto, everyone loved the wonderful blend of flavors.</p>\n<p>One warning I have about this recipe is that you should be careful in blending the cornstarch mixture into the pumpkin creme. If this step is not done properly, you will have cornstarch lumps in your tiramisu and that is just gross.</p>\n<p><img src=\"https://farm8.staticflickr.com/7450/16296261980_1c317311c8_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7575/15837079972_56f32edc3e_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7532/15650090328_71473d0b07_b.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Pumpkin Tiramisu</h2>\n    <div class=\"summary\">\n      <p><em>Recipe modified from  http://www.nytimes.com/projects/well/vegetarian-recipes/#recipe/pumpkin-tiramisu</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n        <h4>Pumpkin Creme</h4>\n        <li class=\"ingredient\">⅓ cup cornstarch</li>\n        <li class=\"ingredient\">¼ cup water</li>\n        <li class=\"ingredient\">¾ cup milk</li>\n        <li class=\"ingredient\">1 (15-ounce) can pumpkin puree</li>\n        <li class=\"ingredient\">¾ cup maple syrup</li>\n        <li class=\"ingredient\">¾ teaspoon allspice</li>\n        <li class=\"ingredient\">¾ teaspoon cinnamon</li>\n        <li class=\"ingredient\">¾ teaspoon nutmeg</li>\n        <li class=\"ingredient\">½ teaspoon salt</li>\n        <h4>Tiramisu</h4>\n        <li class=\"ingredient\">1 pot black coffee</li>\n        <li class=\"ingredient\">1 package lady finger biscuits</li>\n        <li class=\"ingredient\">16oz mascarpone cheese</li>\n        <li class=\"ingredient\">ground chocolate for garnishing</li>\n      </div>\n    <!-- </div> -->\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p><strong>To make the Pumpkin Creme:</strong> In a small bowl, thoroughly mix cornstarch and water with a whisk or fork until there are <strong>NO  LUMPS</strong> and set aside. In a medium saucepan, whisk together milk, pumpkin puree, maple syrup, spices and salt, and heat over medium heat until it just begins to boil, about 5 minutes. Slowly drizzle cornstarch mixture into the saucepan, whisking continuously. Cook until the mixture becomes very thick, about 5 minutes, whisking frequently. Pour the creme into a bowl and let cool about 15 minutes. Cover the bowl with plastic wrap so that the plastic wrap is touching the top of the creme. Refrigerate for a few hours or overnight.</p><p><strong>To assemble:</strong> Soak each lady finger biscuit in coffee for a few seconds and quickly place in a large dish. Spread a layer of Pumpkin Creme on top. Repeat this process for as many layers fill up the dish or all the components run out. Alternate spreading a layer of Pumpkin Creme and mascarpone cheese between layers of biscuit.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm9.staticflickr.com/8632/16297442359_be80bb9139_b.jpg\" alt=\"\"></p>\n","feature_image":"https://farm8.staticflickr.com/7398/16297798177_79beaa8237_o.jpg","tags":[{"id":"5c47a6f22037ef002282c238","name":"tiramisu","slug":"tiramisu"},{"id":"5c47a6f22037ef002282c240","name":"pumpkin","slug":"pumpkin"},{"id":"5c47a6f22037ef002282c241","name":"thanksgiving","slug":"thanksgiving"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c383","uuid":"64999048-482e-4f3b-9b9b-dc46e14cb5c8","title":"Brunch Conquers All","url":"https://cookinginpjs.herokuapp.com/brunch-conquers-all/","slug":"brunch-conquers-all","published_at":"14 February, 2015","html":"<p><img src=\"https://farm3.staticflickr.com/2947/15238764929_dee408af1f_b.jpg\" alt=\"\"></p>\n<p>When I was younger, my family rarely did breakfast all together; on weekdays we were all rushing around, and on weekends we would all emerge from our rooms at our own times, grazing on whatever acceptable breakfast food was around. For many years, breakfast on Saturday meant spending the entire morning alone on the couch, watching cartoons, dodging my mother's attempts to make me a productive citizen, and eating sugary cereal with abandon. Occasionally, we would have guests and my mother would cook some traditional Indian breakfast items - dosa, roti, upma, etc. - and we would have brunch. But these days were usually paired with pre and post cleaning and formal clothing, so while we loved the company, the whole situation was no bueno.</p>\n<p>It wasn't until I got to college that I really understood brunch. On our campus, Landon dining hall had the most amazing brunch you can imagine - everything from ice cream to omelettes to fresh fruit and berries was represented, and you could literally eat your heart out. In addition to that, we lived in close proximity to Golden Harvest, a small brunch area in Lansing that has a following that borders on obsessive. In East Lansing, brunch does not just pass you by, and from the minute I stepped into Landon, with a slight headache and stomache, craving grease and comfort food, I was a convert.</p>\n<p><img src=\"https://farm9.staticflickr.com/8656/16296194440_27d1c24829_b.jpg\" alt=\"\"></p>\n<p>Brunch is neither breakfast nor lunch; it's an in between meal, and as such, doesn't have the conventions of the other two. You can enjoy some giggle juice with brunch. You can dip strawberries in chocolate and throw it on a waffle with sugar and it won't count as dessert. You can show up all smelly at your best friend's house at eleven o'clock, post late wake up call and workout, demand eggs, toast, and avocados, and call THAT brunch.</p>\n<p>You can wake up at eight AM and race to Golden Harvest, wait in line for over an hour and a half in the freezing cold, and earn your brunch. Or you can have a lie in at home and make yourself some waffles or toast and watch television, and it could be the most lovely brunch you'll ever have.</p>\n<p><img src=\"https://farm8.staticflickr.com/7560/15811864496_20a9e2f76e_b.jpg\" alt=\"\"></p>\n<p>Brunch is the most welcoming of the meals.</p>\n<p>Brunch is patient, brunch is kind. It does not envy, it does not boast, it is not proud. It is not rude, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Brunch does not delight in evil but rejoices with the truth. It always protects, always trusts, always hopes, always perseveres. Brunch never fails.*</p>\n<p>Brunch is love, y'all. Show someone a little love and pan fry some potatoes and throw a poached egg on top. Give yourself a little treat and stick an overeasy fried egg in a sandwhich with some mixed greens and tomatoes. Use avocado liberally, and consider experimenting with sriracha and truffle oil. Kale and white sugar are both invited to this party, because brunch does not discriminate.</p>\n<p>Let your creative juices and chocolate sauce flow; brunch is a meal without protocol or limitations, and you definitely deserve that business in your life.</p>\n<p><img src=\"https://farm6.staticflickr.com/5612/15837068312_eeff7d20e1_b.jpg\" alt=\"\"></p>\n<p>*I took some creative licenses with Corinthians 13:4-8a. I did it with utmost respect for the original verse.</p>\n","feature_image":"https://farm6.staticflickr.com/5612/15837068312_eeff7d20e1_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c23b","name":"eggs","slug":"eggs"},{"id":"5c47a6f22037ef002282c23c","name":"hash","slug":"hash"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23e","name":"sandwich","slug":"sandwich"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c24e","name":"love","slug":"love"},{"id":"5c47a6f22037ef002282c2a4","name":"valentines day","slug":"valentines-day"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34d","uuid":"7021b7b8-3bef-4bf1-ab64-7a42245fdc06","title":"Taco Tuesday!","url":"https://cookinginpjs.herokuapp.com/taco-tuesday/","slug":"taco-tuesday","published_at":"10 February, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7390/16401090985_f2b567095e_b.jpg\" alt=\"\"></p>\n<p>One of the coolest thing about restaurants and coffee shops that open franchises internationally is that they tend to adapt their menu to the tastes of the country the store is in. For example, McDonald's in India actually has completely vegetarian options. Due to the <strong>large</strong> population of vegetarians in India, McDonald's has 2 segregated kitchens for vegetarian and non-vegetarian food. In addition, they don't serve any beef items, in contrast to the McDonald's in the US, which is primarily beef burgers. Honestly, I love McDonald's in India! They've managed to merge Indian flavors into simple American burgers and come out with amazing dishes such as the McSpicy Paneer and McAloo Tiki Burger. If you haven't yet, you should definitely try the McSpicy Paneer Burger, it's my favorite! :)</p>\n<p><img src=\"https://farm8.staticflickr.com/7447/16213447308_f042572573_b.jpg\" alt=\"\"></p>\n<p>My cousin recently had a major craving for Mexican food. The only problem is that we're in India and the Mexican food available doesn't taste quite the same nor as authentic. In order to quench our cravings, we even tried going to Taco Bell, which has a new item called the Paneer Tikka Masala Burrito! Unfortunately the menu had been too Indianized and no longer tasted Mexican. While this style of Taco Bell is very popular with people in India, it doesn't quite measure up to the Taco Bell we have in the US.</p>\n<p><img src=\"https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/p240x240/10500572_10153058890499813_8118498097049613786_n.jpg?oh=045ce9ccadee439cd72f5918fcb7bb3e&amp;oe=55583775&amp;__gda__=1431596238_63eebcd5fe7f4c135a000227d439d70b\" alt=\"\"></p>\n<p>Our best bet was to figure out how to make it our selves. Unfortunately we did run into a few bumps along the road:</p>\n<ol>\n<li>It is a lot harder to find iceberg lettuce in Bangalore than originally suspected. Iceberg lettuce isn't really in any kind of Indian food therefore only available at some special markets rather than on every street vegetable cart.</li>\n</ol>\n<p><img src=\"https://farm8.staticflickr.com/7448/16375097256_ab5794a54c_b.jpg\" alt=\"\"></p>\n<ol start=\"2\">\n<li>Many people tend to substitute dahi for sour cream out of convenience, however, this doesn't have quite the same taste. Conveniently, we found a fairly easy <a href=\"http://www.tarladalal.com/Sour-Cream-(--Wraps-and-Rolls)-32623r\">recipe</a> on how to make our own homemade sour cream! <a href=\"http://www.tarladalal.com\">Tarla Dalal</a> to the rescue!</li>\n</ol>\n<p><img src=\"https://farm9.staticflickr.com/8601/16400164382_73d99cfb83_b.jpg\" alt=\"\"></p>\n<ol start=\"3\">\n<li>Making the refried beans for the tacos ended up being extremely time consuming. If I had been in the US, I could have just bought a can of beans, cooked them with some cumin and cayene pepper and been done with it. I completely took for granted the preparation needed to make refried beans. First you needed to soak and cook the beans until they were soft, and then cook them in a pan with the appropriate seasoning. This took much longer than I had originally expected.</li>\n</ol>\n<p><img src=\"https://farm8.staticflickr.com/7400/15778603364_95408ed417_b.jpg\" alt=\"\"></p>\n<p>We realized even making tortillas by hand wouldn't be so bad. Every morning, the cook at my grandparents house makes chapatis from scratch. Tortillas are esentially chapatis made from normal flour, not wheat. So my grandmother quickly whipped up a huge ball of dough for us to roll out and make into tortillas.</p>\n<p><img src=\"https://farm9.staticflickr.com/8588/16213679700_5c8738a6f2_b.jpg\" alt=\"\"><br>\n<img src=\"https://farm9.staticflickr.com/8606/16375090146_29515989da_b.jpg\" alt=\"\"><br>\n<img src=\"https://farm8.staticflickr.com/7404/16214852339_c9de429d99_b.jpg\" alt=\"\"></p>\n<p>No taco would be complete without salsa! We made 2 different types of salsa, corn with jalapenos and pico de gallo salsa. Both salsas are extremely easy to make. For the corn salsa, you just need to combine boiled sweet corn kernels, diced jalapenos, lemon juice, salt, and some cilantro. Mix it together and viola! You have salsa. Similarly, if you mix diced tomatoes and onions, minced garlic, cilantro, and lemon juice you get pico de gallo salsa. Both can be made very quickly and are fresh and delicious!</p>\n<p><img src=\"https://farm8.staticflickr.com/7299/16375094646_260f9aa406_b.jpg\" alt=\"\"><br>\n<img src=\"https://farm8.staticflickr.com/7444/15781043603_80df9ccbbd_b.jpg\" alt=\"\"></p>\n<p>Surprisingly everything turned out really tasty and me and my cousin happily enjoyed delicious Mexican food for the next 2 days! :) My cousin loved it so much, she ate it for breakfast, lunch, AND dinner for the next 2 days. Mission Success!</p>\n<p><img src=\"https://farm8.staticflickr.com/7450/16401091685_d0ed039ea7_o.jpg\" alt=\"\"></p>\n","feature_image":"https://farm8.staticflickr.com/7450/16401091685_d0ed039ea7_o.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c244","name":"tacos","slug":"tacos"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c377","uuid":"5ebea30f-90a4-4799-b90f-666b7ffe5d0a","title":"It's about \"Pho\"-king time!","url":"https://cookinginpjs.herokuapp.com/its-about-pho-king-time/","slug":"its-about-pho-king-time","published_at":"31 January, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7484/15215553514_6e88dc3524_b.jpg\" alt=\"\"></p>\n<p>Before 2 summers ago, I had never experienced Pho. Once I tasted it, I knew that I had been missing out on something delicious my entire life. Pho is a simple vietnamese noodle soup. Traditionally, it is made with beef or chicken with some meat broth, which gives it its rich flavor. However we found a vegetarian way of mimicking the flavor! There's a great recipe <a href=\"http://ohmyveggies.com/30-minute-vegetarian-pho/\">here</a> that also had some great flavors.</p>\n<p>Pho works best if you have fresh bean sprouts, jalapenos, and basil. When you drop these into your soup, it brings out the most amazing flavors. I also chopped some onions, cilantro and some green onions for a little something extra.</p>\n<p><img src=\"https://farm8.staticflickr.com/7549/15215550764_63933ed924_b.jpg\" alt=\"\"></p>\n<p>The first step in the process is preparing the stock. My mom and I made a vegetable stock using celery, carrots, and onions among other things. All you need to do is simmer vegetables and herbs in a pot and after 30-40 minutes it should be done! You can also use store bought stock, as that is likely far less labor intensive! If you don't mind chicken or beef broth, feel free to use one of those instead and add some cooked shredded chicken or beef too.</p>\n<p>Next, you want to prepare your noodles - you can buy premade rice noodles, or get dry noodles and cook them yourself. But be careful; if they come pre-cooked and packaged they may be extremely fragile and broken. This is what happened to me, as you can see from my pictures. Ideally, the noodles shouldn't break the minute you pick them up with your chopsticks.</p>\n<p><img src=\"https://farm8.staticflickr.com/7513/15650093948_27967e5c09_b.jpg\" alt=\"\"></p>\n<p>Now all that's left for you to do is to pour yourself a bowl of hot broth, toss some noodles, vegetables and garnishes and top it off with some sauces. Personally, I just use a little hoisin sauce and chili garlic sauce but feel free to add soy sauce, sriracha, basically anything you want! The best part about Pho is that it can be easily modified to suit each individual's taste!</p>\n<p>If you haven't already, drop everything you're doing, go to the nearest Vietnamese restaurant and dive into a HUGE bowl of Pho!</p>\n<p><img src=\"https://farm6.staticflickr.com/5615/15837085352_70e3c9fa9c_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7551/15811883866_29a5cdf02b_b.jpg\" alt=\"\"></p>\n","feature_image":"https://farm6.staticflickr.com/5615/15837085352_70e3c9fa9c_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c236","name":"pho","slug":"pho"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34c","uuid":"9b20a1b5-7251-4618-856c-afaa843490da","title":"Is \"butter\" a carb?","url":"https://cookinginpjs.herokuapp.com/is-butter-a-carb/","slug":"is-butter-a-carb","published_at":"17 November, 2014","html":"<p> Sumu and I have been rescheduling taco day for weeks. We had a grand plan to make eight different kinds of tacos, with a wild assortment of toppings, for all the people we knew. We invited friends, looked up taco recipes with abandon, and prepared our stomachs by eating as much avocado as possible. Then gradually, all our friends realized they had lives, and we had contemplated the plan for so long that it no longer seemed appealing. In the manner of gifts that you were supposed to “grow into,” something that seemed so exciting when we first considered it lost all appeal with lengthy consideration. </p>\n<p> Suddenly, taco day was a chore, something we needed to do – and if you ask either of our mothers, they will tell you that we rarely do those things. </p>  \n<p> So we shoved the plan to the back of the closet, along with “The Scarlet Letter” (which I received when I was only nine) and other childhood detritus. We adopted a new plan: lettuce wraps. Lettuce wraps, we reasoned, are healthier than traditional tacos – there are fewer carbs, or grains, or something that we know we’re supposed to avoid eating in excess. </p> \n<p><img src=\"https://farm9.staticflickr.com/8545/15649695779_61aac68719_b.jpg\" alt=\"\"></p>\n<p> We made Asian style lettuce wraps with egg fried noodles, vegetables cooked in soy sauce, and thai-inspired peanut sauce. </p> \n<p> To make the noodles, just make regular noodles according to the package instructions. Drain them, rinse them slightly in cold water, then cooking them in sesame oil on the stove until they’re hot all the way through. Crack eggs right on to noodles and stir until fully cooked, and voila! </p>  \n<p> For the vegetables, just toss them in soy sauce, a little rice vinegar, and salt and pepper, and then stir fry them until they’re ready. </p>\n<p> And for the peanut sauce, mix a half cup of creamy peanut butter with a tablespoon of rice vinegar, and about a half cup of soy sauce in a bowl. Then, in a pan, put about two tablespoons of sesame oil. Cook about a half cup of diced onions until fragrant and translucent, and add chili flakes to your taste. Once your chili flakes are fully incorporated, add your mixture of peanut butter, soy sauce, and vinegar and cook until heated through. </p>\n<p> We made Mexican style lettuce wraps with homemade salsa, sweet potatoes diced and pan roasted with taco seasonings, and mushrooms. </p>  \n<p> For this recipe, you can pretty much make any sort of salsa you like – feel free to experiment! For the sweet potatoes, just dice and cook in a pan until slightly crispy, and add taco seasoning like there’s no tomorrow. Trust us; you cannot have enough taco seasoning. </p>   \n<p><img src=\"https://farm6.staticflickr.com/5611/15811854346_887e2574e5_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7524/15215525994_155fdec421_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8638/15650656340_36a8b87812_b.jpg\" alt=\"\"></p>\n<p> Once we were done cooking, we set all our toppings out alongside the washed and dried lettuce leaves, and sat right down on the floor and stuffed our faces. </p>\n<p> It. Was. Awesome. </p>\n","feature_image":"https://farm9.staticflickr.com/8545/15649695779_61aac68719_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c237","name":"lettuce wraps","slug":"lettuce-wraps"}]}}]}},"pageContext":{"limit":6,"skip":48,"numPages":10,"currentPage":9}}