{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Gaadi Chaats","slug":"bread","feature_image":"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg","published_at":"08 February, 2016","html":"<p>Welcome to another trip to India! When I was there, I ate a ton of food. All of my family members were happy to feed me, and between the amazing home cooking, and the delicious food available on every street corner, it's almost a miracle that I didn't pack on pounds.</p>\n<p>I am, generally, pretty picky about my food. I waver between being vegan and vegetarian, and I'm usually pretty careful about ingredients I allow in my kitchen. But, like everyone else, I have a fatal flaw and it's this; I love street food.</p>\n<p>I know that someone involved didn't wash their hands, I know that the ingredients aren't always top notch, I know that the fat, salt, and sugar content is probably WAY higher than anything I should be consuming. But I don't particularly care.</p>\n<p>In India a &quot;gaadi&quot; is a vehicle, and &quot;chaat&quot; is street food that has fresh vegetable, puffed rice, sweet and spicy sauces, and some fried components. So &quot;gaadi chaat&quot; is street food you get out of a flat bed cart.</p>\n<p>In Bangalore, there's a street people refer to as &quot;chaat street,&quot; and the street is lined with street food vendors. One end has a bakery, and the other end (the end I like to start on) has a few fruit carts, and one &quot;corn&quot; cart. I usually get my corn spiced with salt and chili, and mixed with raw, unripe mangoes (delicious!)</p>\n<p><img src=\"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg\" alt=\"imagine yummy food here, cuz you're missing it!\"></p>\n<p>Then it's time for Masala Chaat! This is one of my absolute favorites; it features a thick, spicy lentil soup layered atop crispy, crackly puris (indian &quot;chips&quot; and under sweet and spicy chutney, some fresh onion and cilantro, and a sprinkle of &quot;chaat masala.&quot;</p>\n<p><img src=\"https://pramods.box.com/shared/static/gmg1xnscaj3hsaqurjkezft7d1pn8rbj.jpg\" alt=\"\"></p>\n<p>It's The Chaat Shop!</p>\n<p>Next up: Gobi Manchurian. Cauliflower dipped in dough and deep fried, then dredged in fresh onion and cilantro, and delicious, spicy, tomato-ey garlic-y sauces.</p>\n<p><img src=\"https://pramods.box.com/shared/static/oolk1yrswjqb9wmq7piboh797nv9lkii.jpg\" alt=\"\"></p>\n<p>This is the Gobi Manchurian man! He also makes noodles. He is obviously supremely talented.</p>\n<p>Now that you're ALMOST too full (because you've eaten your way down the street) it's time for dessert! There's a bakery you can step into, vendors with all kinds of sweets and shaved ice, and (my personal favorite) Mango Kulfi!</p>\n<p><img src=\"https://pramods.box.com/shared/static/g5tfhr9guqtbm7tlinl65rw3eqdczkk8.jpg\" alt=\"\"></p>\n<p>Go to bed. It's been a long day, and you're long overdue for a satisfying food coma.</p>\n","tags":[{"id":"5c47a6f22037ef002282c2d5","name":"chaat","slug":"chaat"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"}]}},"pageContext":{"slug":"bread","previous":{"html":"<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/dg39NzgJZg4?wmode=transparent\"></iframe>\n</div>\n<p>Why this song you may ask? While growing up my mom always used to sing this song to me. The song literally translates to &quot;I'm going to build a house in front of your house.&quot; It's supposed to be this cute love song where the guy wants to &quot;build his world in front of her house.&quot; My question is, wouldn't it be more romantic if he built a house FOR them WITH her? Why does he only want to be in front of her house? I may be missing some context from the rest of the movie but regardless that's a whole different tangent.</p>\n<p>This song was pretty much just my mom telling me she wants to live right across the street from my and constantly spoil her future grandchildren. I'm pretty sure my mom wanted a full on re-enactment of &quot;Everybody loves Raymond.&quot; But hey, who's gonna complain about a free babysitter and delicious food? :P</p>\n<center>**Love you Amma! <3**< center=\"\">\n<p><img src=\"https://pramods.box.com/shared/static/qvuujqsw2q4cswg2630ahefurw3iyfnt.jpg\" alt=\"\"></p>\n<p>(While you're at it, you should also <a href=\"http://uppukhara.com\">check out her blog here</a>! It's basically every recipe she made for me growing up that I have random cravings for since I've moved out to California.)</p>\n<p>Sometimes I feel like I'm not a complete adult yet. Even though I'm currently supporting myself, paying my own bills, taxes, and insurance, I don't always feel like a &quot;real&quot; adult. Then, there are times when suddenly I feel like a full on housewife, which is something I NEVER EVER want to be.</p>\n<p>One such instance was this past weekend, when I was anxiously awaiting the arrival of my new electric pressure cooker. One thing I'm <em>sure</em> every child growing up in an Indian household can relate to, is the sound of a pressure cooker. That sound TERRIFIED me to my core throughout my childhood, and to this day. I always feel like something somewhere is going to explode. Even in college when my roommate decided to make dal and turned on the pressure cooker, we used to hide behind our bedroom doors waiting for it to go off enough times so could turn it off and continue hiding. You'd think that it wouldn't be worth the fear, but honestly have you ever had dal or even better, Bangalore-style saaru? Yea, it's worth it. (If you're wondering what that is, it's a less liquidy and better version of rasam with more dal in it). I've tried all sorts of cooking techniques, but saaru just doesn't taste quite the same unless you use a pressure cooker. And this way, you don't end up wasting hours and hours making your meal. THAT is not worth it.</p>\n<p>The sound of our pressure cooker is even worse for our dog because he can hear the noise WAY before we can. He panics and runs all the way up the stairs and cowers near my parent's bedroom door. This happens without fail every time my mom STARTS the pressure cooker. He knows it's coming and refuses to come down from his hiding spot until he's completely sure it's not going to go off again. Poor baby. But I'm sure you'll all realize why once you get your own pressure cookers!</p>\n<p><img src=\"https://pramods.box.com/shared/static/btjgsul6c32hvenzfsw74q4e2xc34mi3.jpg\" alt=\"\"></p>\n<p>But AHA! What is this?! An ELECTRIC pressure cooker? What is this magical device? So quiet and effective? Truly this can't be real! But miraculously, IT IS!</p>\n<p><img src=\"http://ecx.images-amazon.com/images/I/51jpKXz6EuL._AC_UL320_SR308,320_.jpg\" alt=\"\"></p>\n<p>I've never been so excited for any adult purchase in my life, except <em>maybe</em> my car. This was a glorious purchase. NOT ONLY can it make dal in 4 minutes, but I can use it to make dahi (yogurt or curds generally eaten with indian food), rice, and basically anything else in life I could ever think of! ALL WITHOUT MAKING A SOUND! I didn't even realize it had even started and it made a beeping noise indicating that my food was READY! It's wonderful.</p>\n<p>Amidst all this excitement over the pressure cooker, I got kind of homesick for my mom's food. I then proceeded to facetime my mom for an hour while she carefully explained step by step instructions on how to make one of my favorite childhood dishes, Bendekai Huli or for you non-Kannada speaking people out there, Okra Sambar. Most kids hate okra, but honestly it's one of my favorite vegetables, especially when it's in Indian food.</p>\n<p>I know this might not be the most flattering picture of any of us (mainly my brother) but whatever.</p>\n<p>One thing I will mention is that I am not sure where to get the huli pudi (sambar powder). My parents usually bring bags back from this little store in Bangalore every time anyone visits, but I'm sure you can find something similar in local Indian stores. I mean, I know I couldn't live without sambar so I'm sure there are other people who feel the same way and have found a way! There are also instant mixes available at the Indian store - while these aren't quite as good, they can satisfy the occasional craving!</p>\n<p>Now that you've learned a little bit of Kannada, and hopefully are as excited as I was, let's begin!</p>\n<p><img src=\"https://pramods.box.com/shared/static/gqm35vb6v2zox6pbikr2rrwd7fwe0y6u.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Okra Sambar or Bendekai Huli</h2>\n    <div class=\"summary\">\n      <p><em>I'm giving these instructions based on my electric pressure cooker. You may have to adjust the dal portion of the recipe according to however you make it. Pressure cookers scare the bejesus out of me so be careful!</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <h4>Dal</h4>\n          <li class=\"ingredient\">1 cup toor dal</li>\n          <li class=\"ingredient\">1/2-3/4 tsp turmeric powder</li>\n          <li class=\"ingredient\">2 1/2 cup water</li>\n          <h4>Sambar</h4>\n          <li class=\"ingredient\">oil</li>\n          <li class=\"ingredient\">1/2-3/4 tsp mustard seeds</li>\n          <li class=\"ingredient\">1 small package frozen okra</li>\n          <li class=\"ingredient\">1/2-3/4 tsp tamarind paste</li>\n          <li class=\"ingredient\">1 1/2 spoons huli powder (sambar powder)</li>\n          <li class=\"ingredient\">water</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Add the toor dal to your pressure cooker and rinse. Add the water and turmeric and turn on the pressure cooker. I did the Manual setting for 4 minutes. Also make sure its set to low pressure and all the pieces are in place. When the pressure cooker was done it went into keep warm (displayed \"L00:00\") and started counting up. I unplugged it and let it release the pressure on its own.</p>\n        <p>In a pot, add some oil and mustard seeds on medium heat, this is called vagarne. When the mustard seeds start popping, add the frozen okra. When the okra starts to get kinda sticky and stringy, add the tamarind paste and a little bit of water. Keep cooking and mixing the okra occasionally until it is cooked through.</p>\n![](https://pramods.box.com/shared/static/uq45bcrldnses3q369jmzcs1v1srqmqv.jpg)\n        <p>Add huli powder and salt to taste and let it come to a boil. Add the dal and more water until it's the right consistency. Taste it as you go. I needed to add a little more tamarind paste and huli powder to fit my taste but that depends person to person.</p>\n        <p>Let it cook for a few minutes and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/wlq7z13f7uqkm9b2jpei4zk2ruai6hp2.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/4y2jxv3s81ef223fs8ejkb5fp2bhxwf7.jpg\" alt=\"\"></p>\n</3**<></center>","title":"Tere Ghar Ke Samne, Khana Banaunga","slug":"tere-ghar-ke-samne-khana-banaunga","published_at":"04 February, 2016","feature_image":"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg","tags":[{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2d0","slug":"homesick"},{"id":"5c47a6f22037ef002282c297","slug":"mom"},{"id":"5c47a6f22037ef002282c2b8","slug":"puppy"},{"id":"5c47a6f22037ef002282c2ad","slug":"indian"},{"id":"5c47a6f22037ef002282c2cc","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2d1","slug":"pressure-cooker"},{"id":"5c47a6f22037ef002282c2d2","slug":"crock-pot"},{"id":"5c47a6f22037ef002282c2d3","slug":"okra"},{"id":"5c47a6f22037ef002282c2d4","slug":"sambar"}]},"next":{"html":"<p>I've been watching Parks and Recreation lately, and I am constantly inspired by the friendships Leslie cultivated with the women in her life. So, this post, I'm taking a page out of her book, and writing a love letter to Sumu, my co-writer, soul sister, and fellow adventurer.</p>\n<p>Special shout-out to the lady who taught me how to be a friend; my mom. My mom is intelligent, beautiful, and determined. But above all, she's caring and real. She has a loving and compassionate heart, and seeing her with her friends is something I will always cherish. I am so glad that we've grown into a friendship. I'm the lame kid whose mom is her best friend. And I am really really really lucky.</p>\n<p><img src=\"https://pramods.box.com/shared/static/w65ikv2f7p9cikic7cfgohsnl30monso.jpeg\" alt=\"\"></p>\n<p>Dear Sumedha,</p>\n<p>Thanks for being amazing. For coming to the rescue every time my pictures are sideways, or I can't figure out my own cellphone. For bringing Mindy's and Aziz's books home because you knew I was dying to read them, making me a scrapbook so I wouldn't have to make my own, and putting together an otter watching road trip itinerary, so that I could go on a stress free but totally planned ride.</p>\n<p>Thanks for putting up with me when I get temporarily obsessed with boy bands. Thanks for laughing at me when I snap back to my senses. With your love, nobody can drag me down.</p>\n<iframe src=\"https://embed.spotify.com/?uri=[https://play.spotify.com/track/70OTIpw8x8UXUsuCHW9i1i]\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Thanks for being brown with me. And watching Meet the Patels with me over the phone. This is what dreams are made of.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ab4cjd78mehqrd0dy00zex9e7isvgu0i.jpg\" alt=\"\"></p>\n<p>Thanks for always reassuring me about my admittedly glorious self, and being honest but kind when I look bad in something. Thanks for encouraging my dreams, and constantly believing in me. You are the person I send selfies to when I feel good about myself, and I love that about our relationship.</p>\n<p>You're incandescent, smart, lovely, talented, kind, caring, and authentic. You are an incredible friend, which is perhaps one of the best things I could say about a person. I am so lucky to have you in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/hbi46on7awfpk8te5ce1o79ai8wn4ju8.jpg\" alt=\"\"></p>\n<p>Thanks for being my otter watching and blog partner. Thanks for being the Joey to my Chandler, the Ann to my Knope, and the Tina to my Amy.</p>\n<p><img src=\"https://pramods.box.com/shared/static/c5kl7gputj9wtxoxg752vpc90yh51njq.png\" alt=\"\"></p>\n<p>Also, thanks for being the first of the two of us to not post on her day. It really took the pressure off of me (I think we BOTH thought it would be me!), so thanks. I love you, man.</p>\n<p>In honor of our friendship, Friends, and Valentines Day itself, I made scones. I hope you like them.</p>\n<p><img src=\"https://pramods.box.com/shared/static/alz3hmrfnxx5jg01e9bfshpzuoqjx9jc.jpg\" alt=\"\"></p>\n<p>&lt;3 Anu</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Apricot - Pistachio Scones</h2>\n    <div class=\"summary\">\n      <p><em>These scones are part whole wheat, part all purpose flour, and I think they would benefit from the addition of a floral note. If it's available to you, I would try adding orange blossom water or rose water, and experimenting a bit. \n<p>\nAlso, the Xanthan gum is optional. If you do use it, I used Bob's Red Mill. I've never used it before, and I found it to be really helpful in keeping the dough together, but a lot of recipes I read didn't use it, and the recipe authors in those cases were fine. \n![](https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg)\n</p></em></p>\n      <p>Yield: 12 scones</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Scones</h4>\n          <li class=\"ingredient\">1 1/4 C All Purpose Flour</li>\n          <li class=\"ingredient\">3/4 C Whole Wheat Flour</li>\n          <li class=\"ingredient\">1/2 Tsp Cardamom</li>\n          <li class=\"ingredient\">1 1/2 Tsp Cinnamon</li>\n<li class=\"ingredient\">3 Tbsp Sugar </li>\n<li class=\"ingredient\">2 Tsp Baking Powder</li>\n<li class=\"ingredient\">1 Tsp Salt</li>\n<li class=\"ingredient\">1/3 C Pistachios</li>\n<li class=\"ingredient\">1/2 C Dry Apricots</li>\n<li class=\"ingredient\">3/4 C Cashews</li>\n<li class=\"ingredient\">1 Tbsp Xanthan Gum</li>\n<li class=\"ingredient\">Maple Syrop (for brushing the tops)</li>\n<pre><code>  &lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;right&quot;&gt;\n  &lt;h3 id=&quot;directions&quot;&gt;Directions:&lt;/h3&gt;\n  &lt;div class=&quot;instructions&quot;&gt;\n    &lt;p&gt;\n    1.) Preheat the oven to 375 F, and oil/grease a cookie sheet. Put Cashews and Xanthan Gum in a bowl, and add boiling water to submerge cashews. You want to let the cashews hydrate a bit while you're mixing up other stuff.\n</code></pre>\n<p>\n2.) Chop your apricots into bits - 1/4 - 1/2 inch in size, and put them in a bowl. Add boiling water to those too - re-hydrating them keeps them juicy during the baking process. \n</p><p>\n3.) Mix your flours, salt, baking powder, sugar, cardamom, and cinnamon. Make sure all ingredients are fully mixed in. \n</p><p>\n4.) Roughly chop your pistachios, and throw them into the flour. Give it a quick toss to make sure your pistachios are even incorporated. \n</p><p>\n5.) Drain the apricot water into the bowl with cashews and Xanthan gum. Throw the cashews, gum, and some water into the blender. You want it to be the consistency of a thick greek yogurt, so add as much water as you need to get it there, a little bit at a time. \n</p><p>\n6.) Add your apricots to the flour and give it a quick toss, making sure the apricots are even through the dough. \n</p><p>\n7.) Add your cashew mixture a half cup at a time, until the dough is slightly sticky, and shaggy, but holds together. You don't want to over-knead. This is VERY IMPORTANT. DO NOT OVER-KNEAD. \n</p><p>\n8.) Once your dough has just come together, dump it onto a floured surface, and fold it over twice - once top to bottom, flatten out, then from the other side. THAT'S IT. LEAVE IT ALONE. It's done. \n</p><p>\n9.) Form into a disk about 1 - 1/2 inch thick, and cut into whatever shape you want. I went with the classic triangles, but it's up to you. \n</p><p>\n10.) Brush the bottoms with a touch of flour, and the tops with maple syrup. Pop into the oven, and bake for 15 - 20 minutes. I checked on them at 15, and discovered that they needed a bit more time to not be dense and dough-y. \n</p><p> \n11.) Eat piping hot! Slice them open, enjoy them with a bit of additional maple syrup or a pat of butter, and a delicious cup of tea!\n        </p>\n      </div>\n    </div>\n  </div>\n</div>","title":"Dear Sumedha, (a love letter)","slug":"galentines-day-scones","published_at":"15 February, 2016","feature_image":"https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d7","slug":"scones"},{"id":"5c47a6f22037ef002282c2d8","slug":"greatbritishbaking"},{"id":"5c47a6f22037ef002282c2d9","slug":"galentinesday"},{"id":"5c47a6f22037ef002282c2da","slug":"valentinesday"},{"id":"5c47a6f22037ef002282c2db","slug":"parksandrecreation"},{"id":"5c47a6f22037ef002282c2dc","slug":"leslieknope"},{"id":"5c47a6f22037ef002282c2dd","slug":"leslieandann"},{"id":"5c47a6f22037ef002282c2de","slug":"amypoehler"}]}}}