{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c367","uuid":"8290b27e-c06a-45fc-bd3c-00d32b60e47f","title":"Making Anerica Great Again","slug":"making-anerica-great-again","published_at":"10 August, 2016","html":"<p>I can take 0 credit for this post title because my friend Aneri themes her birthday based off of all the puns she can make with her own name. This year with all the ruckus that ever entertaining Donald Trump has caused, it only felt right to have her birthday be &quot;Make Anerica Great Again.&quot; PSA: Please do your research before this election season :)</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/k4yXQkG2s1E?wmode=transparent\"></iframe>\n</div>\n<p>Also... I HAD to include the video for this song because 1) Katrina Kaif looks gorgeous and 2) it's so damn catchy that it's become my new obsession.</p>\n<p>For this birthday cake, I thought it'd be fun to embody one of a classic drink in the form of a cake.</p>\n<h1 id=\"anoldfashionedcake\">An Old Fashioned Cake</h1>\n<p><img src=\"https://pramods.box.com/shared/static/qnuzhxf19zdc4qe7tz9qhjelervhkxc4.jpg\" alt=\"\"></p>\n<p>Not to toot my own horn, but I think this cake may have been the greatest one I've made so far. To be fair... I didn't make the actual cake from scratch. I had initially and then had a few friends taste it because I was unsure. That batch was probably the worst cakes I have ever made in my entire life.... There was absolutely no way I could bring that to my friend's birthday celebration. At that point, I was running short on time so I bought some standard Duncan Hines chocolate cake mixes and made 2 small round cakes according to package instructions.</p>\n<p>Here's where the fun and experimentation started!</p>\n<p>An old fashioned is a fairly simple drink according to <a href=\"http://www.esquire.com/food-drink/drinks/recipes/a3880/old-fashioned-drink-recipe/\">Esquire Magazine</a>:<br>\n1 Sugar Cube<br>\n3 dashes of Angostura Bitters<br>\n1 L Club Soda<br>\n2 oz. Rye Whiskey</p>\n<p>Some people tend to garnish their drinks with orange peels and cherries to add some flair to their drink. The hard core Don Drapers will stick to their stiff drinks... but this is a cake so I had some fun with it.</p>\n<p>I decided there would be 3 components to this cake outside the base chocolate cake layers and the frosting on top.</p>\n<p><img src=\"https://pramods.box.com/shared/static/8filn60lmi2pezfhyyuhnwyd1vdfg6s6.jpg\" alt=\"\"></p>\n<h1 id=\"whiskeysoakedcherries\">Whiskey Soaked Cherries</h1>\n<p>This is the easiest part of the entire cake. Just stick a bunch of cherries in a jar and fill it with the whiskey/bourbon/etc of your choice. I used Jack Daniels for everything in this cake because that's what we had at home. By the time you're done with the rest of the cake, these cherries will be nice and boozy to stick on garnish the top!</p>\n<h1 id=\"candiedorangepeels\">Candied Orange Peels</h1>\n<p>This part I wasn't really creative on. I followed the <a href=\"http://bakingthegoods.com/2013/12/06/drinking-buddies-recipe-whiskey-chocolate-cake-whisky-buttercream-frosting/\">instructions in this recipe</a>! It's actually fairly painless and you can do it while you're doing the rest of the cake prep and ganache prep.</p>\n<h1 id=\"nutellawhiskeyganachefilling\">Nutella Whiskey Ganache Filling</h1>\n<p>My ganache filling ended up being a hodge podge of a few recipes I've both made before and found on the internets.</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Nutella Whiskey Ganache</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">1 1/2 cup nutella</li>\n          <li class=\"ingredient\">1 can sweetened condensed milk</li>\n          <li class=\"ingredient\">Whiskey to taste</li>\n          <li class=\"ingredient\">Confectioners sugar to thicken  if needed</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Combine the ingredients on the stove on low heat until well mixed. Feel free to add as much whiskey as you want based on how boozy you want the ganache to be. Allow the ganache to cool. If the ganache is still too thin, add some confectioner's sugar until it thickens.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p>Assembling this cake was pretty easy. Place a layer of cake on the plate and poke holes in it with the back of a wooden spoon. Pour ganache over until the holes are filled and a layer of ganache exists over the cake. Stack the other layer of cake on top and also poke holes in this layer. Pour just enough ganache over this layer to fill the holes. Cover the cake with your favorite vanilla/plain frosting. I prefer Duncan Hines Cream Cheese frosting but that's up to you what kind of frosting you want! Top the cake with some whiskey cherries, candied orange peels, and even some chocolate or orange peel shavings if you want.</p>\n<p>Enjoy!</p>\n<p><img src=\"https://pramods.box.com/shared/static/mufzx61sqambx3kf7gx6clftip5sozso.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/kjnx23pun0ckfiegog2ujetcd4igscbi.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/qnuzhxf19zdc4qe7tz9qhjelervhkxc4.jpg","tags":[{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"},{"id":"5c47a6f22037ef002282c337","name":"anerica","slug":"anerica"},{"id":"5c47a6f22037ef002282c338","name":"old fashioned","slug":"old-fashioned"},{"id":"5c47a6f22037ef002282c339","name":"orange","slug":"orange"},{"id":"5c47a6f22037ef002282c33a","name":"cherry","slug":"cherry"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c363","uuid":"5cdd2872-7005-4df6-a0a5-35ffb4b52dc1","title":"A Quick Recipe Fix (Numero Uno)","slug":"recipes","published_at":"11 April, 2016","html":"<p>So I haven't been cooking much lately, but I have been reading a ton of recipes for when I get my life back post-finals! So, I'm starting a new feature! The &quot;Quick Recipe Fix&quot; - your dose of some of my favorite recipes that I've found on the interwebs.</p>\n<p><img src=\"https://pramods.box.com/shared/static/e1ww9g1kidb63ndvuqe4zzlsqv8mjane.jpg\" alt=\"\"></p>\n<p>Enjoy the recipes, and cut me some slack, internet. I've been busy :)</p>\n<p>1.) Love and Lemons is one of my favorite food blogs; they have gorgeous pictures, and I love their fresh approach to food. They have a cookbook out right now that everyone should totally get. I'm also waiting for the day when I can try this recipe for <a href=\"http://www.loveandlemons.com/chickpea-flour-pizza-asparagus/?utm_source=feedly&amp;utm_medium=webfeeds\">Chickpea Flour Pizza Crust</a> because YUM.</p>\n<p>2.) Minimalist Baker hits it out of the park every time. They have a real talent for finding fresh, simple recipes with easy (and short!) cleanup! Check out their recipe for <a href=\"http://minimalistbaker.com/gingery-thai-kale-salad-cashew-dressing/\">Gingery Thai Kale Salad with Cashew Dressing</a></p>\n<p>3.) I love Annie's Eats, especially her cocktail posts! Now that summer's coming, it's time to turn out minds to summertime cocktails, and there's something about this <a href=\"http://www.annies-eats.com/2016/03/25/gin-grapefruit-and-rosemary-cocktail/\">Gin, Grapefruit, and Rosemary Cocktail</a> that feels delightfully spring-y.</p>\n<p>4.) Smitten Kitten is incredibly prolific; they do an amazing job of posting super frequently with high quality recipes! Here's one of there's that I'm pretty sure is an Italian sort of Shakshouka <a href=\"http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/\">Eggs in Purgatory, Puttanesca-Style</a>.</p>\n<p>5.) The Beeroness is one of my favorite people on the internet. All of her recipes are accompanied by great stories about her life, and the food itself is nothing to sneeze at. If you're a beer lover OR a food lover, you'll love her blog; right now, I really want to try her <a href=\"http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/\">Grilled Garlic-Beer Flatbread</a>.</p>\n<p>Enjoy the recipes, and if you get a chance to try them before I do (super likely) let me know how it goes!</p>\n","feature_image":"https://pramods.box.com/shared/static/75ycreg8gpwyyvfdmpmdtiomxiop1sg4.jpg","tags":[{"id":"5c47a6f22037ef002282c26b","name":"food truck","slug":"food-truck"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c314","name":"loving lately","slug":"loving-lately"},{"id":"5c47a6f22037ef002282c315","name":"favorite blogs","slug":"favorite-blogs"},{"id":"5c47a6f22037ef002282c316","name":"yum","slug":"yum"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c345","uuid":"a36cd4bb-ea95-40c9-825a-ecfaa379ce90","title":"Wasted away again in Margaritaville, Searchin' for my lost shaker of salt.","slug":"wasted-away-again-in-margaritaville-searchin-for-my-lost-shaker-of-salt","published_at":"23 February, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/38mzn6d74gsoayifd0d1sjehep3gho7g.jpg\" alt=\"\"></p>\n<p>Happy National Margarita Day!!! Bet you didn't know that was a thing! Well now you do so you're welcome.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:57FvuUotRyzRl8hwIhCVuO\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>In case you weren't aware... Jimmy Buffett actually had a cameo in Jurassic World last year. Of course he was one of the people escaping the pterodactyls. But of course, in true Margaritaville fashion, he makes sure to grab BOTH of his margaritas before making a run for it.</p>\n<p><img src=\"http://i.imgur.com/rHfvEne.gif?noredirect\" alt=\"\"></p>\n<p>This man is a hero. He clearly knows what today is about. If you haven't already, definitely play the song I linked to above while reading the post. I promise the lyrics won't disappoint. If you're really digging the song, I totally recommend checking out the entire album. It's a gold mine of amazing songs like &quot;Cheeseburger in Paradise&quot;, &quot;Pencil Thin Mustache&quot;, &quot;Grapefruit - Juicy Fruit&quot;, &quot;Son of a Son of a Sailor&quot;, and last but not least &quot;Why Don't We Get Drunk.&quot; I've linked the entire album here for your enjoyment. Do it. I promise it's totally worth it.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:album:6MlglzxBetAjx7yZNAQt3D\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Using the great Jimmy Buffett and National Margarita Day as inspiration, I figured I can FINALLY share the amazing strawberry margaritas with you guys. I made these margaritas last year for a Cinco de Mayo celebration at my cousin's place. Technically it was Seis de Mayo because May 5th last year was a Tuesday and everyone was busy that day. These were a HUGE hit and best part is that when you run out of strawberries you can just use more lime juice and make plain margaritas. It's the best.</p>\n<p>In case you needed more convincing to actually listen to that song:</p>\n<p><em>&quot;But there's booze in the blender, and soon it will render that frozen concoction that helps me hang on.&quot;</em></p>\n<p>Yeah... I know. He sings from the heart. Now turn on the song and start blending up some delicious margaritas for you and your friends!</p>\n<p><img src=\"https://pramods.box.com/shared/static/3vs3q24ymcfuxdqkfsiuu3m7y0k1itr7.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Frozen Strawberry Margaritas</h2>\n    <div class=\"summary\">\n      <p><em>Just as a warning, these are quite strong so I'd recommend tasting as you add the tequila. However... It's always 5 o'clock somewhere!</em></p>\n      <p>Yield: about 4-5 margaritas</p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">2 cups frozen strawberries</li>\n          <li class=\"ingredient\">1 cup silver tequila</li>\n          <li class=\"ingredient\">2/3 cup freshly squeezed lemon or lime juice (save a few wedges for garnish)</li>\n          <li class=\"ingredient\">1/3 cup honey or agave</li>\n          <li class=\"ingredient\">1/4 cup Triple Sec (or Cointreau)</li>\n          <li class=\"ingredient\">Coarse salt to rim the glasses</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Blend all the ingredients except salt together in the blender. Taste and adjust tequila or honey/agave as you wish</p>\n        <p>Run a lime wedge along the rim of each of your margarita glasses. Dip the glass upside-down in a bowl of salt. Fill each glass with the drink and garnish with a lemon or lime wedge.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/8whp4skk7w2bwc1cfvn5o3xq9u5g6k1k.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/6917hfisdaydben1ot5yvzlfxep4kef1.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/6917hfisdaydben1ot5yvzlfxep4kef1.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c278","name":"margaritas","slug":"margaritas"},{"id":"5c47a6f22037ef002282c279","name":"strawberry","slug":"strawberry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ee","name":"jimmy buffett","slug":"jimmy-buffett"},{"id":"5c47a6f22037ef002282c2ef","name":"Margaritaville","slug":"margaritaville"},{"id":"5c47a6f22037ef002282c277","name":"cinco de mayo","slug":"cinco-de-mayo"},{"id":"5c47a6f22037ef002282c2f0","name":"tequila","slug":"tequila"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35c","uuid":"1ac41982-aa36-47c5-997a-8cbb575d8814","title":"Started From the Batter, Now We're Here.","slug":"started-from-the-batter-now-were-here","published_at":"28 January, 2016","html":"<p>I know. I know. The title and the song I'm telling you to listen while reading this post don't match, but I felt I needed to up my Drake game a bit. Plus, now every time I think of Drake, I picture him <a href=\"https://youtu.be/uxpDa-c-4Mc\">doing his little &quot;dance&quot;</a> over and over again. It brings me a <strong>LOT</strong> of joy. I also love the <a href=\"https://www.youtube.com/watch?v=cjeORm4LMDk\">SNL parody of it</a> but that's not really relevant.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:6nmz4imkDcmtwMjocAzFSx\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>First off, <strong>HAPPY NATIONAL CHOCOLATE CAKE DAY</strong>! I was not aware that this was an <em>ACTUAL</em> holiday but I'm not gonna complain. I firmly believe that everyday should be National Chocolate Cake Day! But hey, I'll take one day a year.</p>\n<p>Second, it's your lucky week! You get TWO whole posts from me! I've been sick since Sunday, so I've been vegetating on my couch, watching a few too many chick flicks, all whilst drinking the world's supply of ginger chai <a href=\"http://cookinginpjs.com/an-ode-to-chai/\">(hence my caffeine-fueled poem on Sunday which you should also totally read and appreciate)</a>.</p>\n<p>So, let's get to it!</p>\n<p>As the self-designated baker for my friend group, I've been baking birthday cakes for pretty much everyone. I've been trying to tailor each cake to something either they've specifically requested or what I think they would enjoy. This cake in particular was for one of my friends who loves whiskey. Her only requirement was that, and I quote, &quot;I do not kill her.&quot; I took it as a challenge in that I was going to put as much alcohol as possible in the cake while retaining its ability to taste good.</p>\n<p>Three things happened with this:</p>\n<ol>\n<li>I made a deliciously boozy cake</li>\n<li>I finished a LOT of the whiskey bottle I bought for this very specific purpose.</li>\n<li>I ended up getting fairly tipsy after a few batter taste tests</li>\n</ol>\n<p><em>I also feel like I should include a warning: raw batter means raw eggs which also means the potential for salmonella. So be careful not to eat spoonfuls of your cake batter! That could get you very sick. Enjoy responsibly ;)</em></p>\n<p>Honestly, I'd say it was a completely successful experience. I totally recommend making boozy desserts to everyone (of legal age of course). :P Just don't expect to be productive after you put the cake in the oven. I had absolutely no attention span once I set that cake to bake. I ended up making one GIANT cake for my friend, another little one for the rest of us to enjoy on our own, and a few cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the cupcakes were gone within 20 minutes of me sending an email announcing the arrival of whiskey cupcakes. I'm now officially known as the dessert lady at work.</p>\n<p><img src=\"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chocolate Whiskey Cake</h2>\n    <div class=\"summary\">\n      <p><em>Feel free to increase/decrease the amount of whiskey according to your taste/tolerance. Just make sure to adjust the flour accordingly so your cake batter isn't too liquidy. The general rule is for each extra tablespoon of Whiskey that you add, add an extra 2 tablespoons of flour to compensate.</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">2 1/2 cups flour</li>\n          <li class=\"ingredient\">3/4 cups dark cocoa powder</li>\n          <li class=\"ingredient\">2 cups granulated sugar</li>\n          <li class=\"ingredient\">2 tsp baking soda</li>\n          <li class=\"ingredient\">1 tsp baking powder</li>\n          <li class=\"ingredient\">1 tsp salt</li>\n          <li class=\"ingredient\">2 large eggs</li>\n          <li class=\"ingredient\">1/2 cup strong black coffee (chilled)</li>\n          <li class=\"ingredient\">1 cup whiskey</li>\n          <li class=\"ingredient\">1 cup buttermilk</li>\n          <li class=\"ingredient\">1/2 cup vegetable oil</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>If your coffee isn't chilled, then make sure to put it in your freezer to speed up that process. Otherwise the eggs will cook when you add the coffee to it. Set your oven to preheat at 350 degrees.</p>\n        <p>Whisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the coffee is chilled, whisk that in as well.</p>\n        <p>In a separate bowl, stir the flour, cocoa powder, baking soda, baking powder, and salt together. Slowly pour the wet ingredients into the bowl with all the dry ingredients. Make sure to keep stirring while you pour.</p>\n        <p>Whisk until smooth. Taste to make sure the whiskey level is right. If not add more whiskey/flour accordingly.</p>\n        <p>Spray your cake pan (or place cupcake liners in your cupcake pan if you're making cupcakes) and pour in the batter. Set your timer for about 25-30 minutes (or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick (something that can reach fairly deep inside the cake). If it comes out clean, you're done! Cool the cake in the pan for 15 minutes, frost and devour!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p>I did get lazy when it came to the frosting and just bought some chocolate frosting from the store. I felt it might be a little TOO much if I spiked that too, so I just spread shit tons of frosting on top of the cake/cupcakes and ate it. I'd say that was the better choice! If you're going easy on the whiskey inside the cake itself (or in the words of my friend, &quot;are being a little bitch&quot;), then maybe you can spike the frosting. Otherwise you've got enough alcohol in there to get the deed done.</p>\n<div class=\"container\">\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-2.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-3.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-10.w529.h352.2x.gif\"></div>\n</div>\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-15.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-9.w529.h352.2x.gif\"></div>\n</div>\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-11.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-12.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-13.w529.h352.2x.gif\"></div>\n</div>\n</div>\n<p>Yes. You know you needed all these gifs right now. Don't lie to yourself. I'm pretty sure I just stared at this gif collection for a good 5 minutes, at least. You're welcome.</p>\n<p><img src=\"https://pramods.box.com/shared/static/9upgp2c5wpbpedkokxisgwnalior9lbz.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/kn2i1aq1mhs3jkmokp3139lxcu9r2xxj.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/rthr66f7x6q8wymqa98yafvbah7hklcv.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34a","uuid":"df2980d7-f8f6-4a9a-96e3-15fa96299b5d","title":"Dirty Girls Scouts ;)","slug":"dirty-girl-scouts","published_at":"15 July, 2015","html":"<p><img src=\"https://lh3.googleusercontent.com/UATDHsDclzBmpk7RyUOB4c7NHHbPAdWr8pBn0b-6uVzH=w1314-h1316-no\" alt=\"\"></p>\n<p>Since I'm starting to like theming my blog posts to songs, enjoy.</p>\n<center><iframe src=\"https://app.box.com/embed/preview/oxzn8wy3orawgj1kg2lpppjq48vufdmc?view=&sort=&direction=ASC&theme=light\" width=\"100%\" frameborder=\"0\" allowfullscreen webkitallowfullscreen=\"\" msallowfullscreen=\"\"></iframe></center>\n<p>Let's be honest... Anytime anyone sees their local Girl Scouts at the grocery store, they start drooling and daydreaming of Thin Mints, Tagalongs, Samoa's, and Do-si-Dos. Girl Scout cookies are some of my favorite type of cookies in the world. While I may mainly be a fan of the plain shortbread cookies, Trefoils. Thin mints and Samoa's are America's two favorites.</p>\n<p>While plunging into the depths of Pinterest one day, I found a recipe for mini samoa donuts. That got me thinking... What if I were to make mini girl scout themed cupcakes. And to make them even better, give them a slight &quot;adult&quot; twist.</p>\n<p><img src=\"https://lh3.googleusercontent.com/LVZHqaB-oL-fVWQXFOi2BHG5JYGj8Y-hcensdE9O9mSA=w1312-h1316-no\" alt=\"\"></p>\n<p>Not to toot my own horn, but these donut bites were <em>AMAZING</em>. Although they were <em>really</em> donuts... but rather cupcakes. They still tasted great. There was definitely not enough alcohol in any of the desserts to do any damage but the slight bourbon taste in the caramel brought out some awesome flavors.</p>\n<p>My cousins and I even had a hard time not finishing up the caramel bourbon sauce before the donuts were ready. We kept eating spoon by spoon of the creamy booze-ness.</p>\n<p><strong>Pro Tip:</strong> Drizzle some warm caramel bourbon sauce onto a scoop of ice cream... HEAVEN.</p>\n<p>When I took these desserts to work, they were gone within minutes. Clearly everyone else was dying to get their Girl Scout cookie fix like I was. I even saw this guy spooning caramel bourbon sauce into his coffee to make it a little more &quot;Irish.&quot; ;)</p>\n<p>Here are the recipes for the donut bites. Even if you don't make the bites themselves... you DEFINITELY have to try the Caramel Bourbon sauce. It takes a few minutes to make and is EXTREMELY rewarding.</p>\n<p><img src=\"https://lh3.googleusercontent.com/BYvxNbTPOJb518dtM6jLTZ9gwTDpQpmuj15u6oPPormA=w1976-h1316-no\" alt=\"\"></p>\n<p><img src=\"https://lh3.googleusercontent.com/Pk7bQdao45MiJPXztLw3P1jt6yLFAw5g-mIGogM4G2O5=w1458-h1316-no\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>Samoa Donut Bites</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <h4>Donuts:</h4>\n      <li class=\"ingredient\">1¼ cup all-purpose flour</li>\n      <li class=\"ingredient\">½ tsp salt</li>\n      <li class=\"ingredient\">1¼ tsp baking powder</li>\n      <li class=\"ingredient\">1 tsp vanilla extract</li>\n      <li class=\"ingredient\">1 egg</li>\n      <li class=\"ingredient\">½ cup milk</li>\n      <li class=\"ingredient\">½ tbsp lemon juice</li>\n      <li class=\"ingredient\">2 tbsp butter, melted</li>\n      <li class=\"ingredient\">4 tbsp Southern Comfort Caramel</li>\n      <h4>Caramel Bourbon Sauce</h4>\n      <li class=\"ingredient\">1 package melting caramel (about 14 oz)</li>\n      <li class=\"ingredient\">3 tbsp milk</li>\n      <li class=\"ingredient\">¼ tsp salt</li>\n      <li class=\"ingredient\">2 tbsp Souther Comfort Caramel</li>\n<pre><code>  &lt;h4&gt;Toppings&lt;/h4&gt;\n  &lt;li class=&quot;ingredient&quot;&gt;3 cups unsweetened coconut flakes, toasted&lt;/li&gt;\n&lt;/div&gt;\n&lt;div class=&quot;right&quot;&gt;\n  &lt;h3 id=&quot;directions&quot;&gt;Directions:&lt;/h3&gt;\n  &lt;div class=&quot;instructions&quot;&gt;\n    &lt;p&gt;Preheat the oven to 425 degrees. Spray the cupcake pan with cooking spray and keep it aside.&lt;/p&gt;\n    &lt;p&gt;Mix milk and lemon juice in a cup/bowl and let it sit for at least 5 minutes to make buttermilk&lt;/p&gt;\n    &lt;p&gt;&lt;strong&gt;Donuts: &lt;/strong&gt;Mix the flour, sugar, baking powder and salt together. Then stir in the vanilla, egg, buttermilk, and melted butter until just mixed. Pour the mixture into the cupcake pan and bake for 4-5 minutes or until done.&lt;/p&gt;\n    &lt;p&gt;&lt;strong&gt;Caramel Icing: &lt;/strong&gt;In a separate bowl, warm the caramel with the milk and 1/4 tsp salt. Every 25 seconds, stir the mixture until the caramel is fully melted. Add a few shots of the Southern Comfort Caramel until you feel like your caramel is boozy enough. Feel free to go as crazy as you want.&lt;/p&gt;\n    &lt;p&gt;Drizzle or dip your donuts in the icing, cool, and enjoy! Even feel free to toss a few toasted coconut flakes on top to make it even more &quot;samoa&quot;-esque&lt;/p&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n  </div>\n</div>\n<p><img src=\"https://lh3.googleusercontent.com/y21YNq-5AHPkyhm-BkMGKMf6I5bvI1shqMddA9xDwtK0=w1976-h1316-no\" alt=\"\"></p>\n<p><img src=\"https://lh3.googleusercontent.com/mDMjBqfcaZf_4J2LfkVDTw4Bb6aCHS5RJ6mP0gJlVqjR=w1976-h1316-no\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>Whole Wheat Thin Mint Donut Bites</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <h4>Donuts:</h4>\n      <li class=\"ingredient\">¾ cup milk</li>\n      <li class=\"ingredient\">1 tsp lemon juice</li>\n      <li class=\"ingredient\">1 cup + 2 tbsp flour</li>\n      <li class=\"ingredient\">¼ cup sugar</li>\n      <li class=\"ingredient\">1 tsp baking powder</li>\n      <li class=\"ingredient\">½ tsp baking soda</li>\n      <li class=\"ingredient\">1 tbsp cocoa powder</li>\n      <li class=\"ingredient\">½ tsp salt</li>\n      <li class=\"ingredient\">2 tbsp melted butter</li>\n      <li class=\"ingredient\">1 tsp vanilla extract</li>\n      <li class=\"ingredient\">1 egg</li>\n<pre><code>  &lt;h4&gt;Mint Icing&lt;/h4&gt;\n  &lt;li class=&quot;ingredient&quot;&gt;1½ cups chocolate chips&lt;/li&gt;\n  &lt;li class=&quot;ingredient&quot;&gt;1 tsp oil&lt;/li&gt;\n  &lt;li class=&quot;ingredient&quot;&gt;1 tsp vanilla extract&lt;/li&gt;\n  &lt;li class=&quot;ingredient&quot;&gt;Crème de menthe&lt;/li&gt;\n&lt;/div&gt;\n&lt;div class=&quot;right&quot;&gt;\n  &lt;h3 id=&quot;directions&quot;&gt;Directions:&lt;/h3&gt;\n  &lt;div class=&quot;instructions&quot;&gt;\n    &lt;p&gt;Preheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and keep it aside.&lt;/p&gt;\n    &lt;p&gt;Mix milk and lemon juice in a cup/bowl and let it sit for at least 5 minutes to make buttermilk&lt;/p&gt;\n    &lt;p&gt;&lt;strong&gt;Donuts: &lt;/strong&gt;Mix the flour, sugar, salt, melted butter, baking soda, baking powder, cocoa powder, and vanilla together. Mix the eggs into this mixture until the batter is fully mixed. Add the buttermilk and when mixed, pour into the cupcake pan and bake for 6-8 minutes or until done throughout.&lt;/p&gt;\n    &lt;p&gt;&lt;strong&gt;Mint Icing: &lt;/strong&gt;In a separate bowl, mix all the ingredients together until smooth. Feel free to add as much creme de menthe as you want. Just make sure not to add too much because it'll make the icing too &quot;liquidy.&quot;&lt;/p&gt;\n    &lt;p&gt;Drizzle or dip your donuts in the icing, cool, and enjoy!&lt;/p&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n  </div>\n</div>\n<p><img src=\"https://lh3.googleusercontent.com/z_1RApjRUzeesW-W2UILsKCSAbUw2dO2NhFBq5Wa-7ij=w1976-h1316-no\" alt=\"\"></p>\n<p><img src=\"https://lh3.googleusercontent.com/lOBwCbDR2FkybvWarj2EOlKv3-xreHO4AknOeK6bS_6K=w1976-h1316-no\" alt=\"\"></p>\n</div></div>","feature_image":"https://lh3.googleusercontent.com/UATDHsDclzBmpk7RyUOB4c7NHHbPAdWr8pBn0b-6uVzH=w1314-h1316-no","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c274","name":"mini","slug":"mini"},{"id":"5c47a6f22037ef002282c27b","name":"thin mints","slug":"thin-mints"},{"id":"5c47a6f22037ef002282c27c","name":"samoas","slug":"samoas"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c27e","name":"bourbon","slug":"bourbon"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c373","uuid":"7dfb9b35-e35e-4d3e-a667-6a982763e05c","title":"Did you fall for a shooting star?","slug":"did-you-fall-for-a-shooting-star","published_at":"21 April, 2015","html":"<p><img src=\"https://farm9.staticflickr.com/8800/16599263773_a24ff9384b_b.jpg\" alt=\"\"></p>\n<p>Anyone who knows me, knows I'm obsessed with a wine called &quot;Drops of Jupiter.&quot; And why not?! One of my favorite bands, Train, partnered with a California winery to make a line of wines named after some of their most famous songs! What could be better than that!</p>\n<p>This was a great wine for me and my friends, especially because we all have different preferences when it comes to wine. I prefer a really deep spicy red, whereas most of my friends like drier whites or dessert wines. Surprisingly, this wine solved most of our dilemmas. Each glass is smooth, sweet and spicy, but doesn't lean too far in either direction. It has something for all shades of wine lovers! (Plus it doesn't hurt that it's under $10) It's a college wine lover's dream! :)</p>\n<p><img src=\"https://farm9.staticflickr.com/8782/17033305629_16faa89701_b.jpg\" alt=\"\"></p>\n<p>Drops of Jupiter is not even the only type of wine that the Save Me San Francisco Wine Co makes. They also make Calling All Angels, California 37, Bulletproof Picasso, Hella Fine, and Soul Sister.</p>\n<p>Just pour yourself a glass, blast <a href=\"https://www.youtube.com/watch?v=7Xf-Lesrkuc\">Drops of Jupiter</a>, and take a trip back to the 90's!</p>\n<p><img src=\"https://38.media.tumblr.com/tumblr_m33pmsMyUY1qflcm5o1_500.gif\" alt=\"\"></p>\n","feature_image":"https://farm9.staticflickr.com/8782/17033305629_16faa89701_b.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c247","name":"wine","slug":"wine"},{"id":"5c47a6f22037ef002282c248","name":"drops of jupiter","slug":"drops-of-jupiter"},{"id":"5c47a6f22037ef002282c249","name":"train","slug":"train"},{"id":"5c47a6f22037ef002282c24a","name":"red wine","slug":"red-wine"}]}}]}},"pageContext":{"slug":"giggle-juice","limit":6,"skip":0,"numPages":1,"currentPage":1}}