{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c361","uuid":"90fcc5c1-73f9-4b23-a38e-697f92bdfb7e","title":"This Shit is Bananas, B-A-N-A-N-A-S","slug":"this-shit-is-bananas-b-a-n-a-n-a-s","published_at":"18 February, 2016","html":"<p>I konw this post can't come close to as sweet as the one Anagha wrote this week. But I pinky promise, in addition to making up for last weeks missing post, I will also make up for Valentine's day. I know, I know... lots of promises but you don't mess with pinky promises!</p>\n<p>You knew this song was coming... don't lie. Just relish in the throwback and ketchup on some food blog reading ;)</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:6RcQOut9fWL6FSqeIr5M1r\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Since this past weekend was the SUPERBOWL I had this whole great plan on how I was going to post about what I made to eat then. But of course my inner Dory came out and I forgot to upload all the tantalizing pictures I took. A specific friend of mine, <em>cough cough Breane</em>, had requested the recipe so I TOTALLY apologize for my brain fart and promise I'll post it next week! But until then, you'll have to bear with me and enjoy this post instead :).</p>\n<p>So personally, I think my mom is the QUEEN of making banana bread. Like, seriously. Her banana bread the most glorious thing since, well, sliced bread (badum chhhhhhhhh). It's the perfect combination soft and moist and not too sweet. Of course, my banana bread can never live up to that standard but, hey, I can try!</p>\n<p><img src=\"https://pramods.box.com/shared/static/kvkxvgrndzsbsfjbpa938jq142jrlgpl.jpg\" alt=\"\"></p>\n<p>One thing I've learned about all of my mom's recipes is that her measurements aren't always... Exact. She always shows me measurements using the length of her fingers. Problem is we have different sized hands AND how do you quantify that measurement so that you can replicate it? I've tried SO many times to get teaspoon measurements for everything but can't say I've been entirely successful. This is the sole reason I haven't been able to make my food taste like my mom's food.</p>\n<p>Anyways, a girl can try right? Now back to her mind-BLASTING banana bread.</p>\n<p><img src=\"http://cdn.meme.am/instances/55172211.jpg\" alt=\"Insert Russell Peters Gif Here\"></p>\n<p>Many of my friends are aware that I don't particularly have a sweet tooth. I mean sure I get cravings on occasion, however, banana bread has always been one of my favorite things, mainly because it's just the right level of sweetness. It has a strong taste of vanilla and of course banana! What could be better?!</p>\n<p>Once when I was having said cravings, I really really wanted to eat my mom's banana bread. So I decided to do my own take on her recipe, I know already going downhill, by adding zucchini and carrot. You know, hiding a little bit of healthy things in there to make you feel better about eating desserts.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fk4kesqhxueed5q00j41f9gbjib2vgwo.jpg\" alt=\"\"></p>\n<p>It actually came out pretty good, not quite mom level, but still pretty amazing. I may have eaten an embarrassingly large number of these muffins. Let me know what you think!!!</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Zucchini Carrot Banana Bread Muffins</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">1/2 cup shortening</li>\n          <li class=\"ingredient\">1 cup sugar</li>\n          <li class=\"ingredient\">2 eggs</li>\n          <li class=\"ingredient\">4 mashed bananas</li>\n          <li class=\"ingredient\">1 tsp lemon juice</li>\n          <li class=\"ingredient\">2 cups sifted flour</li>\n          <li class=\"ingredient\">1/2 tsp salt</li>\n          <li class=\"ingredient\">1 cup chopped nuts</li>\n          <li class=\"ingredient\">1 zucchini, shredded</li>\n          <li class=\"ingredient\">1 carrot, shredded strips</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Cream shortening and sugar together. Beat eggs until light and add. Mix in bananas and add lemon juice. Blend with creamed mixture. Sift flour, baking powder and salt together and mix quickly into the banana mixture. Add the nuts, zucchini, and carrots and mix. Pour batter into cupcake pans and bake at 375 degrees about 30 minutes, or until a toothpick comes out clean when you poke it.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/ksfz88a49rm9j2ztujqfusuoyoidu0wp.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c296","name":"bananas","slug":"bananas"},{"id":"5c47a6f22037ef002282c294","name":"zucchini","slug":"zucchini"},{"id":"5c47a6f22037ef002282c295","name":"carrot","slug":"carrot"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"slug":"bananas","limit":6,"skip":0,"numPages":1,"currentPage":1}}