{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c368","uuid":"f874d388-7289-41a8-bdc1-129c0d14f429","title":"Gettin' your morning BUZZ","slug":"gettin-your-morning-buzz","published_at":"17 July, 2015","plaintext":"\n\nTo be completely honest... this song isn't quite perfect for this post but it\nwas the first one that came to mind for this post. Enjoy :P\n\nAnd no, in case you were wondering... I didn't spike these coffee cupcakes with\ncocaine.\n\nSo, I'm not sure how many of you know this but coffee cake doesn't ACTUALLY \nhave any coffee in it... I KNOW! I was just as disappointed as you are right\nnow. Despite these cakes being a COMPLETE and utter lie, I love them down to the\nvery last crumb.\n\nDeceit aside, this recipe was actually quite easy to make and also involved me\nhaving to make extra crumble topping to replace the amount I ate. I'd recommend\ndoing the same for yourself :P hehe\n\n\n\nNOTE: My crumble topping came out kind of clumpy but I think that was mainly\nbecause I got lazy and didn't add the ingredients one by one as described in the\nrecipe. Instead, I decided to add everything at the same time and mix it. It\ndoesn't really change the taste that much but I imagine the cinnamon sugar taste\nis more uniformly present if you make it right.\n\nSince I didn't really make a custom version of this recipe check out the recipe \nhere [http://damndelicious.net/2014/03/24/coffee-cake-muffins/].\n\nTry the recipe out yourself and let me know what you think!!!","feature_image":"https://lh3.googleusercontent.com/Py-geJ6eWoOITUr4mZ-ZH8QUboRguSauLNU_iOrtXuND=w1440-h960-no","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c282","name":"crumble","slug":"crumble"},{"id":"5c47a6f22037ef002282c29b","name":"cinnamon","slug":"cinnamon"}]}}]}},"pageContext":{"slug":"crumble","limit":6,"skip":0,"numPages":1,"currentPage":1}}