{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c374","uuid":"e33aab41-f24a-4fd2-a9db-938e0ec44ff7","title":"I Quinoa Believe It's a Veggie Patty","slug":"quinoa-veggie-burger","published_at":"27 March, 2015","plaintext":"\n\nWhenever I'm home, my mom sometimes sautés some vegetables and keeps them for me\nto use with whatever I make for lunch. Usually that ends up being some simple\npasta, vegetable fajitas, or toppings on a veggie burger. This time, I figured,\nwhy not try something different and make a veggie patty using these vegetables!\n\nIt ended up being some kind of frittata/omelets/burger patty thing. While I may\nnot be entirely sure what to call it, it tasted wonderful. And to my delight, it\nphotographed really well! I actually ate the patty by itself but you could\ndefinitely eat these inside a burger or chopped up in a salad. So many options!\n\n\n\n\n\nQuinoa Veggie Patty\nRecipe inspired by\nhttp://www.halfbakedharvest.com/epic-crispy-quinoa-burgers-topped-sweet-potato-fries-beer-caramelized-onions-gruyere/\n\nIngredients:\n1 cup cooked red quinoa\n 1 cup chopped mushroom\n 1/2 cup sliced zucchini\n 1/2 cup sliced squash\n 1/4 cup sliced red onion\n 1 egg\n 1 handful baby spinach\n 1 tsp red pepper flakes or dash of cayenne\n salt and pepper to taste\n lime slices for garnishing\n chopped green onion for garnishing\n Directions:\nMix all ingredients together and roll into medium-sized balls. Flatten and grill\nthe patties on a Panini press until fully cooked. I used a Panini press because\nI like the lines my burgers get, but feel free to use a skillet. Garnish with a\nfew chopped green onions and enjoy with some Italian dressing!","feature_image":"https://farm9.staticflickr.com/8645/16430694707_4453e07de4_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c258","name":"quinoa","slug":"quinoa"},{"id":"5c47a6f22037ef002282c259","name":"mushroom","slug":"mushroom"},{"id":"5c47a6f22037ef002282c25a","name":"spinach","slug":"spinach"},{"id":"5c47a6f22037ef002282c25b","name":"burger","slug":"burger"},{"id":"5c47a6f22037ef002282c25c","name":"patty","slug":"patty"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c358","uuid":"9e154487-bd40-42d8-b6a9-c7b35fe895a0","title":"DAMN SON, Those are Some Seriously Loaded Fries","slug":"damn-son-those-are-some-seriously-loaded-fries","published_at":"10 March, 2015","plaintext":"\n\nFor the few weeks, I've been bored at home while my parents are away at work.\nI've been taking some time off between graduation and when I start work next\nmonth. So when one of my friends was also bored at home during her spring break,\nshe decided to come over and join me in being a bum for a day. And what better\nfood to have while lazing around then some Mexican loaded fries.\n\n\n\nFeel free to use sour cream instead of ranch or even add guacamole and other\ntoppings you usually put on nachos! We didn't really want to leave the house and\ngo grocery shopping, so we went with whatever was in the fridge. I usually make\nmy own mexican seasoning, but feel free to replace the spices with a store\nbought seasoning if you want.\n\n\n\nMexican Loaded Fries\nThis is a very rough recipe. Feel free to throw in whatever you feel would taste\nbest!\n\nIngredients:\n½ bag of fries (I used crinkle cut)\n ranch (or sour cream)\n as much shredded cheese as you wantRefried Beans\n1 can black beans\n 1½ teaspoons cumin powder\n 1 teaspoon paprika\n salt to taste\n cayenne pepper to taste\n chili lime hot sauce to taste (optional)Pico De Gallo Salsa\n3 roma tomatoes diced\n ½ large onion diced\n juice of ½ a lime\n salt to taste\n few sprigs of cilantro Directions:\nRefried Beans:  Pour the black beans onto a skillet on the stove. Add all of the\nspices and keep stirring until the beans are soft and are super flavorful.\n\nSalsa:Mix all the ingredients in a bowl and let it sit so that the salt and lime\ncan bring out the flavor in the tomatoes.\n\nBake the fries according to the directions on the packet. When the fries are\ndone, don't turn off the oven. Top with the bean mixture and sprinkle all the\ncheese that your heart desires. Bake the topped fries in the oven until the\ncheese has melted. Take out the fries and top with salsa and ranch. Dig in!","feature_image":"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","name":"salsa","slug":"salsa"},{"id":"5c47a6f22037ef002282c25f","name":"beans","slug":"beans"},{"id":"5c47a6f22037ef002282c260","name":"appetizers","slug":"appetizers"},{"id":"5c47a6f22037ef002282c261","name":"loaded","slug":"loaded"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c370","uuid":"d9ce1d74-5a37-463a-8cb8-d33efe58626f","title":"The Love Child of Pumpkin Pie and Tiramisu","slug":"the-love-child-of-pumpkin-pie-and-tiramisu","published_at":"27 February, 2015","plaintext":"\n\nThanksgiving in our house is quite different that the traditional American\nThanksgiving. First off, there's no turkey. Secondly, my mom\n[http://uppukhara.com]  makes a glorious display of Thanksgiving inspired Indian\ndishes! From masala dosa with cranberry chutney to stuffing upma (or bread upit)\nand spicy herb yams, we always enjoy a large variety of dishes. The only thing I\npersonally demand every year is pumpkin pie! I love pumpkin pie. The wonderful\nblend of spices and sweet, and yet it's not that sweet; perfect for someone\nwithout a strong sweet tooth!\n\nWhat do you get when you combine two of my favorite desserts in the world,\npumpkin pie and tiramisu? Basically, it's one of the greatest desserts ever\ncreated by man. I was a little skeptical about how well this combination of\nflavors would be received by all of our thanksgiving guests, but it was a hit.\nEven without adding the usual brandy, rum, or amaretto, everyone loved the\nwonderful blend of flavors.\n\nOne warning I have about this recipe is that you should be careful in blending\nthe cornstarch mixture into the pumpkin creme. If this step is not done\nproperly, you will have cornstarch lumps in your tiramisu and that is just\ngross.\n\n\n\n\n\n\n\nPumpkin Tiramisu\nRecipe modified from\nhttp://www.nytimes.com/projects/well/vegetarian-recipes/#recipe/pumpkin-tiramisu\n\nIngredients:\nPumpkin Creme\n⅓ cup cornstarch\n ¼ cup water\n ¾ cup milk\n 1 (15-ounce) can pumpkin puree\n ¾ cup maple syrup\n ¾ teaspoon allspice\n ¾ teaspoon cinnamon\n ¾ teaspoon nutmeg\n ½ teaspoon salt\n Tiramisu\n1 pot black coffee\n 1 package lady finger biscuits\n 16oz mascarpone cheese\n ground chocolate for garnishing\n Directions:\nTo make the Pumpkin Creme:  In a small bowl, thoroughly mix cornstarch and water\nwith a whisk or fork until there are NO LUMPS  and set aside. In a medium\nsaucepan, whisk together milk, pumpkin puree, maple syrup, spices and salt, and\nheat over medium heat until it just begins to boil, about 5 minutes. Slowly\ndrizzle cornstarch mixture into the saucepan, whisking continuously. Cook until\nthe mixture becomes very thick, about 5 minutes, whisking frequently. Pour the\ncreme into a bowl and let cool about 15 minutes. Cover the bowl with plastic\nwrap so that the plastic wrap is touching the top of the creme. Refrigerate for\na few hours or overnight.\n\nTo assemble:  Soak each lady finger biscuit in coffee for a few seconds and\nquickly place in a large dish. Spread a layer of Pumpkin Creme on top. Repeat\nthis process for as many layers fill up the dish or all the components run out.\nAlternate spreading a layer of Pumpkin Creme and mascarpone cheese between\nlayers of biscuit.","feature_image":"https://farm8.staticflickr.com/7398/16297798177_79beaa8237_o.jpg","tags":[{"id":"5c47a6f22037ef002282c238","name":"tiramisu","slug":"tiramisu"},{"id":"5c47a6f22037ef002282c240","name":"pumpkin","slug":"pumpkin"},{"id":"5c47a6f22037ef002282c241","name":"thanksgiving","slug":"thanksgiving"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c383","uuid":"64999048-482e-4f3b-9b9b-dc46e14cb5c8","title":"Brunch Conquers All","slug":"brunch-conquers-all","published_at":"14 February, 2015","plaintext":"\n\nWhen I was younger, my family rarely did breakfast all together; on weekdays we\nwere all rushing around, and on weekends we would all emerge from our rooms at\nour own times, grazing on whatever acceptable breakfast food was around. For\nmany years, breakfast on Saturday meant spending the entire morning alone on the\ncouch, watching cartoons, dodging my mother's attempts to make me a productive\ncitizen, and eating sugary cereal with abandon. Occasionally, we would have\nguests and my mother would cook some traditional Indian breakfast items - dosa,\nroti, upma, etc. - and we would have brunch. But these days were usually paired\nwith pre and post cleaning and formal clothing, so while we loved the company,\nthe whole situation was no bueno.\n\nIt wasn't until I got to college that I really understood brunch. On our campus,\nLandon dining hall had the most amazing brunch you can imagine - everything from\nice cream to omelettes to fresh fruit and berries was represented, and you could\nliterally eat your heart out. In addition to that, we lived in close proximity\nto Golden Harvest, a small brunch area in Lansing that has a following that\nborders on obsessive. In East Lansing, brunch does not just pass you by, and\nfrom the minute I stepped into Landon, with a slight headache and stomache,\ncraving grease and comfort food, I was a convert.\n\n\n\nBrunch is neither breakfast nor lunch; it's an in between meal, and as such,\ndoesn't have the conventions of the other two. You can enjoy some giggle juice\nwith brunch. You can dip strawberries in chocolate and throw it on a waffle with\nsugar and it won't count as dessert. You can show up all smelly at your best\nfriend's house at eleven o'clock, post late wake up call and workout, demand\neggs, toast, and avocados, and call THAT brunch.\n\nYou can wake up at eight AM and race to Golden Harvest, wait in line for over an\nhour and a half in the freezing cold, and earn your brunch. Or you can have a\nlie in at home and make yourself some waffles or toast and watch television, and\nit could be the most lovely brunch you'll ever have.\n\n\n\nBrunch is the most welcoming of the meals.\n\nBrunch is patient, brunch is kind. It does not envy, it does not boast, it is\nnot proud. It is not rude, it is not self-seeking, it is not easily angered, it\nkeeps no record of wrongs. Brunch does not delight in evil but rejoices with the\ntruth. It always protects, always trusts, always hopes, always perseveres.\nBrunch never fails.*\n\nBrunch is love, y'all. Show someone a little love and pan fry some potatoes and\nthrow a poached egg on top. Give yourself a little treat and stick an overeasy\nfried egg in a sandwhich with some mixed greens and tomatoes. Use avocado\nliberally, and consider experimenting with sriracha and truffle oil. Kale and\nwhite sugar are both invited to this party, because brunch does not\ndiscriminate.\n\nLet your creative juices and chocolate sauce flow; brunch is a meal without\nprotocol or limitations, and you definitely deserve that business in your life.\n\n\n\n*I took some creative licenses with Corinthians 13:4-8a. I did it with utmost\nrespect for the original verse.","feature_image":"https://farm6.staticflickr.com/5612/15837068312_eeff7d20e1_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c23b","name":"eggs","slug":"eggs"},{"id":"5c47a6f22037ef002282c23c","name":"hash","slug":"hash"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23e","name":"sandwich","slug":"sandwich"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c24e","name":"love","slug":"love"},{"id":"5c47a6f22037ef002282c2a4","name":"valentines day","slug":"valentines-day"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34d","uuid":"7021b7b8-3bef-4bf1-ab64-7a42245fdc06","title":"Taco Tuesday!","slug":"taco-tuesday","published_at":"10 February, 2015","plaintext":"\n\nOne of the coolest thing about restaurants and coffee shops that open franchises\ninternationally is that they tend to adapt their menu to the tastes of the\ncountry the store is in. For example, McDonald's in India actually has\ncompletely vegetarian options. Due to the large  population of vegetarians in\nIndia, McDonald's has 2 segregated kitchens for vegetarian and non-vegetarian\nfood. In addition, they don't serve any beef items, in contrast to the\nMcDonald's in the US, which is primarily beef burgers. Honestly, I love\nMcDonald's in India! They've managed to merge Indian flavors into simple\nAmerican burgers and come out with amazing dishes such as the McSpicy Paneer and\nMcAloo Tiki Burger. If you haven't yet, you should definitely try the McSpicy\nPaneer Burger, it's my favorite! :)\n\n\n\nMy cousin recently had a major craving for Mexican food. The only problem is\nthat we're in India and the Mexican food available doesn't taste quite the same\nnor as authentic. In order to quench our cravings, we even tried going to Taco\nBell, which has a new item called the Paneer Tikka Masala Burrito! Unfortunately\nthe menu had been too Indianized and no longer tasted Mexican. While this style\nof Taco Bell is very popular with people in India, it doesn't quite measure up\nto the Taco Bell we have in the US.\n\n\n\nOur best bet was to figure out how to make it our selves. Unfortunately we did\nrun into a few bumps along the road:\n\n 1. It is a lot harder to find iceberg lettuce in Bangalore than originally\n    suspected. Iceberg lettuce isn't really in any kind of Indian food therefore\n    only available at some special markets rather than on every street vegetable\n    cart.\n\n\n\n 2. Many people tend to substitute dahi for sour cream out of convenience,\n    however, this doesn't have quite the same taste. Conveniently, we found a\n    fairly easy recipe\n    [http://www.tarladalal.com/Sour-Cream-(--Wraps-and-Rolls)-32623r]  on how to\n    make our own homemade sour cream! Tarla Dalal [http://www.tarladalal.com] \n    to the rescue!\n\n\n\n 3. Making the refried beans for the tacos ended up being extremely time\n    consuming. If I had been in the US, I could have just bought a can of beans,\n    cooked them with some cumin and cayene pepper and been done with it. I\n    completely took for granted the preparation needed to make refried beans.\n    First you needed to soak and cook the beans until they were soft, and then\n    cook them in a pan with the appropriate seasoning. This took much longer\n    than I had originally expected.\n\n\n\nWe realized even making tortillas by hand wouldn't be so bad. Every morning, the\ncook at my grandparents house makes chapatis from scratch. Tortillas are\nesentially chapatis made from normal flour, not wheat. So my grandmother quickly\nwhipped up a huge ball of dough for us to roll out and make into tortillas.\n\n\n\n\n\nNo taco would be complete without salsa! We made 2 different types of salsa,\ncorn with jalapenos and pico de gallo salsa. Both salsas are extremely easy to\nmake. For the corn salsa, you just need to combine boiled sweet corn kernels,\ndiced jalapenos, lemon juice, salt, and some cilantro. Mix it together and\nviola! You have salsa. Similarly, if you mix diced tomatoes and onions, minced\ngarlic, cilantro, and lemon juice you get pico de gallo salsa. Both can be made\nvery quickly and are fresh and delicious!\n\n\n\n\nSurprisingly everything turned out really tasty and me and my cousin happily\nenjoyed delicious Mexican food for the next 2 days! :) My cousin loved it so\nmuch, she ate it for breakfast, lunch, AND dinner for the next 2 days. Mission\nSuccess!","feature_image":"https://farm8.staticflickr.com/7450/16401091685_d0ed039ea7_o.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c244","name":"tacos","slug":"tacos"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c377","uuid":"5ebea30f-90a4-4799-b90f-666b7ffe5d0a","title":"It's about \"Pho\"-king time!","slug":"its-about-pho-king-time","published_at":"31 January, 2015","plaintext":"\n\nBefore 2 summers ago, I had never experienced Pho. Once I tasted it, I knew that\nI had been missing out on something delicious my entire life. Pho is a simple\nvietnamese noodle soup. Traditionally, it is made with beef or chicken with some\nmeat broth, which gives it its rich flavor. However we found a vegetarian way of\nmimicking the flavor! There's a great recipe here\n[http://ohmyveggies.com/30-minute-vegetarian-pho/]  that also had some great\nflavors.\n\nPho works best if you have fresh bean sprouts, jalapenos, and basil. When you\ndrop these into your soup, it brings out the most amazing flavors. I also\nchopped some onions, cilantro and some green onions for a little something\nextra.\n\n\n\nThe first step in the process is preparing the stock. My mom and I made a\nvegetable stock using celery, carrots, and onions among other things. All you\nneed to do is simmer vegetables and herbs in a pot and after 30-40 minutes it\nshould be done! You can also use store bought stock, as that is likely far less\nlabor intensive! If you don't mind chicken or beef broth, feel free to use one\nof those instead and add some cooked shredded chicken or beef too.\n\nNext, you want to prepare your noodles - you can buy premade rice noodles, or\nget dry noodles and cook them yourself. But be careful; if they come pre-cooked\nand packaged they may be extremely fragile and broken. This is what happened to\nme, as you can see from my pictures. Ideally, the noodles shouldn't break the\nminute you pick them up with your chopsticks.\n\n\n\nNow all that's left for you to do is to pour yourself a bowl of hot broth, toss\nsome noodles, vegetables and garnishes and top it off with some sauces.\nPersonally, I just use a little hoisin sauce and chili garlic sauce but feel\nfree to add soy sauce, sriracha, basically anything you want! The best part\nabout Pho is that it can be easily modified to suit each individual's taste!\n\nIf you haven't already, drop everything you're doing, go to the nearest\nVietnamese restaurant and dive into a HUGE bowl of Pho!","feature_image":"https://farm6.staticflickr.com/5615/15837085352_70e3c9fa9c_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c236","name":"pho","slug":"pho"}]}}]}},"pageContext":{"limit":6,"skip":48,"numPages":10,"currentPage":9}}