{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Dear Sumedha, (a love letter)","slug":"galentines-day-scones","feature_image":"https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg","published_at":"15 February, 2016","html":"<p>I've been watching Parks and Recreation lately, and I am constantly inspired by the friendships Leslie cultivated with the women in her life. So, this post, I'm taking a page out of her book, and writing a love letter to Sumu, my co-writer, soul sister, and fellow adventurer.</p>\n<p>Special shout-out to the lady who taught me how to be a friend; my mom. My mom is intelligent, beautiful, and determined. But above all, she's caring and real. She has a loving and compassionate heart, and seeing her with her friends is something I will always cherish. I am so glad that we've grown into a friendship. I'm the lame kid whose mom is her best friend. And I am really really really lucky.</p>\n<p><img src=\"https://pramods.box.com/shared/static/w65ikv2f7p9cikic7cfgohsnl30monso.jpeg\" alt=\"\"></p>\n<p>Dear Sumedha,</p>\n<p>Thanks for being amazing. For coming to the rescue every time my pictures are sideways, or I can't figure out my own cellphone. For bringing Mindy's and Aziz's books home because you knew I was dying to read them, making me a scrapbook so I wouldn't have to make my own, and putting together an otter watching road trip itinerary, so that I could go on a stress free but totally planned ride.</p>\n<p>Thanks for putting up with me when I get temporarily obsessed with boy bands. Thanks for laughing at me when I snap back to my senses. With your love, nobody can drag me down.</p>\n<iframe src=\"https://embed.spotify.com/?uri=[https://play.spotify.com/track/70OTIpw8x8UXUsuCHW9i1i]\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Thanks for being brown with me. And watching Meet the Patels with me over the phone. This is what dreams are made of.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ab4cjd78mehqrd0dy00zex9e7isvgu0i.jpg\" alt=\"\"></p>\n<p>Thanks for always reassuring me about my admittedly glorious self, and being honest but kind when I look bad in something. Thanks for encouraging my dreams, and constantly believing in me. You are the person I send selfies to when I feel good about myself, and I love that about our relationship.</p>\n<p>You're incandescent, smart, lovely, talented, kind, caring, and authentic. You are an incredible friend, which is perhaps one of the best things I could say about a person. I am so lucky to have you in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/hbi46on7awfpk8te5ce1o79ai8wn4ju8.jpg\" alt=\"\"></p>\n<p>Thanks for being my otter watching and blog partner. Thanks for being the Joey to my Chandler, the Ann to my Knope, and the Tina to my Amy.</p>\n<p><img src=\"https://pramods.box.com/shared/static/c5kl7gputj9wtxoxg752vpc90yh51njq.png\" alt=\"\"></p>\n<p>Also, thanks for being the first of the two of us to not post on her day. It really took the pressure off of me (I think we BOTH thought it would be me!), so thanks. I love you, man.</p>\n<p>In honor of our friendship, Friends, and Valentines Day itself, I made scones. I hope you like them.</p>\n<p><img src=\"https://pramods.box.com/shared/static/alz3hmrfnxx5jg01e9bfshpzuoqjx9jc.jpg\" alt=\"\"></p>\n<p>&lt;3 Anu</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Apricot - Pistachio Scones</h2>\n    <div class=\"summary\">\n      <p><em>These scones are part whole wheat, part all purpose flour, and I think they would benefit from the addition of a floral note. If it's available to you, I would try adding orange blossom water or rose water, and experimenting a bit. \n<p>\nAlso, the Xanthan gum is optional. If you do use it, I used Bob's Red Mill. I've never used it before, and I found it to be really helpful in keeping the dough together, but a lot of recipes I read didn't use it, and the recipe authors in those cases were fine. \n![](https://pramods.box.com/shared/static/zrfxkw1s664clf43v12y5lmefqryahzc.jpg)\n</p></em></p>\n      <p>Yield: 12 scones</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Scones</h4>\n          <li class=\"ingredient\">1 1/4 C All Purpose Flour</li>\n          <li class=\"ingredient\">3/4 C Whole Wheat Flour</li>\n          <li class=\"ingredient\">1/2 Tsp Cardamom</li>\n          <li class=\"ingredient\">1 1/2 Tsp Cinnamon</li>\n<li class=\"ingredient\">3 Tbsp Sugar </li>\n<li class=\"ingredient\">2 Tsp Baking Powder</li>\n<li class=\"ingredient\">1 Tsp Salt</li>\n<li class=\"ingredient\">1/3 C Pistachios</li>\n<li class=\"ingredient\">1/2 C Dry Apricots</li>\n<li class=\"ingredient\">3/4 C Cashews</li>\n<li class=\"ingredient\">1 Tbsp Xanthan Gum</li>\n<li class=\"ingredient\">Maple Syrop (for brushing the tops)</li>\n<pre><code>  &lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;right&quot;&gt;\n  &lt;h3 id=&quot;directions&quot;&gt;Directions:&lt;/h3&gt;\n  &lt;div class=&quot;instructions&quot;&gt;\n    &lt;p&gt;\n    1.) Preheat the oven to 375 F, and oil/grease a cookie sheet. Put Cashews and Xanthan Gum in a bowl, and add boiling water to submerge cashews. You want to let the cashews hydrate a bit while you're mixing up other stuff.\n</code></pre>\n<p>\n2.) Chop your apricots into bits - 1/4 - 1/2 inch in size, and put them in a bowl. Add boiling water to those too - re-hydrating them keeps them juicy during the baking process. \n</p><p>\n3.) Mix your flours, salt, baking powder, sugar, cardamom, and cinnamon. Make sure all ingredients are fully mixed in. \n</p><p>\n4.) Roughly chop your pistachios, and throw them into the flour. Give it a quick toss to make sure your pistachios are even incorporated. \n</p><p>\n5.) Drain the apricot water into the bowl with cashews and Xanthan gum. Throw the cashews, gum, and some water into the blender. You want it to be the consistency of a thick greek yogurt, so add as much water as you need to get it there, a little bit at a time. \n</p><p>\n6.) Add your apricots to the flour and give it a quick toss, making sure the apricots are even through the dough. \n</p><p>\n7.) Add your cashew mixture a half cup at a time, until the dough is slightly sticky, and shaggy, but holds together. You don't want to over-knead. This is VERY IMPORTANT. DO NOT OVER-KNEAD. \n</p><p>\n8.) Once your dough has just come together, dump it onto a floured surface, and fold it over twice - once top to bottom, flatten out, then from the other side. THAT'S IT. LEAVE IT ALONE. It's done. \n</p><p>\n9.) Form into a disk about 1 - 1/2 inch thick, and cut into whatever shape you want. I went with the classic triangles, but it's up to you. \n</p><p>\n10.) Brush the bottoms with a touch of flour, and the tops with maple syrup. Pop into the oven, and bake for 15 - 20 minutes. I checked on them at 15, and discovered that they needed a bit more time to not be dense and dough-y. \n</p><p> \n11.) Eat piping hot! Slice them open, enjoy them with a bit of additional maple syrup or a pat of butter, and a delicious cup of tea!\n        </p>\n      </div>\n    </div>\n  </div>\n</div>","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d7","name":"scones","slug":"scones"},{"id":"5c47a6f22037ef002282c2d8","name":"greatbritishbaking","slug":"greatbritishbaking"},{"id":"5c47a6f22037ef002282c2d9","name":"galentinesday","slug":"galentinesday"},{"id":"5c47a6f22037ef002282c2da","name":"valentinesday","slug":"valentinesday"},{"id":"5c47a6f22037ef002282c2db","name":"parksandrecreation","slug":"parksandrecreation"},{"id":"5c47a6f22037ef002282c2dc","name":"leslieknope","slug":"leslieknope"},{"id":"5c47a6f22037ef002282c2dd","name":"leslieandann","slug":"leslieandann"},{"id":"5c47a6f22037ef002282c2de","name":"amypoehler","slug":"amypoehler"}]}},"pageContext":{"slug":"galentines-day-scones","previous":{"html":"<p>Welcome to another trip to India! When I was there, I ate a ton of food. All of my family members were happy to feed me, and between the amazing home cooking, and the delicious food available on every street corner, it's almost a miracle that I didn't pack on pounds.</p>\n<p>I am, generally, pretty picky about my food. I waver between being vegan and vegetarian, and I'm usually pretty careful about ingredients I allow in my kitchen. But, like everyone else, I have a fatal flaw and it's this; I love street food.</p>\n<p>I know that someone involved didn't wash their hands, I know that the ingredients aren't always top notch, I know that the fat, salt, and sugar content is probably WAY higher than anything I should be consuming. But I don't particularly care.</p>\n<p>In India a &quot;gaadi&quot; is a vehicle, and &quot;chaat&quot; is street food that has fresh vegetable, puffed rice, sweet and spicy sauces, and some fried components. So &quot;gaadi chaat&quot; is street food you get out of a flat bed cart.</p>\n<p>In Bangalore, there's a street people refer to as &quot;chaat street,&quot; and the street is lined with street food vendors. One end has a bakery, and the other end (the end I like to start on) has a few fruit carts, and one &quot;corn&quot; cart. I usually get my corn spiced with salt and chili, and mixed with raw, unripe mangoes (delicious!)</p>\n<p><img src=\"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg\" alt=\"imagine yummy food here, cuz you're missing it!\"></p>\n<p>Then it's time for Masala Chaat! This is one of my absolute favorites; it features a thick, spicy lentil soup layered atop crispy, crackly puris (indian &quot;chips&quot; and under sweet and spicy chutney, some fresh onion and cilantro, and a sprinkle of &quot;chaat masala.&quot;</p>\n<p><img src=\"https://pramods.box.com/shared/static/gmg1xnscaj3hsaqurjkezft7d1pn8rbj.jpg\" alt=\"\"></p>\n<p>It's The Chaat Shop!</p>\n<p>Next up: Gobi Manchurian. Cauliflower dipped in dough and deep fried, then dredged in fresh onion and cilantro, and delicious, spicy, tomato-ey garlic-y sauces.</p>\n<p><img src=\"https://pramods.box.com/shared/static/oolk1yrswjqb9wmq7piboh797nv9lkii.jpg\" alt=\"\"></p>\n<p>This is the Gobi Manchurian man! He also makes noodles. He is obviously supremely talented.</p>\n<p>Now that you're ALMOST too full (because you've eaten your way down the street) it's time for dessert! There's a bakery you can step into, vendors with all kinds of sweets and shaved ice, and (my personal favorite) Mango Kulfi!</p>\n<p><img src=\"https://pramods.box.com/shared/static/g5tfhr9guqtbm7tlinl65rw3eqdczkk8.jpg\" alt=\"\"></p>\n<p>Go to bed. It's been a long day, and you're long overdue for a satisfying food coma.</p>\n","title":"Gaadi Chaats","slug":"bread","published_at":"08 February, 2016","feature_image":"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg","tags":[{"id":"5c47a6f22037ef002282c2d5","slug":"chaat"},{"id":"5c47a6f22037ef002282c245","slug":"india"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c6","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d6","slug":"street-food"}]},"next":{"html":"<p>I konw this post can't come close to as sweet as the one Anagha wrote this week. But I pinky promise, in addition to making up for last weeks missing post, I will also make up for Valentine's day. I know, I know... lots of promises but you don't mess with pinky promises!</p>\n<p>You knew this song was coming... don't lie. Just relish in the throwback and ketchup on some food blog reading ;)</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:6RcQOut9fWL6FSqeIr5M1r\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>Since this past weekend was the SUPERBOWL I had this whole great plan on how I was going to post about what I made to eat then. But of course my inner Dory came out and I forgot to upload all the tantalizing pictures I took. A specific friend of mine, <em>cough cough Breane</em>, had requested the recipe so I TOTALLY apologize for my brain fart and promise I'll post it next week! But until then, you'll have to bear with me and enjoy this post instead :).</p>\n<p>So personally, I think my mom is the QUEEN of making banana bread. Like, seriously. Her banana bread the most glorious thing since, well, sliced bread (badum chhhhhhhhh). It's the perfect combination soft and moist and not too sweet. Of course, my banana bread can never live up to that standard but, hey, I can try!</p>\n<p><img src=\"https://pramods.box.com/shared/static/kvkxvgrndzsbsfjbpa938jq142jrlgpl.jpg\" alt=\"\"></p>\n<p>One thing I've learned about all of my mom's recipes is that her measurements aren't always... Exact. She always shows me measurements using the length of her fingers. Problem is we have different sized hands AND how do you quantify that measurement so that you can replicate it? I've tried SO many times to get teaspoon measurements for everything but can't say I've been entirely successful. This is the sole reason I haven't been able to make my food taste like my mom's food.</p>\n<p>Anyways, a girl can try right? Now back to her mind-BLASTING banana bread.</p>\n<p><img src=\"http://cdn.meme.am/instances/55172211.jpg\" alt=\"Insert Russell Peters Gif Here\"></p>\n<p>Many of my friends are aware that I don't particularly have a sweet tooth. I mean sure I get cravings on occasion, however, banana bread has always been one of my favorite things, mainly because it's just the right level of sweetness. It has a strong taste of vanilla and of course banana! What could be better?!</p>\n<p>Once when I was having said cravings, I really really wanted to eat my mom's banana bread. So I decided to do my own take on her recipe, I know already going downhill, by adding zucchini and carrot. You know, hiding a little bit of healthy things in there to make you feel better about eating desserts.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fk4kesqhxueed5q00j41f9gbjib2vgwo.jpg\" alt=\"\"></p>\n<p>It actually came out pretty good, not quite mom level, but still pretty amazing. I may have eaten an embarrassingly large number of these muffins. Let me know what you think!!!</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Zucchini Carrot Banana Bread Muffins</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">1/2 cup shortening</li>\n          <li class=\"ingredient\">1 cup sugar</li>\n          <li class=\"ingredient\">2 eggs</li>\n          <li class=\"ingredient\">4 mashed bananas</li>\n          <li class=\"ingredient\">1 tsp lemon juice</li>\n          <li class=\"ingredient\">2 cups sifted flour</li>\n          <li class=\"ingredient\">1/2 tsp salt</li>\n          <li class=\"ingredient\">1 cup chopped nuts</li>\n          <li class=\"ingredient\">1 zucchini, shredded</li>\n          <li class=\"ingredient\">1 carrot, shredded strips</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Cream shortening and sugar together. Beat eggs until light and add. Mix in bananas and add lemon juice. Blend with creamed mixture. Sift flour, baking powder and salt together and mix quickly into the banana mixture. Add the nuts, zucchini, and carrots and mix. Pour batter into cupcake pans and bake at 375 degrees about 30 minutes, or until a toothpick comes out clean when you poke it.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/ksfz88a49rm9j2ztujqfusuoyoidu0wp.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg\" alt=\"\"></p>\n","title":"This Shit is Bananas, B-A-N-A-N-A-S","slug":"this-shit-is-bananas-b-a-n-a-n-a-s","published_at":"18 February, 2016","feature_image":"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg","tags":[{"id":"5c47a6f22037ef002282c255","slug":"desserts"},{"id":"5c47a6f22037ef002282c281","slug":"cake"},{"id":"5c47a6f22037ef002282c296","slug":"bananas"},{"id":"5c47a6f22037ef002282c294","slug":"zucchini"},{"id":"5c47a6f22037ef002282c295","slug":"carrot"},{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"}]}}}