{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c365","uuid":"4f72efc4-4172-4a09-a4ad-9aa43784c7d8","title":"Well Son, When a Croissant Loves a Donut...","slug":"well-son-when-a-croissant-loves-a-donut","published_at":"27 June, 2015","plaintext":"\n\n(Here's some music for inspiration :P)\n\nIn 2013, New York was swept over with a new kind of fever.... Cronut Fever. A\nchef in New York City decided that he would take croissant dough and fry it like\na donut. This scrumptious flaky dessert became SO  popular that there was even a\nblack market for them! People would pay $100 on the black market for a cronut\nthat could be bought for $5 if they waited in line for a day.\n\nI'd never tasted a cronut before in my life, so I decided to make use of a bunch\nof stale croissants I had lying around after a road trip. I tore the croissants\ninto bite size pieces and fried them in hot oil and count to 4. Quickly flip\neach cronut and fry again for 4 counts. Make sure not to cook them for too long\nor they get a little too crunchy and burn.\n\n\n\nPlace the fried bites onto paper towels to drain any excess oil. When cooled,\ndrizzle with any icing of your choice or enjoy them by themselves!\n\nThey were flaky yet crunchy, salty yet buttery. It was amazing! I completely\nunderstand what the fuss was in New York City at the time.\n\n\n\n\n\nHowever, I learned a few things while making these. Making them with\nstore-bought croissants is fine, however you get the proper ratio of flakiness\nto fried crunchiness when you use croissant dough. It is also easier not to burn\nthem while frying when you use dough. I am not a huge fan of too much oil, so\nfrying the croissants wasn't my favorite. Maybe there's a way to shallow fry\nthem where they won't pick up too much oil, but I have no idea. Next time I try\nmaking cronut bites, I will try to bake store-bought croissants and see if that\nmakes a difference. Who knows!\n\nFor the mean time, I completely suggest you try making these at home! They're\nsimple to make and taste amazing! If you're too lazy then I'd recommend going to\nyour local pastry shop and seeing if they make something similar!","feature_image":"https://lh3.googleusercontent.com/I3bLdLcbLHBZH2QIeDqAX55etYu-5I1Tz94-7LJ62KRW=s800","tags":[{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c283","name":"cronut","slug":"cronut"},{"id":"5c47a6f22037ef002282c284","name":"fried","slug":"fried"},{"id":"5c47a6f22037ef002282c285","name":"croissant","slug":"croissant"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37a","uuid":"38072c55-2abc-41d8-8cd1-7c995002e516","title":"Little Bites of Heaven","slug":"little-bites-of-heaven","published_at":"05 May, 2015","plaintext":"\n\nI LOVE baking but since I don't really like eating desserts its usually pretty\nhard to come up with reasons to actually make anything. I usually just end up\nmaking really small quantities which barely justifies all the ingredients I\nwould have needed to get to make the desserts. At work I noticed that anytime\nsomeone brought in donuts or anything else, people would hunt the food down and\ndevour it. Figuring this the was the best opportunity to kill two birds with one\nstone, so I whipped up a few batches of the brownies and brought them to work.\n\nFirst, I sent an email to my team and only a few people grabbed some. I thought\nI had made a complete mistake making so many brownies, or maybe I was delusional\nabout how the brownies tasted since I had made them. As a last option, I sent an\nemail out to the whole company and left them in the common area of my floor.\nTwenty minutes later when I went to go check on them, I saw an empty box.\nClearly the brownies had been a huge hit! Now that I've found the perfect group\nto sample all of my treats, I can bake without worries! My coworkers can expect\na flood of baked goods at least once a month from here on out while I use them\nas guinea pigs for all the different desserts I've always wanted to make! :)\n\n\n\n\n\nPersonally, I'm not a huge fan of cheesecake, but these little bites are\namazing. At first when I bit into one, it was perfectly gooey and chocolatey and\nwith a little bit of cheesecake to top off the flavor. I honestly wasn't sure if\nI hadn't cooked them all the way, but after thoroughly inspecting and devouring\na few, I realized that that's just the way the brownies cook! Each brownie was\nperfectly gooey yet filled with flavors just melting in your mouth. The\ncheesecake portion was the perfect compliment for the sweetness of the brownies.\nTry the recipe yourself and let me know how you like it!\n\nChocolate Chip Cheesecake Brownie Bites\nIngredients:\nBrownie Part:\n¾ cup melted unsalted butter\n 1¼ cup sugar\n 1 cup unsweetened cocoa powder\n ¼ tsp salt\n 1 tsp vanilla extract\n 2 large eggs\n ½ cup all-purpose flour\n ¾ cups semi-sweet chocolate chips\n Cheesecake Part:\n8 oz softened cream cheese\n ½ cup sugar\n ¼ tsp vanilla extract\n 1 egg yolk\n Directions:\nPreheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and\nkeep it aside. I used a mini cupcake pan but feel free to use a normal size\ncupcake pan if you want bigger brownies!\n\nBrownie Part: Mix the cocoa, sugar, salt, melted butter, and vanilla together.\nMix the eggs into this mixture until the batter is fully mixed. Add the\nchocolate chips (more if you want it super chocolatey :D) and keep aside.\n\nCheesecake Part: In a separate bowl, mix all the cheesecake ingredients together\nuntil smooth.\n\nFill each well in your cupcake pan ¾ full with brownie batter. Add a spoonful of\ncheesecake batter on top of the brownie batter in each well and swirl the\ncheesecake and brownie parts together! Put the pan in the oven and bake for\nabout 20 minutes (I used a 24 mini cupcake pan so it was 20 minutes for me but\nif you have use a smaller/larger pan adjust the time accordingly).","feature_image":"https://farm9.staticflickr.com/8772/17361867465_b5793fb7f7_b.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c273","name":"brownies","slug":"brownies"},{"id":"5c47a6f22037ef002282c274","name":"mini","slug":"mini"},{"id":"5c47a6f22037ef002282c275","name":"swirl","slug":"swirl"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c346","uuid":"6f57be9e-a31d-449e-ba29-b0f2b7c8535e","title":"Galentine's Day Cupcakes","slug":"galentines-day-cupcakes","published_at":"01 May, 2015","plaintext":"\n\nWhat's Galentine's Day you ask? No one could have answered that question better\nthan Amy Poehler herself, \"it's only the best day of the year. Every February\n13th, my lady friends and I leave our husbands and our boyfriends at home, and\nwe just come and kick it, breakfast-style. Ladies celebrating ladies. It's like\nLilith Fair, minus the angst. Plus frittatas.\"\n\nEver year on Valentine's Day, my mom sends me a special gift. When I lived it at\nhome, she used to give me and my brother cute small stuffed animals with hearts\non them. When I moved to Ann Arbor for college, she took a different approach.\nEvery year, she would send me a heart shaped pizza with my favorite toppings,\nMUSHROOMS!\n\nThis past Valentine's Day, however, I was in India so neither was possible. So\nmy cousins and I decided to celebrate Galentine's Day instead! We made some\ndelicious red velvet cupcakes from scratch, enjoyed some leftover batter, and\nwatched some light hearted chick flicks. All in all, a great way to celebrate\nour fellow ladies.\n\n\n\nWe were pretty lazy about experimenting with the recipe so I will just leave you\nwith the recipe we used\n[http://sallysbakingaddiction.com/2014/10/29/red-velvet-cupcakes/]  for the\ncupcakes and made a basic chocolate icing following the instructions on the bag\nof confectioners sugar.\n\n\n\n\n\n\n\n\"February 14th, Valentine's Day, is about romance. But February 13th,\nGalentine's Day, is about celebrating lady friends. It's wonderful and it should\nbe a national holiday.\"\n\n * Leslie Knope","feature_image":"https://farm9.staticflickr.com/8573/16406140367_5c5b265be3_b.jpg","tags":[{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c254","name":"galentines day","slug":"galentines-day"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c256","name":"red velvet","slug":"red-velvet"},{"id":"5c47a6f22037ef002282c257","name":"valentines day","slug":"valentines-day-2"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c370","uuid":"d9ce1d74-5a37-463a-8cb8-d33efe58626f","title":"The Love Child of Pumpkin Pie and Tiramisu","slug":"the-love-child-of-pumpkin-pie-and-tiramisu","published_at":"27 February, 2015","plaintext":"\n\nThanksgiving in our house is quite different that the traditional American\nThanksgiving. First off, there's no turkey. Secondly, my mom\n[http://uppukhara.com]  makes a glorious display of Thanksgiving inspired Indian\ndishes! From masala dosa with cranberry chutney to stuffing upma (or bread upit)\nand spicy herb yams, we always enjoy a large variety of dishes. The only thing I\npersonally demand every year is pumpkin pie! I love pumpkin pie. The wonderful\nblend of spices and sweet, and yet it's not that sweet; perfect for someone\nwithout a strong sweet tooth!\n\nWhat do you get when you combine two of my favorite desserts in the world,\npumpkin pie and tiramisu? Basically, it's one of the greatest desserts ever\ncreated by man. I was a little skeptical about how well this combination of\nflavors would be received by all of our thanksgiving guests, but it was a hit.\nEven without adding the usual brandy, rum, or amaretto, everyone loved the\nwonderful blend of flavors.\n\nOne warning I have about this recipe is that you should be careful in blending\nthe cornstarch mixture into the pumpkin creme. If this step is not done\nproperly, you will have cornstarch lumps in your tiramisu and that is just\ngross.\n\n\n\n\n\n\n\nPumpkin Tiramisu\nRecipe modified from\nhttp://www.nytimes.com/projects/well/vegetarian-recipes/#recipe/pumpkin-tiramisu\n\nIngredients:\nPumpkin Creme\n⅓ cup cornstarch\n ¼ cup water\n ¾ cup milk\n 1 (15-ounce) can pumpkin puree\n ¾ cup maple syrup\n ¾ teaspoon allspice\n ¾ teaspoon cinnamon\n ¾ teaspoon nutmeg\n ½ teaspoon salt\n Tiramisu\n1 pot black coffee\n 1 package lady finger biscuits\n 16oz mascarpone cheese\n ground chocolate for garnishing\n Directions:\nTo make the Pumpkin Creme:  In a small bowl, thoroughly mix cornstarch and water\nwith a whisk or fork until there are NO LUMPS  and set aside. In a medium\nsaucepan, whisk together milk, pumpkin puree, maple syrup, spices and salt, and\nheat over medium heat until it just begins to boil, about 5 minutes. Slowly\ndrizzle cornstarch mixture into the saucepan, whisking continuously. Cook until\nthe mixture becomes very thick, about 5 minutes, whisking frequently. Pour the\ncreme into a bowl and let cool about 15 minutes. Cover the bowl with plastic\nwrap so that the plastic wrap is touching the top of the creme. Refrigerate for\na few hours or overnight.\n\nTo assemble:  Soak each lady finger biscuit in coffee for a few seconds and\nquickly place in a large dish. Spread a layer of Pumpkin Creme on top. Repeat\nthis process for as many layers fill up the dish or all the components run out.\nAlternate spreading a layer of Pumpkin Creme and mascarpone cheese between\nlayers of biscuit.","feature_image":"https://farm8.staticflickr.com/7398/16297798177_79beaa8237_o.jpg","tags":[{"id":"5c47a6f22037ef002282c238","name":"tiramisu","slug":"tiramisu"},{"id":"5c47a6f22037ef002282c240","name":"pumpkin","slug":"pumpkin"},{"id":"5c47a6f22037ef002282c241","name":"thanksgiving","slug":"thanksgiving"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}}]}},"pageContext":{"slug":"desserts","limit":6,"skip":12,"numPages":3,"currentPage":3}}