{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c367","uuid":"8290b27e-c06a-45fc-bd3c-00d32b60e47f","title":"Making Anerica Great Again","slug":"making-anerica-great-again","published_at":"10 August, 2016","plaintext":"I can take 0 credit for this post title because my friend Aneri themes her\nbirthday based off of all the puns she can make with her own name. This year\nwith all the ruckus that ever entertaining Donald Trump has caused, it only felt\nright to have her birthday be \"Make Anerica Great Again.\" PSA: Please do your\nresearch before this election season :)\n\nAlso... I HAD to include the video for this song because 1) Katrina Kaif looks\ngorgeous and 2) it's so damn catchy that it's become my new obsession.\n\nFor this birthday cake, I thought it'd be fun to embody one of a classic drink\nin the form of a cake.\n\nAn Old Fashioned Cake\n\n\nNot to toot my own horn, but I think this cake may have been the greatest one\nI've made so far. To be fair... I didn't make the actual cake from scratch. I\nhad initially and then had a few friends taste it because I was unsure. That\nbatch was probably the worst cakes I have ever made in my entire life.... There\nwas absolutely no way I could bring that to my friend's birthday celebration. At\nthat point, I was running short on time so I bought some standard Duncan Hines\nchocolate cake mixes and made 2 small round cakes according to package\ninstructions.\n\nHere's where the fun and experimentation started!\n\nAn old fashioned is a fairly simple drink according to Esquire Magazine\n[http://www.esquire.com/food-drink/drinks/recipes/a3880/old-fashioned-drink-recipe/]\n:\n1 Sugar Cube\n3 dashes of Angostura Bitters\n1 L Club Soda\n2 oz. Rye Whiskey\n\nSome people tend to garnish their drinks with orange peels and cherries to add\nsome flair to their drink. The hard core Don Drapers will stick to their stiff\ndrinks... but this is a cake so I had some fun with it.\n\nI decided there would be 3 components to this cake outside the base chocolate\ncake layers and the frosting on top.\n\n\n\nWhiskey Soaked Cherries\nThis is the easiest part of the entire cake. Just stick a bunch of cherries in a\njar and fill it with the whiskey/bourbon/etc of your choice. I used Jack Daniels\nfor everything in this cake because that's what we had at home. By the time\nyou're done with the rest of the cake, these cherries will be nice and boozy to\nstick on garnish the top!\n\nCandied Orange Peels\nThis part I wasn't really creative on. I followed the instructions in this\nrecipe\n[http://bakingthegoods.com/2013/12/06/drinking-buddies-recipe-whiskey-chocolate-cake-whisky-buttercream-frosting/]\n! It's actually fairly painless and you can do it while you're doing the rest of\nthe cake prep and ganache prep.\n\nNutella Whiskey Ganache Filling\nMy ganache filling ended up being a hodge podge of a few recipes I've both made\nbefore and found on the internets.\n\nNutella Whiskey Ganache\nIngredients:\n1 1/2 cup nutella\n 1 can sweetened condensed milk\n Whiskey to taste\n Confectioners sugar to thicken if needed\n Directions:\nCombine the ingredients on the stove on low heat until well mixed. Feel free to\nadd as much whiskey as you want based on how boozy you want the ganache to be.\nAllow the ganache to cool. If the ganache is still too thin, add some\nconfectioner's sugar until it thickens.\n\nAssembling this cake was pretty easy. Place a layer of cake on the plate and\npoke holes in it with the back of a wooden spoon. Pour ganache over until the\nholes are filled and a layer of ganache exists over the cake. Stack the other\nlayer of cake on top and also poke holes in this layer. Pour just enough ganache\nover this layer to fill the holes. Cover the cake with your favorite\nvanilla/plain frosting. I prefer Duncan Hines Cream Cheese frosting but that's\nup to you what kind of frosting you want! Top the cake with some whiskey\ncherries, candied orange peels, and even some chocolate or orange peel shavings\nif you want.\n\nEnjoy!","feature_image":"https://pramods.box.com/shared/static/qnuzhxf19zdc4qe7tz9qhjelervhkxc4.jpg","tags":[{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"},{"id":"5c47a6f22037ef002282c337","name":"anerica","slug":"anerica"},{"id":"5c47a6f22037ef002282c338","name":"old fashioned","slug":"old-fashioned"},{"id":"5c47a6f22037ef002282c339","name":"orange","slug":"orange"},{"id":"5c47a6f22037ef002282c33a","name":"cherry","slug":"cherry"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c363","uuid":"5cdd2872-7005-4df6-a0a5-35ffb4b52dc1","title":"A Quick Recipe Fix (Numero Uno)","slug":"recipes","published_at":"11 April, 2016","plaintext":"So I haven't been cooking much lately, but I have been reading a ton of recipes\nfor when I get my life back post-finals! So, I'm starting a new feature! The\n\"Quick Recipe Fix\" - your dose of some of my favorite recipes that I've found on\nthe interwebs.\n\n\n\nEnjoy the recipes, and cut me some slack, internet. I've been busy :)\n\n1.) Love and Lemons is one of my favorite food blogs; they have gorgeous\npictures, and I love their fresh approach to food. They have a cookbook out\nright now that everyone should totally get. I'm also waiting for the day when I\ncan try this recipe for Chickpea Flour Pizza Crust\n[http://www.loveandlemons.com/chickpea-flour-pizza-asparagus/?utm_source=feedly&utm_medium=webfeeds] \n because YUM.\n\n2.) Minimalist Baker hits it out of the park every time. They have a real talent\nfor finding fresh, simple recipes with easy (and short!) cleanup! Check out\ntheir recipe for Gingery Thai Kale Salad with Cashew Dressing\n[http://minimalistbaker.com/gingery-thai-kale-salad-cashew-dressing/]\n\n3.) I love Annie's Eats, especially her cocktail posts! Now that summer's\ncoming, it's time to turn out minds to summertime cocktails, and there's\nsomething about this Gin, Grapefruit, and Rosemary Cocktail\n[http://www.annies-eats.com/2016/03/25/gin-grapefruit-and-rosemary-cocktail/] \nthat feels delightfully spring-y.\n\n4.) Smitten Kitten is incredibly prolific; they do an amazing job of posting\nsuper frequently with high quality recipes! Here's one of there's that I'm\npretty sure is an Italian sort of Shakshouka Eggs in Purgatory, Puttanesca-Style\n[http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/].\n\n5.) The Beeroness is one of my favorite people on the internet. All of her\nrecipes are accompanied by great stories about her life, and the food itself is\nnothing to sneeze at. If you're a beer lover OR a food lover, you'll love her\nblog; right now, I really want to try her Grilled Garlic-Beer Flatbread\n[http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/].\n\nEnjoy the recipes, and if you get a chance to try them before I do (super\nlikely) let me know how it goes!","feature_image":"https://pramods.box.com/shared/static/75ycreg8gpwyyvfdmpmdtiomxiop1sg4.jpg","tags":[{"id":"5c47a6f22037ef002282c26b","name":"food truck","slug":"food-truck"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c314","name":"loving lately","slug":"loving-lately"},{"id":"5c47a6f22037ef002282c315","name":"favorite blogs","slug":"favorite-blogs"},{"id":"5c47a6f22037ef002282c316","name":"yum","slug":"yum"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c345","uuid":"a36cd4bb-ea95-40c9-825a-ecfaa379ce90","title":"Wasted away again in Margaritaville, Searchin' for my lost shaker of salt.","slug":"wasted-away-again-in-margaritaville-searchin-for-my-lost-shaker-of-salt","published_at":"23 February, 2016","plaintext":"\n\nHappy National Margarita Day!!! Bet you didn't know that was a thing! Well now\nyou do so you're welcome.\n\nIn case you weren't aware... Jimmy Buffett actually had a cameo in Jurassic\nWorld last year. Of course he was one of the people escaping the pterodactyls.\nBut of course, in true Margaritaville fashion, he makes sure to grab BOTH of his\nmargaritas before making a run for it.\n\n\n\nThis man is a hero. He clearly knows what today is about. If you haven't\nalready, definitely play the song I linked to above while reading the post. I\npromise the lyrics won't disappoint. If you're really digging the song, I\ntotally recommend checking out the entire album. It's a gold mine of amazing\nsongs like \"Cheeseburger in Paradise\", \"Pencil Thin Mustache\", \"Grapefruit -\nJuicy Fruit\", \"Son of a Son of a Sailor\", and last but not least \"Why Don't We\nGet Drunk.\" I've linked the entire album here for your enjoyment. Do it. I\npromise it's totally worth it.\n\nUsing the great Jimmy Buffett and National Margarita Day as inspiration, I\nfigured I can FINALLY share the amazing strawberry margaritas with you guys. I\nmade these margaritas last year for a Cinco de Mayo celebration at my cousin's\nplace. Technically it was Seis de Mayo because May 5th last year was a Tuesday\nand everyone was busy that day. These were a HUGE hit and best part is that when\nyou run out of strawberries you can just use more lime juice and make plain\nmargaritas. It's the best.\n\nIn case you needed more convincing to actually listen to that song:\n\n\"But there's booze in the blender, and soon it will render that frozen\nconcoction that helps me hang on.\"\n\nYeah... I know. He sings from the heart. Now turn on the song and start blending\nup some delicious margaritas for you and your friends!\n\n\n\nFrozen Strawberry Margaritas\nJust as a warning, these are quite strong so I'd recommend tasting as you add\nthe tequila. However... It's always 5 o'clock somewhere!\n\nYield: about 4-5 margaritas\n\nIngredients:\n2 cups frozen strawberries\n 1 cup silver tequila\n 2/3 cup freshly squeezed lemon or lime juice (save a few wedges for garnish)\n 1/3 cup honey or agave\n 1/4 cup Triple Sec (or Cointreau)\n Coarse salt to rim the glasses\n Directions:\nBlend all the ingredients except salt together in the blender. Taste and adjust\ntequila or honey/agave as you wish\n\nRun a lime wedge along the rim of each of your margarita glasses. Dip the glass\nupside-down in a bowl of salt. Fill each glass with the drink and garnish with a\nlemon or lime wedge.","feature_image":"https://pramods.box.com/shared/static/6917hfisdaydben1ot5yvzlfxep4kef1.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c278","name":"margaritas","slug":"margaritas"},{"id":"5c47a6f22037ef002282c279","name":"strawberry","slug":"strawberry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ee","name":"jimmy buffett","slug":"jimmy-buffett"},{"id":"5c47a6f22037ef002282c2ef","name":"Margaritaville","slug":"margaritaville"},{"id":"5c47a6f22037ef002282c277","name":"cinco de mayo","slug":"cinco-de-mayo"},{"id":"5c47a6f22037ef002282c2f0","name":"tequila","slug":"tequila"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35c","uuid":"1ac41982-aa36-47c5-997a-8cbb575d8814","title":"Started From the Batter, Now We're Here.","slug":"started-from-the-batter-now-were-here","published_at":"28 January, 2016","plaintext":"I know. I know. The title and the song I'm telling you to listen while reading\nthis post don't match, but I felt I needed to up my Drake game a bit. Plus, now\nevery time I think of Drake, I picture him doing his little \"dance\"\n[https://youtu.be/uxpDa-c-4Mc]  over and over again. It brings me a LOT  of joy.\nI also love the SNL parody of it [https://www.youtube.com/watch?v=cjeORm4LMDk] \nbut that's not really relevant.\n\nFirst off, HAPPY NATIONAL CHOCOLATE CAKE DAY! I was not aware that this was an \nACTUAL  holiday but I'm not gonna complain. I firmly believe that everyday\nshould be National Chocolate Cake Day! But hey, I'll take one day a year.\n\nSecond, it's your lucky week! You get TWO whole posts from me! I've been sick\nsince Sunday, so I've been vegetating on my couch, watching a few too many chick\nflicks, all whilst drinking the world's supply of ginger chai (hence my\ncaffeine-fueled poem on Sunday which you should also totally read and\nappreciate) [http://cookinginpjs.com/an-ode-to-chai/].\n\nSo, let's get to it!\n\nAs the self-designated baker for my friend group, I've been baking birthday\ncakes for pretty much everyone. I've been trying to tailor each cake to\nsomething either they've specifically requested or what I think they would\nenjoy. This cake in particular was for one of my friends who loves whiskey. Her\nonly requirement was that, and I quote, \"I do not kill her.\" I took it as a\nchallenge in that I was going to put as much alcohol as possible in the cake\nwhile retaining its ability to taste good.\n\nThree things happened with this:\n\n 1. I made a deliciously boozy cake\n 2. I finished a LOT of the whiskey bottle I bought for this very specific\n    purpose.\n 3. I ended up getting fairly tipsy after a few batter taste tests\n\nI also feel like I should include a warning: raw batter means raw eggs which\nalso means the potential for salmonella. So be careful not to eat spoonfuls of\nyour cake batter! That could get you very sick. Enjoy responsibly ;)\n\nHonestly, I'd say it was a completely successful experience. I totally recommend\nmaking boozy desserts to everyone (of legal age of course). :P Just don't expect\nto be productive after you put the cake in the oven. I had absolutely no\nattention span once I set that cake to bake. I ended up making one GIANT cake\nfor my friend, another little one for the rest of us to enjoy on our own, and a\nfew cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the\ncupcakes were gone within 20 minutes of me sending an email announcing the\narrival of whiskey cupcakes. I'm now officially known as the dessert lady at\nwork.\n\n\n\nChocolate Whiskey Cake\nFeel free to increase/decrease the amount of whiskey according to your\ntaste/tolerance. Just make sure to adjust the flour accordingly so your cake\nbatter isn't too liquidy. The general rule is for each extra tablespoon of\nWhiskey that you add, add an extra 2 tablespoons of flour to compensate.\n\nIngredients:\n2 1/2 cups flour\n 3/4 cups dark cocoa powder\n 2 cups granulated sugar\n 2 tsp baking soda\n 1 tsp baking powder\n 1 tsp salt\n 2 large eggs\n 1/2 cup strong black coffee (chilled)\n 1 cup whiskey\n 1 cup buttermilk\n 1/2 cup vegetable oil\n Directions:\nIf your coffee isn't chilled, then make sure to put it in your freezer to speed\nup that process. Otherwise the eggs will cook when you add the coffee to it. Set\nyour oven to preheat at 350 degrees.\n\nWhisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the\ncoffee is chilled, whisk that in as well.\n\nIn a separate bowl, stir the flour, cocoa powder, baking soda, baking powder,\nand salt together. Slowly pour the wet ingredients into the bowl with all the\ndry ingredients. Make sure to keep stirring while you pour.\n\nWhisk until smooth. Taste to make sure the whiskey level is right. If not add\nmore whiskey/flour accordingly.\n\nSpray your cake pan (or place cupcake liners in your cupcake pan if you're\nmaking cupcakes) and pour in the batter. Set your timer for about 25-30 minutes\n(or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick\n(something that can reach fairly deep inside the cake). If it comes out clean,\nyou're done! Cool the cake in the pan for 15 minutes, frost and devour!\n\nI did get lazy when it came to the frosting and just bought some chocolate\nfrosting from the store. I felt it might be a little TOO much if I spiked that\ntoo, so I just spread shit tons of frosting on top of the cake/cupcakes and ate\nit. I'd say that was the better choice! If you're going easy on the whiskey\ninside the cake itself (or in the words of my friend, \"are being a little\nbitch\"), then maybe you can spike the frosting. Otherwise you've got enough\nalcohol in there to get the deed done.\n\nYes. You know you needed all these gifs right now. Don't lie to yourself. I'm\npretty sure I just stared at this gif collection for a good 5 minutes, at least.\nYou're welcome.","feature_image":"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34a","uuid":"df2980d7-f8f6-4a9a-96e3-15fa96299b5d","title":"Dirty Girls Scouts ;)","slug":"dirty-girl-scouts","published_at":"15 July, 2015","plaintext":"\n\nSince I'm starting to like theming my blog posts to songs, enjoy.\n\nLet's be honest... Anytime anyone sees their local Girl Scouts at the grocery\nstore, they start drooling and daydreaming of Thin Mints, Tagalongs, Samoa's,\nand Do-si-Dos. Girl Scout cookies are some of my favorite type of cookies in the\nworld. While I may mainly be a fan of the plain shortbread cookies, Trefoils.\nThin mints and Samoa's are America's two favorites.\n\nWhile plunging into the depths of Pinterest one day, I found a recipe for mini\nsamoa donuts. That got me thinking... What if I were to make mini girl scout\nthemed cupcakes. And to make them even better, give them a slight \"adult\" twist.\n\n\n\nNot to toot my own horn, but these donut bites were AMAZING. Although they were \nreally  donuts... but rather cupcakes. They still tasted great. There was\ndefinitely not enough alcohol in any of the desserts to do any damage but the\nslight bourbon taste in the caramel brought out some awesome flavors.\n\nMy cousins and I even had a hard time not finishing up the caramel bourbon sauce\nbefore the donuts were ready. We kept eating spoon by spoon of the creamy\nbooze-ness.\n\nPro Tip:  Drizzle some warm caramel bourbon sauce onto a scoop of ice cream...\nHEAVEN.\n\nWhen I took these desserts to work, they were gone within minutes. Clearly\neveryone else was dying to get their Girl Scout cookie fix like I was. I even\nsaw this guy spooning caramel bourbon sauce into his coffee to make it a little\nmore \"Irish.\" ;)\n\nHere are the recipes for the donut bites. Even if you don't make the bites\nthemselves... you DEFINITELY have to try the Caramel Bourbon sauce. It takes a\nfew minutes to make and is EXTREMELY rewarding.\n\n\n\n\n\nSamoa Donut Bites\nIngredients:\nDonuts:\n1¼ cup all-purpose flour\n ½ tsp salt\n 1¼ tsp baking powder\n 1 tsp vanilla extract\n 1 egg\n ½ cup milk\n ½ tbsp lemon juice\n 2 tbsp butter, melted\n 4 tbsp Southern Comfort Caramel\n Caramel Bourbon Sauce\n1 package melting caramel (about 14 oz)\n 3 tbsp milk\n ¼ tsp salt\n 2 tbsp Souther Comfort Caramel  <h4>Toppings</h4>\n  <li class=\"ingredient\">3 cups unsweetened coconut flakes, toasted</li>\n</div>\n<div class=\"right\">\n  <h3 id=\"directions\">Directions:</h3>\n  <div class=\"instructions\">\n    <p>Preheat the oven to 425 degrees. Spray the cupcake pan with cooking spray and keep it aside.</p>\n    <p>Mix milk and lemon juice in a cup/bowl and let it sit for at least 5 minutes to make buttermilk</p>\n    <p><strong>Donuts: </strong>Mix the flour, sugar, baking powder and salt together. Then stir in the vanilla, egg, buttermilk, and melted butter until just mixed. Pour the mixture into the cupcake pan and bake for 4-5 minutes or until done.</p>\n    <p><strong>Caramel Icing: </strong>In a separate bowl, warm the caramel with the milk and 1/4 tsp salt. Every 25 seconds, stir the mixture until the caramel is fully melted. Add a few shots of the Southern Comfort Caramel until you feel like your caramel is boozy enough. Feel free to go as crazy as you want.</p>\n    <p>Drizzle or dip your donuts in the icing, cool, and enjoy! Even feel free to toss a few toasted coconut flakes on top to make it even more \"samoa\"-esque</p>\n  </div>\n</div>\n\n\n\n\n\n\nWhole Wheat Thin Mint Donut Bites\nIngredients:\nDonuts:\n¾ cup milk\n 1 tsp lemon juice\n 1 cup + 2 tbsp flour\n ¼ cup sugar\n 1 tsp baking powder\n ½ tsp baking soda\n 1 tbsp cocoa powder\n ½ tsp salt\n 2 tbsp melted butter\n 1 tsp vanilla extract\n 1 egg  <h4>Mint Icing</h4>\n  <li class=\"ingredient\">1½ cups chocolate chips</li>\n  <li class=\"ingredient\">1 tsp oil</li>\n  <li class=\"ingredient\">1 tsp vanilla extract</li>\n  <li class=\"ingredient\">Crème de menthe</li>\n</div>\n<div class=\"right\">\n  <h3 id=\"directions\">Directions:</h3>\n  <div class=\"instructions\">\n    <p>Preheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and keep it aside.</p>\n    <p>Mix milk and lemon juice in a cup/bowl and let it sit for at least 5 minutes to make buttermilk</p>\n    <p><strong>Donuts: </strong>Mix the flour, sugar, salt, melted butter, baking soda, baking powder, cocoa powder, and vanilla together. Mix the eggs into this mixture until the batter is fully mixed. Add the buttermilk and when mixed, pour into the cupcake pan and bake for 6-8 minutes or until done throughout.</p>\n    <p><strong>Mint Icing: </strong>In a separate bowl, mix all the ingredients together until smooth. Feel free to add as much creme de menthe as you want. Just make sure not to add too much because it'll make the icing too \"liquidy.\"</p>\n    <p>Drizzle or dip your donuts in the icing, cool, and enjoy!</p>\n  </div>\n</div>","feature_image":"https://lh3.googleusercontent.com/UATDHsDclzBmpk7RyUOB4c7NHHbPAdWr8pBn0b-6uVzH=w1314-h1316-no","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c274","name":"mini","slug":"mini"},{"id":"5c47a6f22037ef002282c27b","name":"thin mints","slug":"thin-mints"},{"id":"5c47a6f22037ef002282c27c","name":"samoas","slug":"samoas"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c27e","name":"bourbon","slug":"bourbon"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c373","uuid":"7dfb9b35-e35e-4d3e-a667-6a982763e05c","title":"Did you fall for a shooting star?","slug":"did-you-fall-for-a-shooting-star","published_at":"21 April, 2015","plaintext":"\n\nAnyone who knows me, knows I'm obsessed with a wine called \"Drops of Jupiter.\"\nAnd why not?! One of my favorite bands, Train, partnered with a California\nwinery to make a line of wines named after some of their most famous songs! What\ncould be better than that!\n\nThis was a great wine for me and my friends, especially because we all have\ndifferent preferences when it comes to wine. I prefer a really deep spicy red,\nwhereas most of my friends like drier whites or dessert wines. Surprisingly,\nthis wine solved most of our dilemmas. Each glass is smooth, sweet and spicy,\nbut doesn't lean too far in either direction. It has something for all shades of\nwine lovers! (Plus it doesn't hurt that it's under $10) It's a college wine\nlover's dream! :)\n\n\n\nDrops of Jupiter is not even the only type of wine that the Save Me San\nFrancisco Wine Co makes. They also make Calling All Angels, California 37,\nBulletproof Picasso, Hella Fine, and Soul Sister.\n\nJust pour yourself a glass, blast Drops of Jupiter\n[https://www.youtube.com/watch?v=7Xf-Lesrkuc], and take a trip back to the 90's!","feature_image":"https://farm9.staticflickr.com/8782/17033305629_16faa89701_b.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c247","name":"wine","slug":"wine"},{"id":"5c47a6f22037ef002282c248","name":"drops of jupiter","slug":"drops-of-jupiter"},{"id":"5c47a6f22037ef002282c249","name":"train","slug":"train"},{"id":"5c47a6f22037ef002282c24a","name":"red wine","slug":"red-wine"}]}}]}},"pageContext":{"slug":"giggle-juice","limit":6,"skip":0,"numPages":1,"currentPage":1}}