{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c362","uuid":"05e95921-f65f-42b1-ae93-e2a7d5f8290a","title":"Jalapeño business","slug":"jalapeno-business","published_at":"11 August, 2016","plaintext":"Here's a kinda funky song that I've been super into recently. Listen while you\nread! :) And yes I know I know my title font doesn't handle tilde's very well...\nI'll fix that soon.\n\nSo at my office we have this concept of GSD; Get Shit Done. Every Tuesday, all\nengineers have an event on their calendar that'll allow them to hopefully  work\nquietly without any meetings or interruptions. This usually ends up meaning that\nalmost all the engineers work from home that day. So, I'm usually happily\nworking from home in my pajamas on Tuesdays. This ALSO means I tend to bake or\ncook on Tuesdays because I have more time at home.\n\nThis week I decided to make Jalapeño Cheddar Beer Bread! 1) It's cheesy, spicy,\nand delicious and 2) Turns out beer can replace yeast in a lot of ways, except\nit does leave it's taste behind... so if that's not your thing just use yeast as\nyou would with normal bread. Feel free to use a beer of your choice, I used an\nIPA because some friends had left some in my fridge and I don't drink those...\nso VOILÀ!\n\n\n\n\n\nJalapeño Cheddar Beer Bread\nIngredients:\nDough\n3 cups Flour\n 3 tsp baking powder\n 1 tsp salt\n 2 tbsp sugar\n 1 can/bottle beer\n 1 egg\n Filling\n1 cup diced jalapeño (add more if you want a little more kick)\n 1 cup shredded cheddar cheese\n 1 tsp garlic powder\n 1 tsp salt\n 8 oz cream cheese (softened)\n Toppings\n1/4 cup shredded cheddar cheese\n 1 Jalapeños thinly sliced\n Directions:\nPreheat the oven to 375. In a large bowl, mix together flour, baking powder,\nsalt, sugar and beat in egg. Once fully combined, pour in the beer. Mix together\nuntil the dough becomes sticky and almost like one big dough ball. Set aside.\n\nIn a separate bowl, mix together cream cheese, garlic powder, salt, jalapeños,\nand shredded cheese. Mix well, and then fold into the dough.\n\nDo not over mix. Once the cheese filling has been folded into the dough, put\ndough in a bread baking pan. Sprinkle leftover shredded cheese and sliced\njalapeños over the top of the bread. Bake for 50-1 hour 15min, or until bread is\nfully cooked.\n\nEnjoy!","feature_image":"https://pramods.box.com/shared/static/hm0yyw0uk5phkmfgta50v14z1nfjpcka.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c33b","name":"jalapeno","slug":"jalapeno"},{"id":"5c47a6f22037ef002282c33c","name":"beer","slug":"beer"},{"id":"5c47a6f22037ef002282c33d","name":"cheddar","slug":"cheddar"},{"id":"5c47a6f22037ef002282c33e","name":"bread","slug":"bread"}]}}]}},"pageContext":{"slug":"beer","limit":6,"skip":0,"numPages":1,"currentPage":1}}