{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c375","uuid":"1afdf9c1-368f-4d78-acab-73f49594829c","title":"Tere Ghar Ke Samne, Khana Banaunga","url":"https://cookinginpjs.herokuapp.com/tere-ghar-ke-samne-khana-banaunga/","slug":"tere-ghar-ke-samne-khana-banaunga","published_at":"04 February, 2016","html":"<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/dg39NzgJZg4?wmode=transparent\"></iframe>\n</div>\n<p>Why this song you may ask? While growing up my mom always used to sing this song to me. The song literally translates to &quot;I'm going to build a house in front of your house.&quot; It's supposed to be this cute love song where the guy wants to &quot;build his world in front of her house.&quot; My question is, wouldn't it be more romantic if he built a house FOR them WITH her? Why does he only want to be in front of her house? I may be missing some context from the rest of the movie but regardless that's a whole different tangent.</p>\n<p>This song was pretty much just my mom telling me she wants to live right across the street from my and constantly spoil her future grandchildren. I'm pretty sure my mom wanted a full on re-enactment of &quot;Everybody loves Raymond.&quot; But hey, who's gonna complain about a free babysitter and delicious food? :P</p>\n<center>**Love you Amma! <3**< center=\"\">\n<p><img src=\"https://pramods.box.com/shared/static/qvuujqsw2q4cswg2630ahefurw3iyfnt.jpg\" alt=\"\"></p>\n<p>(While you're at it, you should also <a href=\"http://uppukhara.com\">check out her blog here</a>! It's basically every recipe she made for me growing up that I have random cravings for since I've moved out to California.)</p>\n<p>Sometimes I feel like I'm not a complete adult yet. Even though I'm currently supporting myself, paying my own bills, taxes, and insurance, I don't always feel like a &quot;real&quot; adult. Then, there are times when suddenly I feel like a full on housewife, which is something I NEVER EVER want to be.</p>\n<p>One such instance was this past weekend, when I was anxiously awaiting the arrival of my new electric pressure cooker. One thing I'm <em>sure</em> every child growing up in an Indian household can relate to, is the sound of a pressure cooker. That sound TERRIFIED me to my core throughout my childhood, and to this day. I always feel like something somewhere is going to explode. Even in college when my roommate decided to make dal and turned on the pressure cooker, we used to hide behind our bedroom doors waiting for it to go off enough times so could turn it off and continue hiding. You'd think that it wouldn't be worth the fear, but honestly have you ever had dal or even better, Bangalore-style saaru? Yea, it's worth it. (If you're wondering what that is, it's a less liquidy and better version of rasam with more dal in it). I've tried all sorts of cooking techniques, but saaru just doesn't taste quite the same unless you use a pressure cooker. And this way, you don't end up wasting hours and hours making your meal. THAT is not worth it.</p>\n<p>The sound of our pressure cooker is even worse for our dog because he can hear the noise WAY before we can. He panics and runs all the way up the stairs and cowers near my parent's bedroom door. This happens without fail every time my mom STARTS the pressure cooker. He knows it's coming and refuses to come down from his hiding spot until he's completely sure it's not going to go off again. Poor baby. But I'm sure you'll all realize why once you get your own pressure cookers!</p>\n<p><img src=\"https://pramods.box.com/shared/static/btjgsul6c32hvenzfsw74q4e2xc34mi3.jpg\" alt=\"\"></p>\n<p>But AHA! What is this?! An ELECTRIC pressure cooker? What is this magical device? So quiet and effective? Truly this can't be real! But miraculously, IT IS!</p>\n<p><img src=\"http://ecx.images-amazon.com/images/I/51jpKXz6EuL._AC_UL320_SR308,320_.jpg\" alt=\"\"></p>\n<p>I've never been so excited for any adult purchase in my life, except <em>maybe</em> my car. This was a glorious purchase. NOT ONLY can it make dal in 4 minutes, but I can use it to make dahi (yogurt or curds generally eaten with indian food), rice, and basically anything else in life I could ever think of! ALL WITHOUT MAKING A SOUND! I didn't even realize it had even started and it made a beeping noise indicating that my food was READY! It's wonderful.</p>\n<p>Amidst all this excitement over the pressure cooker, I got kind of homesick for my mom's food. I then proceeded to facetime my mom for an hour while she carefully explained step by step instructions on how to make one of my favorite childhood dishes, Bendekai Huli or for you non-Kannada speaking people out there, Okra Sambar. Most kids hate okra, but honestly it's one of my favorite vegetables, especially when it's in Indian food.</p>\n<p>I know this might not be the most flattering picture of any of us (mainly my brother) but whatever.</p>\n<p>One thing I will mention is that I am not sure where to get the huli pudi (sambar powder). My parents usually bring bags back from this little store in Bangalore every time anyone visits, but I'm sure you can find something similar in local Indian stores. I mean, I know I couldn't live without sambar so I'm sure there are other people who feel the same way and have found a way! There are also instant mixes available at the Indian store - while these aren't quite as good, they can satisfy the occasional craving!</p>\n<p>Now that you've learned a little bit of Kannada, and hopefully are as excited as I was, let's begin!</p>\n<p><img src=\"https://pramods.box.com/shared/static/gqm35vb6v2zox6pbikr2rrwd7fwe0y6u.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Okra Sambar or Bendekai Huli</h2>\n    <div class=\"summary\">\n      <p><em>I'm giving these instructions based on my electric pressure cooker. You may have to adjust the dal portion of the recipe according to however you make it. Pressure cookers scare the bejesus out of me so be careful!</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <h4>Dal</h4>\n          <li class=\"ingredient\">1 cup toor dal</li>\n          <li class=\"ingredient\">1/2-3/4 tsp turmeric powder</li>\n          <li class=\"ingredient\">2 1/2 cup water</li>\n          <h4>Sambar</h4>\n          <li class=\"ingredient\">oil</li>\n          <li class=\"ingredient\">1/2-3/4 tsp mustard seeds</li>\n          <li class=\"ingredient\">1 small package frozen okra</li>\n          <li class=\"ingredient\">1/2-3/4 tsp tamarind paste</li>\n          <li class=\"ingredient\">1 1/2 spoons huli powder (sambar powder)</li>\n          <li class=\"ingredient\">water</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Add the toor dal to your pressure cooker and rinse. Add the water and turmeric and turn on the pressure cooker. I did the Manual setting for 4 minutes. Also make sure its set to low pressure and all the pieces are in place. When the pressure cooker was done it went into keep warm (displayed \"L00:00\") and started counting up. I unplugged it and let it release the pressure on its own.</p>\n        <p>In a pot, add some oil and mustard seeds on medium heat, this is called vagarne. When the mustard seeds start popping, add the frozen okra. When the okra starts to get kinda sticky and stringy, add the tamarind paste and a little bit of water. Keep cooking and mixing the okra occasionally until it is cooked through.</p>\n![](https://pramods.box.com/shared/static/uq45bcrldnses3q369jmzcs1v1srqmqv.jpg)\n        <p>Add huli powder and salt to taste and let it come to a boil. Add the dal and more water until it's the right consistency. Taste it as you go. I needed to add a little more tamarind paste and huli powder to fit my taste but that depends person to person.</p>\n        <p>Let it cook for a few minutes and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/wlq7z13f7uqkm9b2jpei4zk2ruai6hp2.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/4y2jxv3s81ef223fs8ejkb5fp2bhxwf7.jpg\" alt=\"\"></p>\n</3**<></center>","feature_image":"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c297","name":"mom","slug":"mom"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2d1","name":"pressure cooker","slug":"pressure-cooker"},{"id":"5c47a6f22037ef002282c2d2","name":"crock pot","slug":"crock-pot"},{"id":"5c47a6f22037ef002282c2d3","name":"okra","slug":"okra"},{"id":"5c47a6f22037ef002282c2d4","name":"sambar","slug":"sambar"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36b","uuid":"8abb8e5a-35f6-448b-a1d9-8decec1d3d4d","title":"Vidhyarthi Bhavan","url":"https://cookinginpjs.herokuapp.com/vidhyarthi-bhavan/","slug":"vidhyarthi-bhavan","published_at":"01 February, 2016","html":"<p>I'm feeling homesick today. A year ago, I was in India, probably eating chaat (Indian street food), or taking pictures of my cousins while they danced around with stuffed animals.</p>\n<p><img src=\"https://pramods.box.com/shared/static/jvexx1342qglctv9kb1ta3zhtc6tqmsc.jpg\" alt=\"You're missing a picture of a SUPERCUTE baby\"></p>\n<p>I miss India a lot. I always loved visiting my family there, and going for eight months was one of the most valuable times in my life. I loved every minute of it.</p>\n<p>This is a post about a breakfast place in Bangalore, Karnataka, India that everyone goes to. I hope you enjoy it as much as I did.</p>\n<hr>\n<p><img src=\"https://pramods.box.com/shared/static/2xh4t94tv5kvay59fg04rz4uoczsmdsi.jpg\" alt=\"\"></p>\n<p>Every city has this restaurant. It's not classically pretty, and there's no one waiting at the door to see whether or not you want to come in. This is a place where you have to leave your diet at the door (no one has any idea how many calories/protein grams/vats of butter are in your food anyway). The waiters are inattentive enough that a newcomer would have left on the spot, and there are literally never enough seats. There are a few places like this in Bangalore (in a city this big, with this much traffic, you need multiple choice breakfast spots), but Vidhyarthi Bhavan is arguably one of the most delicious.</p>\n<p>It's packed to the brim every day; I went on a Monday morning, and we had to stand behind people to snake their seats. And after we ate, people were standing behind us to snake ours. The restaurant is famous for it's Masala Dosa, although there are a couple of other items on the menu if you're interested.</p>\n<p>While you wait for your order, there are gorgeous photos of Mount Kailash, and really interesting pencil sketches of famous poets and writers of India adorning the walls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7opvixkr40x5e2k575lrbpy8rqnqnf1f.jpg\" alt=\"\"></p>\n<p>There's plenty of fodder for people watching, if the smells wafting from the kitchen aren't enough to keep you totally occupied. Finally, your order comes out.</p>\n<p>The dosas come to you on plates piled high in the waiter's arms (you have a brief moment where you are concerned that the bottom of someone else's plate has been all over your food); the waiter never actually looks at you before he heads to the next table. Then a second waiter, arguably less attentive than the first, comes over with a tureen of coconut, cilantro, and mint chutney and pours it onto your plate.</p>\n<p>You dig in with your fingers, barely resisting the urge to just dig in with your whole face. Finishing one of these babies is a task and a half, but you are definitely up to the challenge; going, going...gone.</p>\n<p><img src=\"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg\" alt=\"yummy yummy masale dosa!\"></p>\n<p>Finally, you get a cup of some excellent filter coffee to finish you right off, before you stumble into the daylight, and onto a street lined with flower and fruit merchants.</p>\n<p>You amble along, sniffing deeply and enjoying the almost-too-full-but-not-quite feeling in your stomach, and all feels right with the world.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7orlyigfozthf1tuoxjuo4cmt4etxsxh.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg","tags":[{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ca","name":"masala dosa","slug":"masala-dosa"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c2cb","name":"indian food","slug":"indian-food"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2cd","name":"bangalore","slug":"bangalore"},{"id":"5c47a6f22037ef002282c2ce","name":"vidhyarthi bhavan","slug":"vidhyarthi-bhavan"},{"id":"5c47a6f22037ef002282c2cf","name":"nostalgia","slug":"nostalgia"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35c","uuid":"1ac41982-aa36-47c5-997a-8cbb575d8814","title":"Started From the Batter, Now We're Here.","url":"https://cookinginpjs.herokuapp.com/started-from-the-batter-now-were-here/","slug":"started-from-the-batter-now-were-here","published_at":"28 January, 2016","html":"<p>I know. I know. The title and the song I'm telling you to listen while reading this post don't match, but I felt I needed to up my Drake game a bit. Plus, now every time I think of Drake, I picture him <a href=\"https://youtu.be/uxpDa-c-4Mc\">doing his little &quot;dance&quot;</a> over and over again. It brings me a <strong>LOT</strong> of joy. I also love the <a href=\"https://www.youtube.com/watch?v=cjeORm4LMDk\">SNL parody of it</a> but that's not really relevant.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:6nmz4imkDcmtwMjocAzFSx\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>First off, <strong>HAPPY NATIONAL CHOCOLATE CAKE DAY</strong>! I was not aware that this was an <em>ACTUAL</em> holiday but I'm not gonna complain. I firmly believe that everyday should be National Chocolate Cake Day! But hey, I'll take one day a year.</p>\n<p>Second, it's your lucky week! You get TWO whole posts from me! I've been sick since Sunday, so I've been vegetating on my couch, watching a few too many chick flicks, all whilst drinking the world's supply of ginger chai <a href=\"http://cookinginpjs.com/an-ode-to-chai/\">(hence my caffeine-fueled poem on Sunday which you should also totally read and appreciate)</a>.</p>\n<p>So, let's get to it!</p>\n<p>As the self-designated baker for my friend group, I've been baking birthday cakes for pretty much everyone. I've been trying to tailor each cake to something either they've specifically requested or what I think they would enjoy. This cake in particular was for one of my friends who loves whiskey. Her only requirement was that, and I quote, &quot;I do not kill her.&quot; I took it as a challenge in that I was going to put as much alcohol as possible in the cake while retaining its ability to taste good.</p>\n<p>Three things happened with this:</p>\n<ol>\n<li>I made a deliciously boozy cake</li>\n<li>I finished a LOT of the whiskey bottle I bought for this very specific purpose.</li>\n<li>I ended up getting fairly tipsy after a few batter taste tests</li>\n</ol>\n<p><em>I also feel like I should include a warning: raw batter means raw eggs which also means the potential for salmonella. So be careful not to eat spoonfuls of your cake batter! That could get you very sick. Enjoy responsibly ;)</em></p>\n<p>Honestly, I'd say it was a completely successful experience. I totally recommend making boozy desserts to everyone (of legal age of course). :P Just don't expect to be productive after you put the cake in the oven. I had absolutely no attention span once I set that cake to bake. I ended up making one GIANT cake for my friend, another little one for the rest of us to enjoy on our own, and a few cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the cupcakes were gone within 20 minutes of me sending an email announcing the arrival of whiskey cupcakes. I'm now officially known as the dessert lady at work.</p>\n<p><img src=\"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chocolate Whiskey Cake</h2>\n    <div class=\"summary\">\n      <p><em>Feel free to increase/decrease the amount of whiskey according to your taste/tolerance. Just make sure to adjust the flour accordingly so your cake batter isn't too liquidy. The general rule is for each extra tablespoon of Whiskey that you add, add an extra 2 tablespoons of flour to compensate.</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">2 1/2 cups flour</li>\n          <li class=\"ingredient\">3/4 cups dark cocoa powder</li>\n          <li class=\"ingredient\">2 cups granulated sugar</li>\n          <li class=\"ingredient\">2 tsp baking soda</li>\n          <li class=\"ingredient\">1 tsp baking powder</li>\n          <li class=\"ingredient\">1 tsp salt</li>\n          <li class=\"ingredient\">2 large eggs</li>\n          <li class=\"ingredient\">1/2 cup strong black coffee (chilled)</li>\n          <li class=\"ingredient\">1 cup whiskey</li>\n          <li class=\"ingredient\">1 cup buttermilk</li>\n          <li class=\"ingredient\">1/2 cup vegetable oil</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>If your coffee isn't chilled, then make sure to put it in your freezer to speed up that process. Otherwise the eggs will cook when you add the coffee to it. Set your oven to preheat at 350 degrees.</p>\n        <p>Whisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the coffee is chilled, whisk that in as well.</p>\n        <p>In a separate bowl, stir the flour, cocoa powder, baking soda, baking powder, and salt together. Slowly pour the wet ingredients into the bowl with all the dry ingredients. Make sure to keep stirring while you pour.</p>\n        <p>Whisk until smooth. Taste to make sure the whiskey level is right. If not add more whiskey/flour accordingly.</p>\n        <p>Spray your cake pan (or place cupcake liners in your cupcake pan if you're making cupcakes) and pour in the batter. Set your timer for about 25-30 minutes (or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick (something that can reach fairly deep inside the cake). If it comes out clean, you're done! Cool the cake in the pan for 15 minutes, frost and devour!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p>I did get lazy when it came to the frosting and just bought some chocolate frosting from the store. I felt it might be a little TOO much if I spiked that too, so I just spread shit tons of frosting on top of the cake/cupcakes and ate it. I'd say that was the better choice! If you're going easy on the whiskey inside the cake itself (or in the words of my friend, &quot;are being a little bitch&quot;), then maybe you can spike the frosting. Otherwise you've got enough alcohol in there to get the deed done.</p>\n<div class=\"container\">\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-2.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-3.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-10.w529.h352.2x.gif\"></div>\n</div>\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-15.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-9.w529.h352.2x.gif\"></div>\n</div>\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-11.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-12.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-13.w529.h352.2x.gif\"></div>\n</div>\n</div>\n<p>Yes. You know you needed all these gifs right now. Don't lie to yourself. I'm pretty sure I just stared at this gif collection for a good 5 minutes, at least. You're welcome.</p>\n<p><img src=\"https://pramods.box.com/shared/static/9upgp2c5wpbpedkokxisgwnalior9lbz.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/kn2i1aq1mhs3jkmokp3139lxcu9r2xxj.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/rthr66f7x6q8wymqa98yafvbah7hklcv.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c376","uuid":"20792daa-31be-4587-acd6-d7f7951d8b6d","title":"An Ode to Chai","url":"https://cookinginpjs.herokuapp.com/an-ode-to-chai/","slug":"an-ode-to-chai","published_at":"25 January, 2016","html":"<p>There are some days where all you want to do is vegetate on your couch with your stuffed penguin, some Netflix and chai. Today is one of those days.</p>\n<p><img src=\"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg\" alt=\"\"></p>\n<center>For the days of exhaust.\nFor the days of woe.\nFor the days of rain\nAnd those few in a row.\n<p>The magical potion,<br>\nWhich may many amaze,<br>\nSimple preparation,<br>\nPowerful result.</p>\n<p>A hint of ginger,<br>\nA drop of milk,<br>\nA spoonful of sugar,<br>\nAnd sore throat no more.</p>\n<p>What magical mystical wonder is this?<br>\nOh? You didn't you hear?<br>\nJust some simple and plain and regular tea!</p>\n</center>\n<p><em>Side note: this may have been inspired by one too many cups of ginger chai. I may have a problem.</em></p>\n<p><img src=\"https://pramods.box.com/shared/static/2m0iqspxp5v9az5sbsd5f7vo6wdbaasd.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg","tags":[{"id":"5c47a6f22037ef002282c2a2","name":"chai","slug":"chai"},{"id":"5c47a6f22037ef002282c2c0","name":"drinks","slug":"drinks"},{"id":"5c47a6f22037ef002282c2c1","name":"tea","slug":"tea"},{"id":"5c47a6f22037ef002282c2c2","name":"ginger","slug":"ginger"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35a","uuid":"015353ea-56fa-417c-983c-c5350fb3c81a","title":"Sweet Potato Pie","url":"https://cookinginpjs.herokuapp.com/sweet-potato-pie/","slug":"sweet-potato-pie","published_at":"25 January, 2016","html":"<p>I made some sweet potato pie today.</p>\n<p><img src=\"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg\" alt=\"\"></p>\n<p>This was my second time making this dessert, and I made it in a more or less similar way.</p>\n<p>The first time I made it, I bragged to my housemate, and he asked me if my making a sweet potato pie was cultural appropriation, and I had no idea, because I had no idea sweet potato pie was a thing that black people did. To be honest, I thought it was an all-American thing (immigrant probs, amirite?) So I researched - and I found out that historically, sweet potato pie was a food slaves made in the south. And I had no idea until I made it and someone else called me out on it!</p>\n<p><img src=\"https://pramods.box.com/shared/static/iw7ilzj11mwwevcfd9rwv4255nyunmla.jpg\" alt=\"\"></p>\n<p>Here's the thing about cultural appropriation in food - it happens ALL THE TIME. People love to take foods from other cultures - frequently every day, commonplace foods - and remake them with slight tweaks and giant price tags. So how do you avoid it? I personally advocate for research.</p>\n<p>I think it's important to know where the food you're making comes from, especially when you're modifying it. I tend to modify a lot of recipes to make them vegetarian or vegan, but I try to do it in a way that feels as respectful to me as possible.</p>\n<p>I think there's space in food for innovation, but it has to be accompanied by respect for the important place that food has in culture.</p>\n<p>So, the moral of this story? Don't appropriate. Don't glorify the food of another culture without trying to understand that culture itself. Accept that you'll probably be clueless even with additional information, and do your best to be respectful.</p>\n<p>And also, have some pie.</p>\n<p><img src=\"https://pramods.box.com/shared/static/b9pw4yztlvyi87dno5qfnd1tryy08fyw.jpeg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Sweet Potato Pie</h2>\n    <div class=\"summary\">\n      <p><em>This is a filling dessert. You could tell yourself it's healthy because it has a vegetable as a filling, but let's be real - this is not a healthy dessert. And that's a good thing - sometimes dessert just needs to be decadent.</em></p>\n      <p>Yield: 1 Pie</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">2 hours active cooking time</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Pie Crust</h4>\n          <li class=\"ingredient\">3 C Flour</li>\n          <li class=\"ingredient\">1 Tsp Salt</li>\n<li class=\"ingredient\">3/4 C Coconut Oil</li>\n<li class=\"ingredient\">Ice water, as needed</li>\n        <h4>Sweet Potato Filling</h4>\n          <li class=\"ingredient\">Three Medium Sweet Potatoes</li>\n          <li class=\"ingredient\">1 C Coconut Milk Liquid or 1/2 C Almond Butter</li>\n<li class=\"ingredient\">Maple Syrup, to taste</li>\n<li class=\"ingredient\">1 1/2 Tsp Cinnamon</li>\n<li class=\"ingredient\">1/2 Tsp Cardamom</li>\n<li class=\"ingredient\">1/2 Tsp Pumpkin Pie Spice</li>\n<li class=\"ingredient\">1 Tsp Vanilla Extract</li>\n<li class=\"ingredient\">1 Tsp Orange Extract</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n<p>\n1.) The pie crust recipe is the same dough as that of my  [Love Triangles](http://cookinginpjs.com/love_triangles/) from last week. The first time I did it, I added a little bit too much ice water - perhaps a couple tablespoons too much - and I wound up with a loose dough I didn't want to add more flour to. So that time, I rolled it out hastily, trying not to handle it too much to avoid the coconut oil melting prior to baking. This time I managed to avoid that pitfall, and carefully added only as much water as was necessary, resulting in a soft, elastic, and close-to-perfect dough. I recommend prepping and chilling that before you do anything else.  \n</p><p>\n2.) I went the simple route; I chopped the sweet potato small, into pieces about a half inch wide. After you do that, douse them in spices and throw them in the oven until they are melt-in-your-mouth cooked. Or, you know, about thirty minutes.\n</p><p>\n3.) Mashed them, add maple syrup, the some almond butter, or the liquid from a can of coconut milk for creaminess, and your spices and extracts. You want to make sure it isn't too sweet, tasting every time you add a new ingredient to - ahem - \"assess quality.\" Make sure that the pie isn't so sweet that you can't taste the sweet potato. The goal is to enhance it so it can be the star, not mask it. \n</p><p>\n4.) Preheat the oven to 375 F. Take out your pie dough which has, of course, chilled for at least four hours at this point, and roll it out gently. Set it into a pie pan/tin, and crimp the edges however you're like. Reserve the cut off bits to create a decoration for your pie. Pop the crust in the oven for about fifteen minutes. \n</p><p>\n5.) After the pie crust has baked for about fifteen, take the pie out of the oven and layer in your filling. You want it to be up until the rim of the pie pan - this filling won't expand, so you can fill it right up. Put the pie back in the oven for about twenty minutes. \n</p><p>\n6.) In the meantime, roll out your spare dough and get creative! I went the way of stars and diamonds because those are the cookie cutters I found, but the world is your oyster. When twenty minutes have passed, take your pie out of the oven and carefully place the decorations on top. Put it back in for another 20 minutes. Proceed to turn on the oven light and watch excitedly, as I did (I think I mistook it for a television).\n</p><p>\n7.) After another twenty minutes have passed, increase the oven temperature to 400 F, and place your pies on the top rack - I like my top crust to be a little brown, and this makes that happen!\n</p><p>\n8.) Take your pie out of the oven and serve it up! I loved it with a dollop of coconut whipped cream, but it would likely also taste good with ice cream, or normal whipped cream, or any manner of things. It was also excellent all on its own. \n        </p>\n      </div>\n    </div>\n  </div>\n</div>\n","feature_image":"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c3","name":"sweetpotato","slug":"sweetpotato"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c2bc","name":"pastry","slug":"pastry"},{"id":"5c47a6f22037ef002282c2c4","name":"piecrust","slug":"piecrust"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c359","uuid":"a15671eb-987c-4a1e-b6cb-d2b26eff884a","title":"Netflix and Chilaquiles","url":"https://cookinginpjs.herokuapp.com/netflix-and-chilaquiles/","slug":"netflix-and-chilaquiles","published_at":"20 January, 2016","html":"<p>This Christmas vacation, Anagha and I were reunited for the first time in almost a year. There are many phases of a best friend reunion, according to this <a href=\"http://www.buzzfeed.com/kelseydarragh/when-your-bff-comes-to-town#.nsbQEmYJq\">buzzfeed article</a>. Pretty much every single thing in that article happened, except in our friendship instead of drinking our weight in wine, we cook. And eat.</p>\n<p><strong>A LOT OF FOOD</strong></p>\n<p><img src=\"https://ak-hdl.buzzfed.com/static/2015-12/8/18/enhanced/webdr11/anigif_original-21914-1449616517-5.gif\" alt=\"\"></p>\n<p>I'm pretty sure Anagha spent 50% of her time at my place and the other 50% at her own parents' house. We didn't even do anything most of the time... I would be working and she would be reading at the opposite end of the table. She had also never met the newest addition to my family, Miggy Pramod, who is basically the most adorable dog known to man.</p>\n<p>True to form, they became best friends immediately.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ijnjkbtgaycn5ddhbx2dwakh9gcrq3ua.jpg\" alt=\"\"></p>\n<p>Seriously though, who couldn't love a weirdo that sleeps like this regularly?</p>\n<p><img src=\"https://pramods.box.com/shared/static/j1fczq8yhjzxhz0ae852f1lu4wqdp00s.jpg\" alt=\"\"></p>\n<p>Just look at him.</p>\n<p><img src=\"https://pramods.box.com/shared/static/8429t2jqhh8zkgv3fuc8vszlqh3y8dbj.jpg\" alt=\"\"></p>\n<p>This past August, my dad decided that my mom's birthday gift would be to finally get a puppy. My entire family, brimming with excitement, spent hours and hours looking on petfinder.com and various shelter sites for the perfect little CALM addition to our family. After countless shelter visits and close calls with various puppies, we were extremely tired and disheartened. The process of finding the perfect dog for our family had become a lot more emotionally draining than we had originally thought. My mom wasn't sure if she could get attached to another dog and see him/her join another family. Then one day, my parents went to this small little animal hospital in Sterling Heights, MI and instantly became smitten with, what we were told, was a little beagle mix. He was an adorable 18 pound ball of affection who just wanted to play. One week later, he was ready to come home.</p>\n<p><img src=\"https://pramods.box.com/shared/static/dcypl744jtl2r4ey4gb8xydob6hi09g6.jpg\" alt=\"\"></p>\n<p>He was a VERY little 5 month old puppy. Little did we know that the tiny little boy that we brought home was a little more German Shepherd than Beagle. Currently, Miggy is a happy 40 pounds and the obsession of my entire family, weird sleeping positions, ear licking fetishes and all.</p>\n<p>ANYWAYS putting the puppy love aside, whenever we weren't spoiling Miggles with never ending attention, we were watching Netflix and eating All The Brunch. If it hasn't become obvious from some of our <a href=\"http://cookinginpjs.com/brunch-conquers-all/\">previous posts</a>, We <strong>LOVE</strong> brunch. Best of all, it means that we can roll out of bed in our pajamas and enjoy some scrumptiousness that we could concoct using eggs and veggies. Yay Pajamas! YAY Brunch!</p>\n<p>Then, it's time for a relaxing, vacation time food coma. There's that one episode of friends where Joey and Ross discover that they are each other's best nap buddies. Exactly. Who <em>DOESN'T</em> want a nap buddy and best of all your best friend?! So we spent most of our afternoons watching Netflix and chilling (no not like that you perv!) but literally watching Netflix reruns and napping with my puppy.</p>\n<p><strong>Best. Break. Ever.</strong></p>\n<p><img src=\"https://45.media.tumblr.com/78bddaf03bdfb59b75a09a3c3db38b10/tumblr_ngbxx0rIAb1snhpyjo1_r1_500.gif\" alt=\"\"></p>\n<p>We also love Mexican food. No explanation needed. It's just the best. So OBVIOUSLY nothing could be better than combining the two things we are always craving. In came chilaquiles.</p>\n<p>I've had varieties of chilaquiles in the past. From the beaches of Cancun to the streets of San Francisco and San Diego. Everywhere, they put their own spin on the classic Mexican dish. Traditionally it's kept very simple with just fried tortillas, salsa, egg, and beans (and/or meat). California, on the other hand, tends to add avocado to everything so it's very colorful. Our variation probably includes WAY more vegetables than most but I love it and it tasted delicious.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/9r2pggwyj4j7fre2tlxu47nhkj2be8mh.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/3g098w0hj52qe8k9d45ddalcfxo4a2oh.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/eb3enu78qybtf2rl2qygx4gx64l9r7zn.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chilaquiles</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">1 bottle <a href=\"http://www.lavictoria.com/products/salsa/thickn-chunky-salsa-verde-medium/\">Salsa Verde</a></li>\n          <li class=\"ingredient\">1 bag tortilla chips</li>\n          <li class=\"ingredient\">1 can black beans</li>\n          <li class=\"ingredient\"><a href=\"http://cookinginpjs.com/estoy-cantando/\">Sumedha's Super Secret Fajita Seasoning</a></li>\n          <li class=\"ingredient\">1 avocado cubed</li>\n          <li class=\"ingredient\">1 egg per person</li>\n          <li class=\"ingredient\">sour cream</li>\n          <li class=\"ingredient\">cheese (shredded or Cotija)</li>\n          <li class=\"ingredient\">chopping cilantro to garnish</li>\n        <h4>Pico De Gallo Salsa</h4>\n          <li class=\"ingredient\">2 roma tomatoes</li>\n          <li class=\"ingredient\">1/2 onion diced</li>\n          <li class=\"ingredient\">1/4 cup chopped cilantro</li>\n          <li class=\"ingredient\">lemon juice to taste</li>\n          <li class=\"ingredient\">salt to taste</li>\n        <h4>Corn Salsa</h4>\n          <li class=\"ingredient\">1 can sweet corn kernels</li>\n          <li class=\"ingredient\">4 sliced jalapeños (more or less based on your spice tolerance)</li>\n          <li class=\"ingredient\">lemon juice to taste</li>\n          <li class=\"ingredient\">salt to taste</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Put two handfuls of tortilla chips in a pan and cover with the salsa verde. Let the chips soak on low-medium heat while completing the remaining steps. Make sure to stir occasionally so all of the chips are covered in salsa</p>\n        <img src=\"https://pramods.box.com/shared/static/h40kxa1n2f931rxbfyg2ckvllshtz13o.jpg\">\n        <p>Cook the beans with as much of Sumedha's Super Secret Fajita Seasoning as you like. For each salsa, combine the ingredients in a bowl and keep to the side.</p>\n        <p>When the beans are almost done, make one sunny side up egg for each person. You are more than welcome to scramble them if you don't like runny eggs.</p>\n        <p>Spread the soaked tortilla chips on each plate. Layer the beans, egg, salsas, avocado, cheese, sour cream and cilantro on top of the chips. Grab your fork and knife and let the egg yolk flow. ;)</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/t03aga3evw84924kvc9harwbozrs50a9.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/1fcrzhi9xfs643a73eziigxq1qmtnkah.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/sl6dcu7i0xy3w2cv0wxx6bduskqus5r7.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg","tags":[{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2b9","name":"chilaquiles","slug":"chilaquiles"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ba","name":"reunion","slug":"reunion"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c2bf","name":"naps","slug":"naps"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"limit":6,"skip":24,"numPages":10,"currentPage":5}}