{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c379","uuid":"47c49c89-9a7d-4de9-a292-71d78ca5abb8","title":"What to do when you have the World's Supply of Granola at your Disposal","slug":"what-to-do-when-you-have-the-worlds-supply-of-granola-at-your-disposal","published_at":"08 October, 2015","plaintext":"\n\nAbout a week ago we had a parfait event at work to raise awareness about Women\nin Tech. A lot of people attended and learned a lot about what Box is doing to\nimprove the gender disparity in tech. Sadly, we overestimated how much granola\nwe needed and ended up with 2 GIANT bowls of granola left over.\n\nIn my head, it seemed like I could bake those into some variety of oatmeal\ncookies and breakfast bars and be done with it. No matter how much granola I\nused, it seemed like it was never going to end! Thankfully after making 3-4\nbatches of these oatmeal bars I finished 1 bowl, but I ended up making some dark\nchocolate fruit and nut clusters as well (post coming soon).\n\n\n\nIn all honesty, these cookie bars were SO much better than those chocolate\nclusters (as scrumptious as those look). The crumbly-ness and chocolatey-ness of\nthese bars complemented each other perfectly. I've actually saved all the extra\ncrumbles to top ice scream sundaes. Think about how delicious that would be!!!\nNow that you're officially drooling thinking about that, here's the recipe.\n\nOatmeal Chocolate Chip Cookie Bars\nIngredients:\n3 cups granola (or oats)\n 1¼ cup butter, melted\n 2 cups chocolate chips\n 2 cups flour\n 1½ cups brown sugar\n 1 tsp baking soda\n 1 tsp salt\n 1½ tbsp vanilla\n 2 eggs\n Directions:\nHeat oven to 350 degrees. Spray a cookie sheet with non-stick cooking spray.\n\nAdd everything but the chocolate chips into a bowl and mix until just combined.\nI don't have a standing mixer or this would have been much easier and less\nmessier. Stir in the chocolate chips.\n\nSpread the batter into the baking dish. Bake for 25 minutes or until a tester\ncomes out with just a few moist crumbs. Bars should look slightly underdone. Let\ncool 1 hour before cutting into bars. (But let's be honest here... I couldn't\nwait more than 10 minutes)\n\nBecause the granola I used wasn't very sweet it didn't overly sweeten the bars\neither, which was something I preferred. Similarly, using brown sugar instead of\nnormal granular sugar kept the bars less sweet. Make sure not to overcook the\nbars or they won't be as gloriously crumbly!","feature_image":"https://lh3.googleusercontent.com/2lPmzUu82FpK-bF10uC-AJpZ8xIWniOm2cCYIRfno-lDDrHJp5zBVeNAPCaaBZMwDVZ_wv9-tiO4OVMUyv90BGrb3cpDcawOhIjnkkM5FtDsXUzWoa9hfnflZZ7wgFq13L44Si8-D4RHJ17O8KP8aKIOKPDpYr_MbISDtZtCZh9enMUhh-1esqJO16NL8-suXV6hO6JlMnyzjQwFNeww9sUlZuwprBxko5kC1YvUsa1Vk69b02093F_4JuCdlWORn_SJA97gLJzvlnDVI3HIZYQ41o0e2JJA0SEdMgv9PRki8xj4fJtI_E2W_DdiYKPg3AulAqqO0Qx9i9q9pMjUZEiNmjzAFa_BcAWYSPRb27EM8s8BujPmrAWM8AxNpE2mjd0OJRddfyJlkVXZyu0j6PJizFjtEP43x6uSPcgL5SrNdACc4g8EVrth-qPHxy2eOnhYgEtc-wR80827fG_pKrzy8nwUfVmIEMbtOHRf1zD06ZNVPjqADJ8CSbxv5vOAP-DZNKtUnK4AViSQA8OpchyEQRquO5A8NeFuN9qKZLez=w1440-h1080-no","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c29e","name":"oatmeal","slug":"oatmeal"},{"id":"5c47a6f22037ef002282c29f","name":"granola","slug":"granola"}]}}]}},"pageContext":{"slug":"oatmeal","limit":6,"skip":0,"numPages":1,"currentPage":1}}