{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c380","uuid":"b112724c-4311-432f-81e6-540c215fce32","title":"Ba-na-na Ba-na-nana Po-ta-tooo Po-ta-to-naaaa","slug":"ba-na-na-ba-na-nana-po-ta-tooo-po-ta-to-naaaa","published_at":"05 May, 2016","plaintext":"K this second post for the week took a bit longer than expected but I finally\nperfected the pictures so we're good now. YAY Post #2 for the week! And that\ntoo, to celebrate one of the nerdiest holidays out there! STAR WARS DAY!\n\n\n\nAll the wonderful puns.\n\nAlso because this recipe is banana filled, I HAD the little song by the Minions\nfrom Despicable Me stuck in my head. So I figured I should share that\nadorableness and mental torture with you guys.\n\nAnyways... after being home sick for an entire week in what I consider my\npersonal version of solitary confinement, I hit a new level of insanity. I was\ndeprived of social interaction to such a point that I legit LOL'd at a Buzzfeed\narticle of ridiculous snapchats for a good 20 minutes. And by LOL'd I mean\ncurled over laughing so hard I could barely breathe. No Buzzfeed article is THAT\nfunny. I had such bad sinus pain that working on my computer for long periods of\ntime was pretty rough. So I decided rather than wallowing in my bed, I was going\nto make SOME productive use of my time... baking for you guys!\n\nI found this recipe on Pinterest a while back of Cream Cheese Filled Chocolate\nChip Banana Coffee Cake\n[http://www.carlsbadcravings.com/cream-cheese-stuffed-chocolate-chip-banana-coffee-cake-recipe/]\n. I do want to preface my recipe with this:\n\n 1. I didn't some of the ingredients so this is my altered version for lazy\n    bakers :)\n 2. I also don't have a bundt cake pan, so mine didn't come out as gorgeous\n    looking as this but there is one thing I CAN guarantee, which is that they\n    came out DELICIOUS. Probably one of my favorite desserts I've ever made,\n    next to Tiramisu and my mom's Mush Cake.\n 3. I didn't have brown sugar and didn't want to bother making a second grocery\n    store trip for that so I just didn't bother making the streusel topping that\n    was in the original recipe. I can only imagine how much more mind blowing it\n    would have been had I added the streusel, maybe you can make yours with it\n    and let me know!\n\n\n\nOver the last few weeks I've been trying to figure out where in my new apartment\nI can do my food photography to optimize the natural light coming from my\nwindows. In my old apartment it was extremely easy, I had giant sliding doors\nwhich brought in ALL the light and shown over pretty much my entire living room;\nand if that wasn't enough then I could go out onto my balcony and take the\nphotos there! It was perfect. This week I discovered that if I angle one of my\nside tables properly and place the dish inside it, the light reflects off the\nwalls of the table perfectly onto the the food and really brings out all the\ndetails in the food! I HAD FINALLY FIGURED IT OUT! Although this weird\npositioning did lead to some old people back pain for me because of the weird\npositions that I laid in on the floor to get these photos. Such is the pain for\nbeauty.\n\n\n\nI mean just look at it...\n\nThis is one recipe I would HIGHLY recommend you try, whether it be my\ninterpretation or the original recipe itself. It was delicious and my coworkers\nand friends LOVED it.\n\n\n\nChocolate Chip Banana Cheesecake Coffee Cake \nIf you don't have over-ripe bananas, then Carlsbad Cravings gave a great\nsuggestion of sticking them in the oven at 325 F degrees until they're dark on\nthe outside and soft to the touch.\n\nIngredients:\nBanana Coffee Cake\n2 1/4 cups all purpose flour\n 1 1/4 tsp baking powder\n 1 1/4 tsp baking soda\n 1 tsp salt\n 2 tsp cinnamon\n 1/2 cup butter, softened\n 1 1/2 cup sugar\n 2 large eggs\n 4 large bananas, over-ripe and mashed\n 1 tbsp vanilla extract\n 1 1/4 cups non-fat plain yogurt (or greek yogurt)\n 3/4 cup chocolate chips\n Cheesecake filling\n16 oz cream cheese, softened\n 1/2 cup reserved batter (from banana coffee cake above)\n 1/2 cup sugar\n 2 tsp vanilla extract\n Directions:\nPreheat oven to 350 degrees F and spray your pan with nonstick cooking spray and\nflour the inside of your pan.\n\nIn a medium bowl, whisk together flour, baking powder, baking soda, salt, and\ncinnamon. Set aside.\n\nUsing a hand mixer, beat the butter and sugar together until fluffy. Add the\neggs in one at a time and beat until blended. Mix in the vanilla and bananas\nuntil just combined.\n\nGradually add the dry ingredients to the wet ingredients, alternating with the\nyogurt. Beat until just combined. Measure out 1/2 cup of batter and keep aside\nfor the cheesecake filling. Stir in the chocolate chips into the remaining\nbatter and keep aside. Measure out about 1 cup of the batter with chocolate\nchips and keep aside to layer on top of the cheesecake filling. Pour the\nremaining batter into your pan.\n\nIn a separate bowl, mix together the 1/2 cup batter you set aside earlier with\nthe rest of the cheesecake filling ingredients on high speed until smooth and\ncreamy.\n\nSpread the cheesecake filling on top of the current layer batter in the pan.\nIt's okay if it sinks in a bit, this cake is much more moist than the original\nrecipe so the cheesecake layer is more variable in size. Pour the top layer of\nbatter on top of the cheesecake filling. If you made a streusel, now is the time\nto sprinkle it on top.\n\nBake for 55-60 minutes at 350 degrees F or until toothpick inserted comes out\nclean (ignoring the melted chocolate chips and any possible cream cheese that\nstill may not be solid). Let it cool and enjoy!\n\n\n\n\n\n![] (https://pramods.box.com/shared/static/opdcb8ciiq9ib1qbz8nfbz84gtjvanxz.jpg)","feature_image":"https://pramods.box.com/shared/static/l2l9lmho8q088kczuewl9ll8ec4uz2b8.jpg","tags":[{"id":"5c47a6f22037ef002282c291","name":"banana","slug":"banana"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c32b","name":"chocolate chips","slug":"chocolate-chips"},{"id":"5c47a6f22037ef002282c32c","name":"experiments","slug":"experiments"},{"id":"5c47a6f22037ef002282c32d","name":"minions","slug":"minions"},{"id":"5c47a6f22037ef002282c32e","name":"star wars","slug":"star-wars"},{"id":"5c47a6f22037ef002282c32f","name":"sick days","slug":"sick-days"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36e","uuid":"cec5c08a-2215-415c-873a-bafb4bfd7d1f","title":"Pardon My French, But **** that ****","slug":"pardon-my-french","published_at":"30 June, 2015","plaintext":"So this weekend, I had a grand plan of being all fancy and making macarons.\n\n(Yea I looked it up... apparently macarons and macaroons are two VERY different\nthings as this adorable diagram shows)\n\n\n\nI've honestly never eaten one but I always thought they looked so adorable! And\nI figured if I made them all blue and yellow then all the better... GO BLUE! I\nlooked at the recipe, saw the ingredients and was confident that this dessert\nwas within my range of baking abilities. In fact, I was SO confident that I\ncalled a friend of mine to come over and reap the benefits of my baking!\n\nClearly such confidence could only yield brilliant results.\n\nWRONG\n\nMaking macarons is a very delicate process that requires a lot more patience and\nskill than I had ever anticipated! And for that very reason, the adorable\nmacarons I had been picturing in my head came out like this.\n\n\n\nExactly like you picture macarons in French Patisseries right?! I know... I was\njust as disappointed as you. It basically became some strange almond flavored\nfruit roll ups. Not at all appetizing. Now there was another problem... I had a \nTON  of almond batter that clearly wasn't going to make macarons and no idea\nwhat to do with it. My cousin saved my ass and suggested I just convert them\ninto almond cupcakes.\n\nHonestly, I think it was my disappointment at failing to make macrons but I half\nheartedly made these cupcakes. So much so that I didn't even bother with my\nusual photo shoot of the final masterpiece. I have absolutely no photos of what\nthey turned out to look like. Nada. Zilch. But imagine they looked something\nlike this except light yellow and blue with little almond specs all inside.\n\n\n\nThey weren't especially sweet cupcakes so I figured they needed some kind of\ntopping to balance out the flavors. I went back and made some of my handy\ncaramel bourbon sauce, which is just melted caramel, a little water, and some \nCaramel Southern Comfort [http://www.southerncomfort.com/age?ref=caramel]. First\noff, it's heavenly and just a little boozy. Secondly, it basically takes you 2\nminutes to make.\n\nFinally having somewhat salvaged this disaster, I took the box of what I thought\nwas my failures to work. After keeping it out in the lounge area, I quickly\nlearned that the combination of almond cupcakes with caramel bourbon sauce\nworks.... like really  works.\n\nAnyways, here's what I think was the makeshift cupcake recipe. More or less...\n\n\"Macaron\" Almond Cupcakes\nIf the consistency doesn't seem like normal cupcake batter, add more flour. I\nkinda estimated the amounted needed and had to add more to my batter. But that\nmay have only been because I was adapting from a macaron recipe.\n Ingredients:\n2/3 cup ground almonds\n 1 1/2 cups powdered sugar\n 3 large egg whites\n 5 tbsp granulated sugar\n 1 tsp vanilla extract\n 2 tsp baking powder\n 2 cups flour\n 1/2 cup melted butter\n 1 cup milk\n Directions:\nPreheat the oven to 375 degrees. Spray the cupcake pan with cooking spray and\nkeep it aside.\n\nMix butter and sugar together and then beat in egg whites. Mix in the flour,\nground almonds, and baking powder. Add in milk and vanilla and beat well. Pour\nbatter into pan and bake for about 15 minutes or until you can poke a cupcake\nwith a knife or toothpick and it comes out clean.","feature_image":"https://s-media-cache-ak0.pinimg.com/736x/82/15/ae/8215ae44e248f2901f8b6205b2c1cdd3.jpg","tags":[{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c27f","name":"macarons","slug":"macarons"},{"id":"5c47a6f22037ef002282c286","name":"almond","slug":"almond"},{"id":"5c47a6f22037ef002282c287","name":"fail","slug":"fail"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c346","uuid":"6f57be9e-a31d-449e-ba29-b0f2b7c8535e","title":"Galentine's Day Cupcakes","slug":"galentines-day-cupcakes","published_at":"01 May, 2015","plaintext":"\n\nWhat's Galentine's Day you ask? No one could have answered that question better\nthan Amy Poehler herself, \"it's only the best day of the year. Every February\n13th, my lady friends and I leave our husbands and our boyfriends at home, and\nwe just come and kick it, breakfast-style. Ladies celebrating ladies. It's like\nLilith Fair, minus the angst. Plus frittatas.\"\n\nEver year on Valentine's Day, my mom sends me a special gift. When I lived it at\nhome, she used to give me and my brother cute small stuffed animals with hearts\non them. When I moved to Ann Arbor for college, she took a different approach.\nEvery year, she would send me a heart shaped pizza with my favorite toppings,\nMUSHROOMS!\n\nThis past Valentine's Day, however, I was in India so neither was possible. So\nmy cousins and I decided to celebrate Galentine's Day instead! We made some\ndelicious red velvet cupcakes from scratch, enjoyed some leftover batter, and\nwatched some light hearted chick flicks. All in all, a great way to celebrate\nour fellow ladies.\n\n\n\nWe were pretty lazy about experimenting with the recipe so I will just leave you\nwith the recipe we used\n[http://sallysbakingaddiction.com/2014/10/29/red-velvet-cupcakes/]  for the\ncupcakes and made a basic chocolate icing following the instructions on the bag\nof confectioners sugar.\n\n\n\n\n\n\n\n\"February 14th, Valentine's Day, is about romance. But February 13th,\nGalentine's Day, is about celebrating lady friends. It's wonderful and it should\nbe a national holiday.\"\n\n * Leslie Knope","feature_image":"https://farm9.staticflickr.com/8573/16406140367_5c5b265be3_b.jpg","tags":[{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c254","name":"galentines day","slug":"galentines-day"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c256","name":"red velvet","slug":"red-velvet"},{"id":"5c47a6f22037ef002282c257","name":"valentines day","slug":"valentines-day-2"}]}}]}},"pageContext":{"slug":"cupcakes","limit":6,"skip":0,"numPages":1,"currentPage":1}}