{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35e","uuid":"28e9fca4-1790-4afe-9663-c046b09f3043","title":"FoodChella","slug":"foodchella","published_at":"04 May, 2016","plaintext":"\n\nSo I was terribly sick last week whilst recovering from Coachella so I've\ndecided to treat you guys with not one but TWO whole posts! I know right?! So\nawesome. You can thank me later. AND to make things better... instead of sharing\njust a single song... I'm going to gift you with a whole playlist of my favorite\nsongs from Coachella!\n\nSo very typical of me, I didn't double check my flight timings when booking so I\nended up flying out to LAX a whole 10 hours before the rest of my group. I\ndecided to start the trip out right, eggs Benedict and a mimosa at the airport\nwith a side of Gilmore Girls.\n\n\n\nUsually 10 hours stranded at an airport is a bummer, but there are worse places\nto get stranded than LAX. It kind of ended up working out for me because I took\nmy camera and explored! I walked from Santa Monica Pier to Venice Beach and\nsoaked in the gorgeous SoCal sun.\n\nIn Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously,\nprobably the best I've ever had in my life.\n\n\n\nIn Venice Beach, I decided to have a lighter option and enjoyed some Burrata and\nBeets at Larry's Bar & Grill.\n\n\n\nThe most adventurous meal was at dinner with a friend at Wurstküche. We enjoyed\nsome cold beers and Rattlesnake Sausages. It honestly didn't taste much\ndifferent from other sausages and was actually pretty good but I can't say I'd\ncomfortably eat that again.\n\n\n\nThe weekend was filled with new musical obsessions, including Zhu & Flume\n(seriously check out that playlist ^), new friends, delicious eats, and lots and\nlots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the\nunfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon,\nSean Paul, and Nico&Vinz during Matoma's set.\n\n\n\n\n\nI came back home the following Monday sunburned (what happens when you wander\naround LA without sunscreen) and exhausted out of my mind; Cue sickness.\n\nThis was my first year attending Coachella, every instagrammer's and basic\nbitch's haven. Of course I had to have ONE basic picture myself to commemorate\nthe experience.\n\n\n\nCoachella is also a GREAT place for foodies. While you needed to be a VIP to get\naccess to some of the tastiest and more exclusive food, there was plenty of\ndelicious options to spare. Looking back at my food photos, I realize that I\nbasically survived off fries. Just fries. And obviously watermelon, because it\nIS Coachella. But these fries were no ordinary fries my friends. They were all\nloaded with various toppings and delicious goodness.\n\nVeggie Monster Fries with lots of types of slaw and jalapeños!\n\n\nVegetarian Poutin Fries with cheese curds!\n\n\nCrab Fries! This meant crab aioli AND crab topping! Double yum!\n\n\nChicharones Fries with Sriracha and curry aioli!\n\n\nI honestly have no idea how most of these things were made but my stomach was\nhella happy. :)","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","tags":[{"id":"5c47a6f22037ef002282c321","name":"coachella","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","name":"poutin","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","name":"crab","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","name":"chicharones","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","name":"music","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","name":"venice beach","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","name":"santa monica","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","name":"LA","slug":"la"},{"id":"5c47a6f22037ef002282c329","name":"rattlesnake","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","name":"burrata","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c360","uuid":"bd3e7708-eadc-4969-886c-47fdd2138304","title":"How to do a food crawl","slug":"food-crawl","published_at":"25 April, 2016","plaintext":"I'm sure most of y'all have been on a bar crawl - you have a list of bars, and\nyou hit them up one after the other, sipping a little of this and a little of\nthat at each one.\n\nThis is similar, but with FOOD. While you are certainly welcome bring booze into\nthe mix, these are instructions for figuring out an all food crawl; it's an\nexcellent way to explore a new city!\n\nIt's also a really good way to spend a couple of hours with friends without\nspending a ton of money; if you're on a budget, this is a great way to try lots\nof different food, and see quite a bit, without breaking the bank. We each paid\nfor one entree at one place, and it came out perfectly for us!\n\nFirst, you need a walkable city. I myself did this with my friends Eden and\nHafsa in San Francisco, the day I last left Sumu.\n\n\n\nSecond, do some preliminary research. Don't actually choose all the places you\nwant to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff\nyou're interested in exploring. We found ourselves wandering around the Mission\nDistrict, ogling wall art and talking about gentrification.\n\nThird, set off on your journey! Start with a place you know you want to go to;\nwe started with Philz Coffee, which also let us sip and wander for a bit before\nwe found real food.\n\n\n\nOver the course of the next several hours, we tried Thai food, Mexican food,\nVietnamese food, and, finally, Ethiopian food. At each place, we would choose\none entree to share, so that in the end, we all got to try tons of yummy food\nfor relatively little!\n\nWe were having so much fun we failed to take a lot of pictures, but this is\ndefinitely one of those days that I'll be remembering for quite a while! If you\ndo a food crawl, let me know how it goes!\n\nAnd, if you're in DC or San Francisco and you're interested in doing this, hit\nSumu or I up! We'd love to have you :)","feature_image":"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c250","name":"thai","slug":"thai"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c31b","name":"betterlate","slug":"betterlate"},{"id":"5c47a6f22037ef002282c31c","name":"than never","slug":"than-never"},{"id":"5c47a6f22037ef002282c31d","name":"monday","slug":"monday"},{"id":"5c47a6f22037ef002282c31e","name":"food crawl","slug":"food-crawl"},{"id":"5c47a6f22037ef002282c31f","name":"ethiopian","slug":"ethiopian"},{"id":"5c47a6f22037ef002282c320","name":"mission","slug":"mission"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c378","uuid":"4f6c5f80-e95b-43b4-882b-0df100605e8e","title":"New City, New Beginnings","slug":"new-city-new-beginnings","published_at":"14 April, 2016","plaintext":"So things have been a bit crazy for me over the last few weeks. I made my first\nsolo move as an adult. I packed up my apartment in Sunnyvale and finally  moved\nto San Francisco. If you're wondering why I picked this specific Van Morrison\nsong, I felt like it was meant to be. The song Saint Dominic's Preview has a lot\nof references to the Saint Dominic's Church on the intersection of Bush and\nSteiner in San Francisco, literally a block from my new apartment. Everyday when\nI walk back from the bus stop after work, I pass by this gorgeous church and\nadmire it. It just felt right to pick this song for the post. :)\n\nHowever, if that song isn't your speed and you want something a little more\nsultry, try this one by Carmen McRae.\n\nI've had a blast since moving out here. I get to see my friends almost every\nday. I have a wonderful new roommate who I've known since college. Even after\nonly a week, I've got to attend all sorts of weird and yet awesome things! This\nwas an art exhibit that was installed right outside City Hall over this past\nweek.\n\n\n\n\n\nAnd best of all, I get to cook with my friends, both old and new! I went over to\na friend's place yesterday night and me and a new friend, Kerry, began to make\nsome DELICIOUS fresh spring rolls. Granted, the recipe for this has been posted\non this site before, the food could never have been more delicious and\ndifferent. We filled these with lettuce, shrimp, vermicelli noodles, and more!\nWe even made some peanut sauce to dip the rolls in (just mix some hoisin sauce\nand creamy peanut butter together). Simple, yet delicious!\n\nWe did have some mishaps during the process. San Francisco kitchens are usually\nTINY, as are a lot of the apartments. My friend's kitchen is very much sizable\nfor 1 person cooking. When you try to squeeze 4 people in there, chaos ensues.\n\n 1. We were lied to about the presence of peanut butter, hence sending the boys\n    on one trip to the store\n 2. Kerry and I weren't aware that the pasta strainer LOCKED onto the pot we\n    were cooking the noodles in. This unfortunately caused ALL of the noodles to\n    fall into the sink, hence a second trip to the store to get more noodles\n 3. The boys may never let us live this down. Highly unlikely after all the sass\n    given while Kerry and I made their dinner.\n 4. They showed me this amazing group that performs acoustic covers of popular\n    songs [https://www.youtube.com/watch?v=3Y7Vq9749s8]... MIND BLOWING. I'm not\n    gonna lie I may have teared up a bit.\n\nWhile I may not have an explicit recipe for you, I have plenty of photos and\nfull stomachs as proof. Enjoy!","feature_image":"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c30e","name":"spring rolls","slug":"spring-rolls"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c30f","name":"fresh rolls","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c317","name":"shrimp","slug":"shrimp"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35d","uuid":"5d93fae7-5e07-402e-af38-726fefb3d41b","title":"Save a Horse... Ride a Cowboy ;)","slug":"save-a-horse-ride-a-cowboy","published_at":"10 March, 2016","plaintext":"I'm actually really torn on which song to treat you guys to this week. So I'm\ngonna let you guys choose! \"Save a Horse, Ride a Cowboy\" OR \"Cowboy Casanova,\"\nbecause who doesn't love Carrie Underwood. Both songs are great; one is filled\nwith all sorts of very raunchy lyrics whereas the other is just Carrie Underwood\nbadassery. Anyways... the choice is yours!\n\nChoose wisely young padawan!\n\nI hate buying special ingredients whenever I'm cooking. There are so many\ndifferent varieties of food I love making and it makes no sense for me to\nmaintain a kitchen stocked with ALL the ingredients for whenever I'd want to\nmake any of these things. Usually when I post recipes, I try to use the\ningredients I already have, can make substitutes, or keep the grocery shopping\nto a minimum. #LivinLaVidaLazy\n\nI didn't have some of the specific ingredients so I used a bunch of more\ncommonly available substitutes and tasted it every now and then if I needed to\nmake adjustments. My recipe is roughly based on a recipe from Gimme Some Oven\n[http://www.gimmesomeoven.com/homemade-bbq-sauce-recipe/]  & Food Renegade\n[http://www.foodrenegade.com/homemade-worcesterschire-sauce/]. However, doubt me\nas you will, I had my friend who's grown up in Texas taste test my sauce and he\nloved it. You don't mess with Texans and their BBQ sauce... they know their\nsauce. He did give me one suggestion that I'll pass along to you guys, which was\nto add Liquid Smoke. Personally I have no idea what that is, but apparently it\nis life changing.\n\n\n\n\n\nHomemade BBQ Sauce\nIngredients:\n1/4 cup molasses\n 1/4 cup mustard\n 1/2 cup red wine (or apple cider vinegar)\n 1 tsp paprika\n 1 tsp garlic powder\n 1 tsp freshly ground garlic\n salt to taste\n a few pinches of cayenne pepper to taste\n Tomato Sauce + Paste\n3 Roma tomatoes, pureed\n 1/4 cup ketchup (or puree 1 more tomato with some salt)\n \"Worcestershire\" Sauce\n1/2 cup red wine (or apple cider vinegar)\n 1 tbsp molasses\n 1 tbsp tamarind paste\n Juice of 1 lime\n 1/2 tsp ground clove\n 1/4 tsp garlic\n 1/4 tsp chili powder\n Directions:\nWhisk all the ingredients together in a saucepan over medium heat. Bring to a\nsimmer then reduce to medium-low. Allow the sauce to simmer uncovered until it\nhas thickened to the right consistency.\n\nUse the sauce immediately or refrigerate for up to 1 week.\n\nI used my sauce to make some delicious pulled chicken in my slow cooker. I used \nthis post from Family Fresh Meals\n[http://www.familyfreshmeals.com/2014/06/best-crockpot-bbq-chicken.html]  to\nfigure out how to actually cook the chicken and didn't bother adding the extra\nItalian dressing, Worcestershire Sauce, etc. Also in keeping with the\n#LivinLaVidaLazy theme, I didn't even bother buying buns for the chicken. I just\ndevoured it on various types of crackers I had at home. Best thing about this\nsauce is that you can use it in SO many different ways. Not only did I use it\nfor pulled chicken, but we coated some fried tofu with the sauce to take our\nfresh rolls to a whole new level.","feature_image":"https://pramods.box.com/shared/static/9rqxf3dpvx4qrfmuuqcosdfr6sjjv3v2.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2fc","name":"bbq","slug":"bbq"},{"id":"5c47a6f22037ef002282c2fd","name":"southern","slug":"southern"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c2fe","name":"sauce","slug":"sauce"},{"id":"5c47a6f22037ef002282c2ff","name":"comfort","slug":"comfort"},{"id":"5c47a6f22037ef002282c300","name":"country","slug":"country"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37e","uuid":"a95f8d2d-1470-4844-aa6e-784a730e7ce2","title":"Estoy Cantando","slug":"estoy-cantando","published_at":"06 January, 2016","plaintext":"\n\nAnyone who has had the honor  of being in my presence this week knows that I've\nbeen playing one song on repeat. One song. All week. Why you may ask?\nDUH...BECAUSE IT'S AMAZING.\n\n(Now's when you play this song and dance along while finishing to read this\npost.)\n\nMy brother was visiting me for a week and I quickly realized 1) apparently no\none comes to work during the holidays in my office, meaning sub-par lunches and\ndinners all week and 2) I hadn't done groceries in weeks, meaning I didn't have\nanything to feed the kid while he was staying with me. Being the ever so\nresponsible adult that I am, I decided that I could muster enough patience to\ncook lunches and dinners for my brother a few times, or at least while I was\nworking from home. We braved it out to a farmers market and brought back a\ncollection of various vegetables without any idea of what to make. While\nbrainstorming ideas my brother decided that since he was spending a week in\nCalifornia, he was going to try and eat Mexican food for each and every meal.\n\nMy next step was to figure out what kind of Mexican dish to make when all I had\nbought was stir fry vegetables. Voilà! MEXICAN \"STIR FRY\"! Or I guess as normal\npeople call it... TOSTADA BOWLS!\n\n\n\nThere's not really a recipe for this post because honestly I kind of made it up\non the spot. BUT I can give you some bits and pieces of what went in this so you\ncan make your own variation of this dish at home! (I KNOW, how sweet of me.)\n\nThis dish is essentially a layer of cilantro lime rice, refried beans,\nvegetables sautéd fajita style, salmon (totally optional and honestly kinda\nruined the dish for me, my brother's vegetarian one was on point), guacamole,\nsour cream and cotija cheese a.k.a. fancy Mexican cheese. Plus you can throw\nsome chopped green onions on top to make it look all pretty and fancy.\n\n\n\nI've always loved making Mexican food. It's so flavorful and deliciously\nrewarding every time! Every single part of a burrito/taco/bowl is overflowing\nwith unique tastes that seem extremely complicated and intricate. I'll let you\nin on a little secret...I use the same seasoning to cook every single part of\nany Mexican dish I make. Whether it be the refried beans or fajita vegetables,\nit's all various spice levels of the same recipe. I'm sure that's not how\nauthentic Mexican food is made, but hey...mine tastes pretty damn good too.\n\nSumedha's Super Secret Fajita Seasoning\nFeel free to mess around with the proportions of each ingredient! Make as much\nor as little seasoning to go in\n\nIngredients:\n2 tsp cumin\n 1 tsp cayenne pepper\n 1 tsp paprika\n 1 tsp salt\n 1 tsp garlic powder\n Directions:\nMix it all together\n\nFor the guacamole, I generally use the recipe graciously provided by Chipotle\n[https://www.chipotle.com/guac-recipe]. Sometimes I add some cumin or replace\nthe jalapeños with cayenne pepper if I'm feeling dangerous. To go off on a\ntangent, couldn't you watch this gif of guacamole being made forever? 1) I feel\nreally bad for/impressed by the person who disrobed all those avocados and 2) I\njust want to dive into that bowl tongue first. (Excuse me while I make myself a\nbowl)\n\n\n\nSeveral minutes later\n\nThat's about it! Just sauté the vegetables of your choosing with some oil and\nfajita seasoning, heat up a can of black beans on the stove with fajita\nseasoning, whip up a bowl of guac, season some rice, and pile it all into a bowl\nfor maximum enjoyment.\n\nYUM\n\n\n\n\n\nALSO! If you haven't already check out our instagram with all sorts of\ndelectable pictures of recipes past and future! Do it! Click on the adorable\ninstagram logo!\n\n  [https://www.instagram.com/cookinginpjs/?ref=badge]","feature_image":"https://lh3.googleusercontent.com/On_C3sVekW8RNs9hpoj0MIDrJT00W5fWI7kTOe_-IafE3KppeMwwGQAH0hgHyAsyIfL0wcNPMy-hTHPG82rQYEp8TEFp7rBq798cchUmZcuhpvMACjbfBzZ-s4Rtcd1RwDYNgy3zczqZOCNIyXnMYDeYs6vp3vzsKvQ2_iof13Ye06I5qP97pXrlGz6nC5EE8M23IhTLrpxphEXlJH5eNQ3BRbRiEy7BtKmu-GQwEqzLnrysk4oHdhk_2pFU0xY_CeIhJEkOEvgt2snl16cvP-F1inJW_1D_38G0UgDDF8dFm-y95hNIYY1TYOsiTSDB2nr3jCdw4ii6utGU3k7isNNOlOSGf6sqjnBhEd-ufwL0AiQ1CU5CCle5p4-t7MNW7BTP-xSrKu_fhQPd2yshC_ZL4X2ZDrgFU5rXcJzDjfALGCGlqoO6hegUnK8XBblYqP5p0ENlI6_Tpt3GZ1VuC77PDn-SKSSvig-jqbgxU6IaUFtZwSF26m75wFdl-bwm-Qg1hIzlE8RIp1cXg2MYJwg4lj_PRxjxfZ8eWPtIkuklJI_Z2NS5MXtweiWc5EaIAbm74w=w1186-h790-no","tags":[{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2ab","name":"bowls","slug":"bowls"},{"id":"5c47a6f22037ef002282c25d","name":"stir fry","slug":"stir-fry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34f","uuid":"7e8c442d-4c8d-4c6b-8667-33acc5c95e1a","title":"The Glorious Monstrosities of Frita Batidos","slug":"frita-batidos","published_at":"27 March, 2015","plaintext":"\n\nFrita Batidos is one of the crown jewels of Ann Arbor, MI. It is a small cuban\nstreet food restaurant in downtown Ann Arbor. While it may be a slight walk from\nthe University of Michigan campus, many students make the trek despite any\nridiculous weather conditions to get a bite of these burgers.\n\nThey have the one of the most delicious, insanely huge and jam packed burgers\nI’ve ever eaten in my life. No matter the patty you want inside your burger,\nwhether it be black bean, chicken, or chorizo, you’re bound to get a tasty\nconcoction which will blow your mind. Honestly I have yet to meet a person at\nthe University of Michigan who doesn’t like their burgers.\n\nThe basic burger (or Frita) is simple, just the patty between two egg buns and\nstuffed with fries. I also added some cilantro-lime salsa and tropical slaw to\njuice it up a little. Safe to say, I don’t think I would be trying to impress\nanyone while eating this monstrosity.\n\n\n\nMy brother always goes with a sunny side up egg and avocado spread on his frita.\nAs soon as you bite into the burger, the yolk bursts, spreading that wonderful\nflavor into every bite thereafter.\n\n\n\nThis trip to Frita Batidos was special because we brought one of my friends here\nfor her first time. She decided to go big or go home and made her frita “loco.”\nThis means that they just go “loco” and add ALL of their available toppings on\ntop of your burger: muenster, a sunny side up egg, cilantro lime salsa, tropical\nslaw, AND avocado spread! This is pretty much the mother of all burgers. I mean\nits GINORMOUS. My friend wasn’t even able to attempt to eat this with her hands.\nBut oh was it delicious.\n\n\n\nDon’t get me started on their garlic-cilantro fries. Frita Batidos has some of\nthe simplest yet most amazing fries I’ve had. I can’t even describe them, you\nhave to try them yourself!\n\n\n\nIf you are ever in Ann Arbor MAKE SURE  you head to downtown to taste one of\nthese monstrosities, these glorious monstrosities of Frita Batidos.\n\nCheck them out [http://www.fritabatidos.com]!","feature_image":"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c263","name":"frita batidos","slug":"frita-batidos"},{"id":"5c47a6f22037ef002282c264","name":"burgers","slug":"burgers"},{"id":"5c47a6f22037ef002282c265","name":"cuban","slug":"cuban"},{"id":"5c47a6f22037ef002282c266","name":"garlic","slug":"garlic"}]}}]}},"pageContext":{"slug":"carnivores","limit":6,"skip":0,"numPages":1,"currentPage":1}}