{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"How to do a food crawl","slug":"food-crawl","feature_image":"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg","published_at":"25 April, 2016","html":"<p>I'm sure most of y'all have been on a bar crawl - you have a list of bars, and you hit them up one after the other, sipping a little of this and a little of that at each one.</p>\n<p>This is similar, but with FOOD. While you are certainly welcome bring booze into the mix, these are instructions for figuring out an all food crawl; it's an excellent way to explore a new city!</p>\n<p>It's also a really good way to spend a couple of hours with friends without spending a ton of money; if you're on a budget, this is a great way to try lots of different food, and see quite a bit, without breaking the bank. We each paid for one entree at one place, and it came out perfectly for us!</p>\n<p>First, you need a walkable city. I myself did this with my friends Eden and Hafsa in San Francisco, the day I last left Sumu.</p>\n<p><img src=\"https://pramods.box.com/shared/static/nswhwh2moi2lyt9ett886237vfike5xh.jpg\" alt=\"\"></p>\n<p>Second, do some preliminary research. Don't actually choose all the places you want to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff you're interested in exploring. We found ourselves wandering around the Mission District, ogling wall art and talking about gentrification.</p>\n<p>Third, set off on your journey! Start with a place you know you want to go to; we started with Philz Coffee, which also let us sip and wander for a bit before we found real food.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg\" alt=\"\"></p>\n<p>Over the course of the next several hours, we tried Thai food, Mexican food, Vietnamese food, and, finally, Ethiopian food. At each place, we would choose one entree to share, so that in the end, we all got to try tons of yummy food for relatively little!</p>\n<p>We were having so much fun we failed to take a lot of pictures, but this is definitely one of those days that I'll be remembering for quite a while! If you do a food crawl, let me know how it goes!</p>\n<p>And, if you're in DC or San Francisco and you're interested in doing this, hit Sumu or I up! We'd love to have you :)</p>\n","plaintext":"I'm sure most of y'all have been on a bar crawl - you have a list of bars, and\nyou hit them up one after the other, sipping a little of this and a little of\nthat at each one.\n\nThis is similar, but with FOOD. While you are certainly welcome bring booze into\nthe mix, these are instructions for figuring out an all food crawl; it's an\nexcellent way to explore a new city!\n\nIt's also a really good way to spend a couple of hours with friends without\nspending a ton of money; if you're on a budget, this is a great way to try lots\nof different food, and see quite a bit, without breaking the bank. We each paid\nfor one entree at one place, and it came out perfectly for us!\n\nFirst, you need a walkable city. I myself did this with my friends Eden and\nHafsa in San Francisco, the day I last left Sumu.\n\n\n\nSecond, do some preliminary research. Don't actually choose all the places you\nwant to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff\nyou're interested in exploring. We found ourselves wandering around the Mission\nDistrict, ogling wall art and talking about gentrification.\n\nThird, set off on your journey! Start with a place you know you want to go to;\nwe started with Philz Coffee, which also let us sip and wander for a bit before\nwe found real food.\n\n\n\nOver the course of the next several hours, we tried Thai food, Mexican food,\nVietnamese food, and, finally, Ethiopian food. At each place, we would choose\none entree to share, so that in the end, we all got to try tons of yummy food\nfor relatively little!\n\nWe were having so much fun we failed to take a lot of pictures, but this is\ndefinitely one of those days that I'll be remembering for quite a while! If you\ndo a food crawl, let me know how it goes!\n\nAnd, if you're in DC or San Francisco and you're interested in doing this, hit\nSumu or I up! We'd love to have you :)","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c250","name":"thai","slug":"thai"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c31b","name":"betterlate","slug":"betterlate"},{"id":"5c47a6f22037ef002282c31c","name":"than never","slug":"than-never"},{"id":"5c47a6f22037ef002282c31d","name":"monday","slug":"monday"},{"id":"5c47a6f22037ef002282c31e","name":"food crawl","slug":"food-crawl"},{"id":"5c47a6f22037ef002282c31f","name":"ethiopian","slug":"ethiopian"},{"id":"5c47a6f22037ef002282c320","name":"mission","slug":"mission"}]}},"pageContext":{"slug":"food-crawl","previous":{"html":"<p>I know I know this week I'm kind of skimping out! I have been rushing to get my week's work done by yesterday so that I can be ready to fully enjoy Coachella this year! I am currently on my way there and unbelievably excited! I will report back next week with all the food and excitement!</p>\n<p>I had made these Cinnamon buns a while back when I used to make treats for my coworkers (unfortunately it's been some time since I've done that). I didn't really experiment too much, more or less made the recipe verbatim. I found this recipe for simple and quick <a href=\"http://www.halfbakedharvest.com/whole-wheat-30-minute-mini-cinnamon-buns-and-they-are-healthy/\">whole wheat mini cinnamon buns</a>.</p>\n<p>My chief complaint with this recipe is the fact that whole wheat gives it a whole different and drier texture. Personally if I were to remake these, I'd just use normal flour and make smaller size cinnamon buns. They're tiny anyways so we can splurge on the flour ;)</p>\n<p>Let me know what you think!!</p>\n<p><img src=\"https://pramods.box.com/shared/static/wd6yuffsgpi30wby34ow9ew6hmzb2wom.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/qulje72c2gd7qydbwogjmo9hzt0j9syj.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/atopoadpbxnaqr76f2hxjft79n4c8wxe.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/fze2l6asol2ik625i8v08jdbd4gj35lj.jpg\" alt=\"\"></p>\n","title":"Teeny Weenie Itsy Bitsy Cinni Minis","slug":"teeny-weenie-itsy-bitsy-cinni-minis","published_at":"20 April, 2016","feature_image":"https://pramods.box.com/shared/static/wd6yuffsgpi30wby34ow9ew6hmzb2wom.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c29b","slug":"cinnamon"},{"id":"5c47a6f22037ef002282c30f","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c255","slug":"desserts"}]},"next":{"html":"<p>There's something about the combination of chocolate and orange that just gets me every time. I love to make hot chocolate with just a few drops of orange in it, and I have been dying to make chocolate-y bread with bits of orange zest woven through it.</p>\n<p><img src=\"https://pramods.box.com/shared/static/j3affjujmdzyx46vui37m7aux09yuvg8.jpg\" alt=\"\"></p>\n<p>But this weekend, I found myself with coconut flour and coconut cream, and decided on chocolate cookies with a delicious, lightly orange-flavored cream.</p>\n<p>If you want to get all hipster buzzwords about it, this recipe is: grain free, refined sugar free, vegan.</p>\n<p>If you just want to be totally super normal about it, this recipe is: delicious.</p>\n<p>Give it a try :)</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Orange Cream//Chocolate Cookies</h2>\n    <div class=\"summary\">\n      <p><em>This is a super simple and quick recipe. There is literally no reason not to give it a try.</em></p>\n      <p>Yield: 26 1.5\" cookies</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Chocolate Cookie</h4>\n          <li class=\"ingredient\">3/4 C Coconut Flour</li>\n          <li class=\"ingredient\">1/4 C Cacao Powder</li>\n <li class=\"ingredient\">1/4 C Coconut Oil</li>\n <li class=\"ingredient\">1/4 C Maple Syrup</li>\n <li class=\"ingredient\">Soy milk as needed</li>\n        <h4>Orange Cream</h4>\n          <li class=\"ingredient\">1 Can Chilled Coconut Cream</li>\n          <li class=\"ingredient\">1/4 C Powdered Sugar</li>\n<li class=\"ingredient\">Three Drops Orange Oil</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n1.) Mix together coconut flour and cacao powder in a bowl. \n</p><p>\n</p><p>\n2.) Put the coconut oil (solid; refrigerate if needed) into the flour mixture and cut it with a fork. You want it to be sort of crumbly and sandy when you're done. \n</p><p>\n</p><p>\n3.) Pour the maple syrup (cold) into the mixture, and again, mix it in with a fork. This mixture will remain sort of sandy and crumbly. \n</p><p>\n</p><p>\n4.) Add soy milk a tablespoon at a time. Your dough will be a little crumbly, but will stick together in one huge mass when you're done. It won't be elastic, but it will stick together reasonably well. \n</p><p>\n</p><p>\n5.) Shape into 26 cookies and set on a greased baking sheet - these cookies won't spread, so flatten them to the shape you want. Stick in the fridge, and preheat the oven to 350. \n</p><p>\n</p><p>\n6.) When the oven is ready, put your cookies in and set a timer for fifteen minutes. Mine took right around 18, so I would check them at fifteen, and let them go till they're done! \n</p><p>\n</p><p>\n7.) While the cookies are baking, take out your coconut cream and flip it upside down. Open it, and there should be some liquid there. Pour that into a cup (it's delicious, and can be used in smoothies) and scoop out the cream into a separate bowl. Whip, then add the sugar and orange oil and whip some more. \n</p><p>\n</p><p>\n8.) Take a cookie, through a dollop of cream on there and dig in; delicious! \n        </p>\n      </div>\n    </div>\n  </div>\n</div>","title":"Orange Cream//Chocolate Cookies","slug":"orange-cream-chocolate-cookies","published_at":"02 May, 2016","feature_image":null,"tags":[]}}}