{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35d","uuid":"5d93fae7-5e07-402e-af38-726fefb3d41b","title":"Save a Horse... Ride a Cowboy ;)","slug":"save-a-horse-ride-a-cowboy","published_at":"10 March, 2016","plaintext":"I'm actually really torn on which song to treat you guys to this week. So I'm\ngonna let you guys choose! \"Save a Horse, Ride a Cowboy\" OR \"Cowboy Casanova,\"\nbecause who doesn't love Carrie Underwood. Both songs are great; one is filled\nwith all sorts of very raunchy lyrics whereas the other is just Carrie Underwood\nbadassery. Anyways... the choice is yours!\n\nChoose wisely young padawan!\n\nI hate buying special ingredients whenever I'm cooking. There are so many\ndifferent varieties of food I love making and it makes no sense for me to\nmaintain a kitchen stocked with ALL the ingredients for whenever I'd want to\nmake any of these things. Usually when I post recipes, I try to use the\ningredients I already have, can make substitutes, or keep the grocery shopping\nto a minimum. #LivinLaVidaLazy\n\nI didn't have some of the specific ingredients so I used a bunch of more\ncommonly available substitutes and tasted it every now and then if I needed to\nmake adjustments. My recipe is roughly based on a recipe from Gimme Some Oven\n[http://www.gimmesomeoven.com/homemade-bbq-sauce-recipe/]  & Food Renegade\n[http://www.foodrenegade.com/homemade-worcesterschire-sauce/]. However, doubt me\nas you will, I had my friend who's grown up in Texas taste test my sauce and he\nloved it. You don't mess with Texans and their BBQ sauce... they know their\nsauce. He did give me one suggestion that I'll pass along to you guys, which was\nto add Liquid Smoke. Personally I have no idea what that is, but apparently it\nis life changing.\n\n\n\n\n\nHomemade BBQ Sauce\nIngredients:\n1/4 cup molasses\n 1/4 cup mustard\n 1/2 cup red wine (or apple cider vinegar)\n 1 tsp paprika\n 1 tsp garlic powder\n 1 tsp freshly ground garlic\n salt to taste\n a few pinches of cayenne pepper to taste\n Tomato Sauce + Paste\n3 Roma tomatoes, pureed\n 1/4 cup ketchup (or puree 1 more tomato with some salt)\n \"Worcestershire\" Sauce\n1/2 cup red wine (or apple cider vinegar)\n 1 tbsp molasses\n 1 tbsp tamarind paste\n Juice of 1 lime\n 1/2 tsp ground clove\n 1/4 tsp garlic\n 1/4 tsp chili powder\n Directions:\nWhisk all the ingredients together in a saucepan over medium heat. Bring to a\nsimmer then reduce to medium-low. Allow the sauce to simmer uncovered until it\nhas thickened to the right consistency.\n\nUse the sauce immediately or refrigerate for up to 1 week.\n\nI used my sauce to make some delicious pulled chicken in my slow cooker. I used \nthis post from Family Fresh Meals\n[http://www.familyfreshmeals.com/2014/06/best-crockpot-bbq-chicken.html]  to\nfigure out how to actually cook the chicken and didn't bother adding the extra\nItalian dressing, Worcestershire Sauce, etc. Also in keeping with the\n#LivinLaVidaLazy theme, I didn't even bother buying buns for the chicken. I just\ndevoured it on various types of crackers I had at home. Best thing about this\nsauce is that you can use it in SO many different ways. Not only did I use it\nfor pulled chicken, but we coated some fried tofu with the sauce to take our\nfresh rolls to a whole new level.","feature_image":"https://pramods.box.com/shared/static/9rqxf3dpvx4qrfmuuqcosdfr6sjjv3v2.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2fc","name":"bbq","slug":"bbq"},{"id":"5c47a6f22037ef002282c2fd","name":"southern","slug":"southern"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c2fe","name":"sauce","slug":"sauce"},{"id":"5c47a6f22037ef002282c2ff","name":"comfort","slug":"comfort"},{"id":"5c47a6f22037ef002282c300","name":"country","slug":"country"}]}}]}},"pageContext":{"slug":"country","limit":6,"skip":0,"numPages":1,"currentPage":1}}