{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35f","uuid":"e0f988c3-12d8-419a-b327-025e484d0fd2","title":"When a moon hits your eye like a big pizza pi(e)","slug":"when-a-moon-hits-your-eye-like-a-big-pizza-pi","published_at":"07 April, 2016","plaintext":"March 14th is a very famous day. Tis a day of celebration. Tis a day of\nlearning. Tis a day that we call \"Pi Day.\" Tis also a day mostly famous amongst\nengineers, mathematicians, and physicists more than anyone else, but hey we're\nthe awesome ones anyways ;)\n\nWe had a pi(e) baking competition at work. Here's a look at some of the amazing\ncreations that were submitted!\n\n\n\n\n\nOne of the best things about this competition was that began at exactly 1:59pm.\nIt took me a LONG time until I realized that it was intended to begin at 3/14\n1:59, which are the next few digits in pi.\n\nOnce I got over how clutch that was, I began planning what I would bake to enter\nin this competition. There were tons of categories including best newbie, most\ncreative, best savory, best sweet, etc. I decided I would do something different\nand make a savory pie, but what to make... THEN I realized I could make Indian\nsavory pies (cover my dinner for a few days) and attempt to blow everyone's\nminds. I decided to enter 2 pies: a paneer tikka pie and a samosa pie. Yes, I am\nvery well aware that a samosa pie is really just a LARGE samosa, it's just\nsemantics. I have also realized I have watched too much Psych when I use the\nphrase \"it's just semantics\" excessively.\n\n\n\nSince I decided to experiment so much you guys get TWO recipes this week all\nwrapped up inside one post. I know we're terrible people who haven't posted in a\nbit, but I promise we'll make it up to you guys and more. Since I used frozen\npie crust, the overall time I spent baking was actually not as long as I had\nanticipated. I'm not going to write out the whole pie recipe because its fairly\ngeneric and you can follow the timings/instructions on the pie crust box itself.\nI made double crusted pies (where theres crust below and on top of the filling)\nso I just followed the instructions on the top pie crust box. It was something\nlike this crust\n[http://www.pillsbury.com/products/pie-crust/refrigerated-pie-crust], the kind\nyou roll out and lay on top of the pie.\n\n\n\nThere's actually some chicken tikka mini pies in that picture above but that was\nmainly for myself ;)\n\n\n\nPaneer Tikka Pi(e) Filling\nIngredients:\nUncooked paneer, cubed\n 4 tbsp tandoori masala powder (I really like Kissan Tandoori Masala)\n Dahi (curds)\n Directions:\nMix the tandoori masala and 2-3 large spoons of dahi together in a large bowl.\nAdd the paneer and mix until the paneer pieces are fully covered in the\nmarinade. Add more dahi and tandoori masala as needed. Let the paneer marinate\nfor at least 2 hours.\n\n\n\nSamosa Pi(e) Filling\nIngredients:\n3 medium sized potatoes\n 1 cup green peas\n 1 tsp ginger-garlic paste\n 1 tsp garam masala powder\n 1 tsp red chili powder\n 1 tsp dry mango powder\n 1 tsp coriander powder\n 3/4 tsp cumin seeds\n 2 tbsp chopped coriander\n 1 tsp garam masala powder\n lemon juice (to taste)\n salt (to taste)\n Directions:\nFill a pot 3/4 full with water and add the potatoes and a pinch of salt. Boil on\nmedium-high heat until potatoes are cooked completely. Put the potatoes in a\nbowl of cold water to cool for a minute. Peel and chop the potatoes into cubes.\n\nHeat a little oil in a pan. Add cumin and roast. When the cumin starts\ncrackling, add the ginger-garlic paste and sauté until the smell of raw ginger\ngoes away. Lower the heat and add all the dry spices and stir.\n\nAdd the potatoes and peas along with salt (to taste). Sauté for a few minutes\nand then mix in chopped coriander and lemon juice (to taste).\n\n\n\n\n\n\n\nI know this is terrible... but I HAD to. :D","feature_image":"https://pramods.box.com/shared/static/exwct8krjwx28uvx3j7ksk7g91ey4yp5.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c309","name":"piday","slug":"piday"},{"id":"5c47a6f22037ef002282c30a","name":"samosa","slug":"samosa"},{"id":"5c47a6f22037ef002282c30b","name":"paneer","slug":"paneer"},{"id":"5c47a6f22037ef002282c30c","name":"tikka","slug":"tikka"},{"id":"5c47a6f22037ef002282c30d","name":"competition","slug":"competition"},{"id":"5c47a6f22037ef002282c312","name":"pie","slug":"pie"},{"id":"5c47a6f22037ef002282c313","name":"savory","slug":"savory"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c372","uuid":"329792b8-9854-417e-a287-153b2af1d843","title":"Bhaaji Re Bhaaji Re Bhaaji RE!","slug":"bhaaji-re-bhaaji-re-bhaaji-re","published_at":"03 March, 2016","plaintext":"\n\nSo just to make up for my epic fail(s) these past weeks, I'm giving you 2 songs\nto listen to during this post!! (And to console an angry friend of mine :) I\nlove you!)\n\nLast month was the Super Bowl. Probably one of the MOST hyped up events in the\nUnited States. Usually, I'm not affected by much of this hype. There have even\nbeen years where I've forgotten to watch the Super Bowl altogether. I know. HOW\nCOULD I? How very un-American of me. But nonetheless, if my team wasn't playing\nI was generally not too interested.\n\nThis year was different. I've been in a Super Bowl city before; Detroit hosting\nin 2006. I probably lived about the same distance from all the events then than\nI did this time around, but this time was different. Super Bowl 50 was hosted by\nthe city of San Francisco this year. Hilariously enough, the ACTUAL stadium that\nthe teams were going to play at was a good 50 miles away from San Francisco. So\nTECHNICALLY the Super Bowl was hosted by the city of Santa Clara, but how many\npeople actually know where that is?\n\nExactly.\n\nSo all the official hubbub leading up to the Super Bowl was held in downtown San\nFrancisco. They set up this huge thing called \"Super Bowl City\" with various\nevents starting a little more than a week before the actual big game. They had\nEVERYTHING; the puppy bowl, player signings, concerts (including the amazing\nAlicia Keys). San Francisco really pulled out all the stops for the event.\n\nI live in Sunnyvale right now. It's a little suburb town about 45 miles from\ndowntown San Francisco. Usually, no issue. It's a quiet little area with lots of\nfamilies and anything and everything Indian you could ever want. I'm really not\nkidding about that. There's a Indian grocery or jewelry or clothing or something\nstore in each and every strip mall complex (I think that's what they're called\nanyways...) I legitimately give people directions to my house by telling them to\ngo to Madras Cafe (one of the most popular dosa places in all of the Bay Area)\nand then turn onto my street instead of going into that restaurant. Ultimately\nit means that I'm dragged to that restaurant more than I'd ever like, me being\nsomeone who dislikes dosa (go on...hate on me all you want I am that South\nIndian that doesn't like dosa).\n\nAnyways... why is this important you may ask? Sunnyvale just HAPPENS to be\napproximately a 10 minute drive from the new and shiny Levi's Stadium in Santa\nClara. The very stadium that happened to be hosting the Super Bowl last weekend.\nI know, lucky me! I get to go see all these tailgates and do all these cool\nfootball related things. Don't get me wrong... I LOVE football but it made me\nvery bitter all weekend. In case you forgot, all the cool and fun events that\nwere happening for the Super Bowl were happening in downtown San Francisco. So\nno cool pre-Super Bowl events for me. You'd think that AT LEAST I'd get to do\nsome fun things the day of.... NOPE you thought wrong. Apparently you either\nneeded to have specific connections/be a season ticket holder OR you needed to\ncough up some serious money to participate in all of these tailgating events.\nLevi's Stadium also has a strict no-tailgating policy for their parking lots, so\nI didn't get to attend anything. Clearly I'm not bitter at all about this.\n\nAnyway, my Super Bowl plans consisted of making an large amount of Pav Bhaaji\nand watching the game with my friend whilst we stuffed our faces. I was going to\nadd a little bit of a rant about the Coldplay halftime show but that's for\nanother time. I may not be a complete fan of Coldplay's Hymn for the Weekend\nmusic video but I do love the song...so I was very disappointed that they cut it\nfrom the Super Bowl halftime performance.\n\nRegardless, we had pav bhaaji to console us over Chris Martin being the left\nshark of this year's Super Bowl. Pav Bhaji is a wonderful, buttery delicacy from\nthe streets of Mumbai. I'm thoroughly convinced that pav bhaaji tastes better\nwhen you get it from grungier and shadier places, aka a variety of street\nvendors. What street food doesn't taste better, when it's made and served to you\nfrom a giant stove in the middle of some market?!\n\n\n\nI did have a slight mishap in making the pav bhaaji. I was so concentrated on\ncombining a few different recipes into one that I absent-mindedly added\nbisibelebaath masala instead of pav bhaaji masala. While I do love me some\nbisibelebaath... the masala doesn't quite give you the taste you're looking for\nin pav bhaaji. So there I was, watching my disaster simmer and cook on my stove\nwhile the clock ticked down to the start of the game. Then I realized that I may\nhave some the ingredients in my spice rack to make my own make-shift pav bhaaji\nmasala. Pav bhaaji masala is made by grinding cardamom, coriander seeds, cumin,\nfennel seeds, dry chilies, cinnamon sticks, cloves, and dry mango powder. I\nsomehow had most of these things, so I proceeded to add varied amounts of dry\nmango powder, cumin powder, ground cardamoms, and coriander seeds until it\ntasted close to pav bhaaji I like.\n\nNot in any way perfect, but not bad either! My friend being the sweetheart that\nhe is claimed that he loved it! I feel like he was just being a nice friend so I\nhighly recommend getting the pav bhaaji masala and using that instead of making\nyour own with w/e you have in your kitchen. It'll just taste better and closer\nto what you would have wanted to begin with.\n\n\n\nPav Bhaaji\nIngredients:\nGhee\n 1 bell pepper, chopped\n 1 cup water\n 4 roma tomatoes, chopped\n 4 medium potatoes, chopped\n 1 cup cauliflower florets\n 1 1/2 tsp ginger-garlic paste\n 1 onion, chopped\n 2 tbsp pav bhaaji masala\n 1 1/2 tbsp red chili powder\n 1 tsp garam masala powder\n 1 tsp turmeric\n 1 tbsp kasuri methi (dried fenugreek) powder\n lime wedges for garnish\n some chopped onion for garnish\n salt according to taste\n pav buns (plain slider buns can also work)\n Directions:\nIn your pressure cooker, cook the potatoes and cauliflower until soft and\ntender.\n\nAdd butter (or ghee :D) to a large pan. Once it's heated, add the chopped bell\npepper to it. Once that has softened, add a little water and mash.\n\nStir in the tomatoes and boiled vegetables and cook for 2-3 minutes. Add\nginger-garlic paste and sauté for 2 minutes. Once the tomatoes have cooked, mash\neverything with a masher (or anything close to that).\n\nIn a separate pan, sauté chopped onion in ghee until it becomes a pale brown\ncolor. Add all the spices and salt and sauté for a few more minutes. Add some\nmore water if it starts getting dry.\n\nAdd the onion mixture to the bhaaji and mix. Add water until it reaches the\ndesirable consistency. Similarly with the spices and lime juice. Toast some pav\nbuns and enjoy!","feature_image":"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"},{"id":"5c47a6f22037ef002282c2e9","name":"super bowl","slug":"super-bowl"},{"id":"5c47a6f22037ef002282c2ea","name":"salman khan","slug":"salman-khan"},{"id":"5c47a6f22037ef002282c2eb","name":"bollywood","slug":"bollywood"},{"id":"5c47a6f22037ef002282c2ec","name":"pav bhaaji","slug":"pav-bhaaji"},{"id":"5c47a6f22037ef002282c2ed","name":"cravings","slug":"cravings"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c375","uuid":"1afdf9c1-368f-4d78-acab-73f49594829c","title":"Tere Ghar Ke Samne, Khana Banaunga","slug":"tere-ghar-ke-samne-khana-banaunga","published_at":"04 February, 2016","plaintext":"Why this song you may ask? While growing up my mom always used to sing this song\nto me. The song literally translates to \"I'm going to build a house in front of\nyour house.\" It's supposed to be this cute love song where the guy wants to\n\"build his world in front of her house.\" My question is, wouldn't it be more\nromantic if he built a house FOR them WITH her? Why does he only want to be in\nfront of her house? I may be missing some context from the rest of the movie but\nregardless that's a whole different tangent.\n\nThis song was pretty much just my mom telling me she wants to live right across\nthe street from my and constantly spoil her future grandchildren. I'm pretty\nsure my mom wanted a full on re-enactment of \"Everybody loves Raymond.\" But hey,\nwho's gonna complain about a free babysitter and delicious food? :P\n\n**Love you Amma! \n\n(While you're at it, you should also check out her blog here\n[http://uppukhara.com]! It's basically every recipe she made for me growing up\nthat I have random cravings for since I've moved out to California.)\n\nSometimes I feel like I'm not a complete adult yet. Even though I'm currently\nsupporting myself, paying my own bills, taxes, and insurance, I don't always\nfeel like a \"real\" adult. Then, there are times when suddenly I feel like a full\non housewife, which is something I NEVER EVER want to be.\n\nOne such instance was this past weekend, when I was anxiously awaiting the\narrival of my new electric pressure cooker. One thing I'm sure  every child\ngrowing up in an Indian household can relate to, is the sound of a pressure\ncooker. That sound TERRIFIED me to my core throughout my childhood, and to this\nday. I always feel like something somewhere is going to explode. Even in college\nwhen my roommate decided to make dal and turned on the pressure cooker, we used\nto hide behind our bedroom doors waiting for it to go off enough times so could\nturn it off and continue hiding. You'd think that it wouldn't be worth the fear,\nbut honestly have you ever had dal or even better, Bangalore-style saaru? Yea,\nit's worth it. (If you're wondering what that is, it's a less liquidy and better\nversion of rasam with more dal in it). I've tried all sorts of cooking\ntechniques, but saaru just doesn't taste quite the same unless you use a\npressure cooker. And this way, you don't end up wasting hours and hours making\nyour meal. THAT is not worth it.\n\nThe sound of our pressure cooker is even worse for our dog because he can hear\nthe noise WAY before we can. He panics and runs all the way up the stairs and\ncowers near my parent's bedroom door. This happens without fail every time my\nmom STARTS the pressure cooker. He knows it's coming and refuses to come down\nfrom his hiding spot until he's completely sure it's not going to go off again.\nPoor baby. But I'm sure you'll all realize why once you get your own pressure\ncookers!\n\n\n\nBut AHA! What is this?! An ELECTRIC pressure cooker? What is this magical\ndevice? So quiet and effective? Truly this can't be real! But miraculously, IT\nIS!\n\n\n\nI've never been so excited for any adult purchase in my life, except maybe  my\ncar. This was a glorious purchase. NOT ONLY can it make dal in 4 minutes, but I\ncan use it to make dahi (yogurt or curds generally eaten with indian food),\nrice, and basically anything else in life I could ever think of! ALL WITHOUT\nMAKING A SOUND! I didn't even realize it had even started and it made a beeping\nnoise indicating that my food was READY! It's wonderful.\n\nAmidst all this excitement over the pressure cooker, I got kind of homesick for\nmy mom's food. I then proceeded to facetime my mom for an hour while she\ncarefully explained step by step instructions on how to make one of my favorite\nchildhood dishes, Bendekai Huli or for you non-Kannada speaking people out\nthere, Okra Sambar. Most kids hate okra, but honestly it's one of my favorite\nvegetables, especially when it's in Indian food.\n\nI know this might not be the most flattering picture of any of us (mainly my\nbrother) but whatever.\n\nOne thing I will mention is that I am not sure where to get the huli pudi\n(sambar powder). My parents usually bring bags back from this little store in\nBangalore every time anyone visits, but I'm sure you can find something similar\nin local Indian stores. I mean, I know I couldn't live without sambar so I'm\nsure there are other people who feel the same way and have found a way! There\nare also instant mixes available at the Indian store - while these aren't quite\nas good, they can satisfy the occasional craving!\n\nNow that you've learned a little bit of Kannada, and hopefully are as excited as\nI was, let's begin!\n\n\n\nOkra Sambar or Bendekai Huli\nI'm giving these instructions based on my electric pressure cooker. You may have\nto adjust the dal portion of the recipe according to however you make it.\nPressure cookers scare the bejesus out of me so be careful!\n\nIngredients:\nDal\n1 cup toor dal\n 1/2-3/4 tsp turmeric powder\n 2 1/2 cup water\n Sambar\noil\n 1/2-3/4 tsp mustard seeds\n 1 small package frozen okra\n 1/2-3/4 tsp tamarind paste\n 1 1/2 spoons huli powder (sambar powder)\n water\n Directions:\nAdd the toor dal to your pressure cooker and rinse. Add the water and turmeric\nand turn on the pressure cooker. I did the Manual setting for 4 minutes. Also\nmake sure its set to low pressure and all the pieces are in place. When the\npressure cooker was done it went into keep warm (displayed \"L00:00\") and started\ncounting up. I unplugged it and let it release the pressure on its own.\n\nIn a pot, add some oil and mustard seeds on medium heat, this is called vagarne.\nWhen the mustard seeds start popping, add the frozen okra. When the okra starts\nto get kinda sticky and stringy, add the tamarind paste and a little bit of\nwater. Keep cooking and mixing the okra occasionally until it is cooked through.\n\n![](https://pramods.box.com/shared/static/uq45bcrldnses3q369jmzcs1v1srqmqv.jpg)\n Add huli powder and salt to taste and let it come to a boil. Add the dal and\nmore water until it's the right consistency. Taste it as you go. I needed to add\na little more tamarind paste and huli powder to fit my taste but that depends\nperson to person.\n\nLet it cook for a few minutes and enjoy!","feature_image":"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c297","name":"mom","slug":"mom"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2d1","name":"pressure cooker","slug":"pressure-cooker"},{"id":"5c47a6f22037ef002282c2d2","name":"crock pot","slug":"crock-pot"},{"id":"5c47a6f22037ef002282c2d3","name":"okra","slug":"okra"},{"id":"5c47a6f22037ef002282c2d4","name":"sambar","slug":"sambar"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c369","uuid":"7be4e4ee-6239-411d-952a-c769fc32ade5","title":"It's DOSA TIME.","slug":"ada-dosa","published_at":"11 January, 2016","plaintext":"I have not always been a fan of dosa. In fact, for years I would only eat it if\nit was accompanied by tanks of chutney (why yes, I would like some dosa with\nthat). But then I tried ada (a-day) dosa, and my life changed.\n\n\n\n\n\nDosa is a south asian savory crepe - type bread. It's made of rice which is\nsoaked, ground, and allowed to ferment. Ada dosa is the simpler, and to me, much\ntastier cousin - made entirely of rice, lentils, and legumes, it is both\nextraordinarily healthy and delicious.\n\n\n\nThis is the food I beg my mom to make every time I visit home, and is one of the\nfirst things I learned to make when I set out on my quest to learn to cook\nIndian food.\n\nAda Dosa\nThe recipe I'm sharing today is one that I know works, but you can substitute\nall the lentils and legumes with pretty much any other lentil or legume. You\njust have to make sure that you soak the hardier legumes (black eyes peas,\nkidney beans, black beans, etc.) overnight, and the lentils and rice for three\nor four hours. It's also important to have a good rice to lentil ratio. You want\nto make sure that approximately one third of the total quantity is rice, so if\nyou have two cups combined of lentils and legumes, you would want one cup of\nrice in there.\nThese dosas can be eaten with yogurt, any chutney or pickle you like, or, if\nyou're so inclined, plain. They would also be wonderful with sauteed vegetables.\n \n\nYield: Approximately 10 10-inch dosas, 3 - 4 servings\n\nTotal Time:  1 hour active, 12 hours passive\n\nIngredients:\n1/2 cup black beans\n 1/2 cup chana dal\n 1/2 cup toor dal\n 1/2 cup split peas\n 1 cup brown rice\n 1 1/2 tbls fresh ginger\n 1/2 tbls whole black pepper\n 1/2 tbls cumin\n 1/2 cup coconut (dry and fresh both fine)\n 1/2 bunch cilantro\n fresh green chili, to taste\n salt, to taste\n Directions:\n\n1.) Soak the black beans the night before, and start soaking the lentils about\nsix hours before you want to eat them.\n\n\n2.) Combine all ingredients including spices in the food processor with the\nwater you soaked them in, and let it run. The resulting mixture shouldn't be too\nrunny or too thick, and will be a little grainy, but not chunky. While it won't\nbe as smooth as pancake batter, the lentils should be broken down quite well.\n\n\n3.) Once your batter is ready, turn on your stove and let a skillet heat with a\nsmall amount of oil. You want the skillet to be hot and the oil covering the\nsurface - if you put your batter on the skillet too soon it will stick! Put a\nsmall amount of batter in the center of your skillet, and careful spread it out\nwith a spiraling motion until it's the desired size. Pour a small amount of oil\n(1/4 teaspoon) on the surface of the dosa, and then cover the pan.\n\n\n4.) Let it cook for three - four minutes, before removing the cover, and\nflipping the dosa so the other side can cook.\n\n\n5.) Cooking time varies based on the stove and the pan you're using, so give\nyourself a bit of leeway here. If your first dosa falls apart (as mine did)\nscrape it off, rinse your skillet, and start fresh - with a bit of trial and\nerror, these become super easy! Once both sides of your dosa are cooked, it's\nready! Pull up a plate and dig in :)","feature_image":"https://lh3.googleusercontent.com/KWBBMYdzG5jqFpPXoOT5tZ1XsclaWzt3q4QXau3omGevmZidRFmpBSyJzvwum8K3YWVTaBFm3A4sgYrTCSYsfqErYq2A1UvLd7xEfm7jSmFkzQUUmjkEVWf5aySOjbmoQApXNZcDaBjGOb19JaK_mmg2KemL_-8Ggno5E-Rzck0QJLwUvBIT_ocr1v_V7iMgvSFZWO5OuPz0fDLU4XpknoQc0F5mueX1giHpDA3HHrUSSys4zeK5hyDv6iyyLnoYi5FbHl7dpEkG4DRQRv0cZvMa3LL_j-sfWNdD6mCGBQvyZFN3txUUgf6TDvqlC--0GXgzZAXVLP-G6Fnu2KK5qXXXJUPjkQz8quqmgBlA317IANaRjhBJ8gSFvd-2WYHySPHE7SPadbtaA6tbxGPxrEFppYuar1bLl4Lw3LbG-ieBLG0Gb_b1QED316YX4aN9VErOpOgI-9IxxhPjWOUIovADqIdpB9U0haOTqsOWUTbUO-kSAN5Zjh05RIqfUhco5hrzNw_Y4B5bQqR-E0OQ6X0e2xOMV5Xo9PWVUA-JxlsQSCb1NNlymaRk_5oR5xKXofyX=w362-h643-no","tags":[{"id":"5c47a6f22037ef002282c2ac","name":"dosa","slug":"dosa"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"slug":"indian","limit":6,"skip":0,"numPages":1,"currentPage":1}}