{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c340","uuid":"279e49d2-aba1-4211-82c1-089cbd2da209","title":"Gaadi Chaats","slug":"bread","published_at":"08 February, 2016","plaintext":"Welcome to another trip to India! When I was there, I ate a ton of food. All of\nmy family members were happy to feed me, and between the amazing home cooking,\nand the delicious food available on every street corner, it's almost a miracle\nthat I didn't pack on pounds.\n\nI am, generally, pretty picky about my food. I waver between being vegan and\nvegetarian, and I'm usually pretty careful about ingredients I allow in my\nkitchen. But, like everyone else, I have a fatal flaw and it's this; I love\nstreet food.\n\nI know that someone involved didn't wash their hands, I know that the\ningredients aren't always top notch, I know that the fat, salt, and sugar\ncontent is probably WAY higher than anything I should be consuming. But I don't\nparticularly care.\n\nIn India a \"gaadi\" is a vehicle, and \"chaat\" is street food that has fresh\nvegetable, puffed rice, sweet and spicy sauces, and some fried components. So\n\"gaadi chaat\" is street food you get out of a flat bed cart.\n\nIn Bangalore, there's a street people refer to as \"chaat street,\" and the street\nis lined with street food vendors. One end has a bakery, and the other end (the\nend I like to start on) has a few fruit carts, and one \"corn\" cart. I usually\nget my corn spiced with salt and chili, and mixed with raw, unripe mangoes\n(delicious!)\n\n\n\nThen it's time for Masala Chaat! This is one of my absolute favorites; it\nfeatures a thick, spicy lentil soup layered atop crispy, crackly puris (indian\n\"chips\" and under sweet and spicy chutney, some fresh onion and cilantro, and a\nsprinkle of \"chaat masala.\"\n\n\n\nIt's The Chaat Shop!\n\nNext up: Gobi Manchurian. Cauliflower dipped in dough and deep fried, then\ndredged in fresh onion and cilantro, and delicious, spicy, tomato-ey garlic-y\nsauces.\n\n\n\nThis is the Gobi Manchurian man! He also makes noodles. He is obviously\nsupremely talented.\n\nNow that you're ALMOST too full (because you've eaten your way down the street)\nit's time for dessert! There's a bakery you can step into, vendors with all\nkinds of sweets and shaved ice, and (my personal favorite) Mango Kulfi!\n\n\n\nGo to bed. It's been a long day, and you're long overdue for a satisfying food\ncoma.","feature_image":"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg","tags":[{"id":"5c47a6f22037ef002282c2d5","name":"chaat","slug":"chaat"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c375","uuid":"1afdf9c1-368f-4d78-acab-73f49594829c","title":"Tere Ghar Ke Samne, Khana Banaunga","slug":"tere-ghar-ke-samne-khana-banaunga","published_at":"04 February, 2016","plaintext":"Why this song you may ask? While growing up my mom always used to sing this song\nto me. The song literally translates to \"I'm going to build a house in front of\nyour house.\" It's supposed to be this cute love song where the guy wants to\n\"build his world in front of her house.\" My question is, wouldn't it be more\nromantic if he built a house FOR them WITH her? Why does he only want to be in\nfront of her house? I may be missing some context from the rest of the movie but\nregardless that's a whole different tangent.\n\nThis song was pretty much just my mom telling me she wants to live right across\nthe street from my and constantly spoil her future grandchildren. I'm pretty\nsure my mom wanted a full on re-enactment of \"Everybody loves Raymond.\" But hey,\nwho's gonna complain about a free babysitter and delicious food? :P\n\n**Love you Amma! \n\n(While you're at it, you should also check out her blog here\n[http://uppukhara.com]! It's basically every recipe she made for me growing up\nthat I have random cravings for since I've moved out to California.)\n\nSometimes I feel like I'm not a complete adult yet. Even though I'm currently\nsupporting myself, paying my own bills, taxes, and insurance, I don't always\nfeel like a \"real\" adult. Then, there are times when suddenly I feel like a full\non housewife, which is something I NEVER EVER want to be.\n\nOne such instance was this past weekend, when I was anxiously awaiting the\narrival of my new electric pressure cooker. One thing I'm sure  every child\ngrowing up in an Indian household can relate to, is the sound of a pressure\ncooker. That sound TERRIFIED me to my core throughout my childhood, and to this\nday. I always feel like something somewhere is going to explode. Even in college\nwhen my roommate decided to make dal and turned on the pressure cooker, we used\nto hide behind our bedroom doors waiting for it to go off enough times so could\nturn it off and continue hiding. You'd think that it wouldn't be worth the fear,\nbut honestly have you ever had dal or even better, Bangalore-style saaru? Yea,\nit's worth it. (If you're wondering what that is, it's a less liquidy and better\nversion of rasam with more dal in it). I've tried all sorts of cooking\ntechniques, but saaru just doesn't taste quite the same unless you use a\npressure cooker. And this way, you don't end up wasting hours and hours making\nyour meal. THAT is not worth it.\n\nThe sound of our pressure cooker is even worse for our dog because he can hear\nthe noise WAY before we can. He panics and runs all the way up the stairs and\ncowers near my parent's bedroom door. This happens without fail every time my\nmom STARTS the pressure cooker. He knows it's coming and refuses to come down\nfrom his hiding spot until he's completely sure it's not going to go off again.\nPoor baby. But I'm sure you'll all realize why once you get your own pressure\ncookers!\n\n\n\nBut AHA! What is this?! An ELECTRIC pressure cooker? What is this magical\ndevice? So quiet and effective? Truly this can't be real! But miraculously, IT\nIS!\n\n\n\nI've never been so excited for any adult purchase in my life, except maybe  my\ncar. This was a glorious purchase. NOT ONLY can it make dal in 4 minutes, but I\ncan use it to make dahi (yogurt or curds generally eaten with indian food),\nrice, and basically anything else in life I could ever think of! ALL WITHOUT\nMAKING A SOUND! I didn't even realize it had even started and it made a beeping\nnoise indicating that my food was READY! It's wonderful.\n\nAmidst all this excitement over the pressure cooker, I got kind of homesick for\nmy mom's food. I then proceeded to facetime my mom for an hour while she\ncarefully explained step by step instructions on how to make one of my favorite\nchildhood dishes, Bendekai Huli or for you non-Kannada speaking people out\nthere, Okra Sambar. Most kids hate okra, but honestly it's one of my favorite\nvegetables, especially when it's in Indian food.\n\nI know this might not be the most flattering picture of any of us (mainly my\nbrother) but whatever.\n\nOne thing I will mention is that I am not sure where to get the huli pudi\n(sambar powder). My parents usually bring bags back from this little store in\nBangalore every time anyone visits, but I'm sure you can find something similar\nin local Indian stores. I mean, I know I couldn't live without sambar so I'm\nsure there are other people who feel the same way and have found a way! There\nare also instant mixes available at the Indian store - while these aren't quite\nas good, they can satisfy the occasional craving!\n\nNow that you've learned a little bit of Kannada, and hopefully are as excited as\nI was, let's begin!\n\n\n\nOkra Sambar or Bendekai Huli\nI'm giving these instructions based on my electric pressure cooker. You may have\nto adjust the dal portion of the recipe according to however you make it.\nPressure cookers scare the bejesus out of me so be careful!\n\nIngredients:\nDal\n1 cup toor dal\n 1/2-3/4 tsp turmeric powder\n 2 1/2 cup water\n Sambar\noil\n 1/2-3/4 tsp mustard seeds\n 1 small package frozen okra\n 1/2-3/4 tsp tamarind paste\n 1 1/2 spoons huli powder (sambar powder)\n water\n Directions:\nAdd the toor dal to your pressure cooker and rinse. Add the water and turmeric\nand turn on the pressure cooker. I did the Manual setting for 4 minutes. Also\nmake sure its set to low pressure and all the pieces are in place. When the\npressure cooker was done it went into keep warm (displayed \"L00:00\") and started\ncounting up. I unplugged it and let it release the pressure on its own.\n\nIn a pot, add some oil and mustard seeds on medium heat, this is called vagarne.\nWhen the mustard seeds start popping, add the frozen okra. When the okra starts\nto get kinda sticky and stringy, add the tamarind paste and a little bit of\nwater. Keep cooking and mixing the okra occasionally until it is cooked through.\n\n![](https://pramods.box.com/shared/static/uq45bcrldnses3q369jmzcs1v1srqmqv.jpg)\n Add huli powder and salt to taste and let it come to a boil. Add the dal and\nmore water until it's the right consistency. Taste it as you go. I needed to add\na little more tamarind paste and huli powder to fit my taste but that depends\nperson to person.\n\nLet it cook for a few minutes and enjoy!","feature_image":"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c297","name":"mom","slug":"mom"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2d1","name":"pressure cooker","slug":"pressure-cooker"},{"id":"5c47a6f22037ef002282c2d2","name":"crock pot","slug":"crock-pot"},{"id":"5c47a6f22037ef002282c2d3","name":"okra","slug":"okra"},{"id":"5c47a6f22037ef002282c2d4","name":"sambar","slug":"sambar"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36b","uuid":"8abb8e5a-35f6-448b-a1d9-8decec1d3d4d","title":"Vidhyarthi Bhavan","slug":"vidhyarthi-bhavan","published_at":"01 February, 2016","plaintext":"I'm feeling homesick today. A year ago, I was in India, probably eating chaat\n(Indian street food), or taking pictures of my cousins while they danced around\nwith stuffed animals.\n\n\n\nI miss India a lot. I always loved visiting my family there, and going for eight\nmonths was one of the most valuable times in my life. I loved every minute of\nit.\n\nThis is a post about a breakfast place in Bangalore, Karnataka, India that\neveryone goes to. I hope you enjoy it as much as I did.\n\n\n--------------------------------------------------------------------------------\n\n\n\nEvery city has this restaurant. It's not classically pretty, and there's no one\nwaiting at the door to see whether or not you want to come in. This is a place\nwhere you have to leave your diet at the door (no one has any idea how many\ncalories/protein grams/vats of butter are in your food anyway). The waiters are\ninattentive enough that a newcomer would have left on the spot, and there are\nliterally never enough seats. There are a few places like this in Bangalore (in\na city this big, with this much traffic, you need multiple choice breakfast\nspots), but Vidhyarthi Bhavan is arguably one of the most delicious.\n\nIt's packed to the brim every day; I went on a Monday morning, and we had to\nstand behind people to snake their seats. And after we ate, people were standing\nbehind us to snake ours. The restaurant is famous for it's Masala Dosa, although\nthere are a couple of other items on the menu if you're interested.\n\nWhile you wait for your order, there are gorgeous photos of Mount Kailash, and\nreally interesting pencil sketches of famous poets and writers of India adorning\nthe walls.\n\n\n\nThere's plenty of fodder for people watching, if the smells wafting from the\nkitchen aren't enough to keep you totally occupied. Finally, your order comes\nout.\n\nThe dosas come to you on plates piled high in the waiter's arms (you have a\nbrief moment where you are concerned that the bottom of someone else's plate has\nbeen all over your food); the waiter never actually looks at you before he heads\nto the next table. Then a second waiter, arguably less attentive than the first,\ncomes over with a tureen of coconut, cilantro, and mint chutney and pours it\nonto your plate.\n\nYou dig in with your fingers, barely resisting the urge to just dig in with your\nwhole face. Finishing one of these babies is a task and a half, but you are\ndefinitely up to the challenge; going, going...gone.\n\n\n\nFinally, you get a cup of some excellent filter coffee to finish you right off,\nbefore you stumble into the daylight, and onto a street lined with flower and\nfruit merchants.\n\nYou amble along, sniffing deeply and enjoying the almost-too-full-but-not-quite\nfeeling in your stomach, and all feels right with the world.","feature_image":"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg","tags":[{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ca","name":"masala dosa","slug":"masala-dosa"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c2cb","name":"indian food","slug":"indian-food"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2cd","name":"bangalore","slug":"bangalore"},{"id":"5c47a6f22037ef002282c2ce","name":"vidhyarthi bhavan","slug":"vidhyarthi-bhavan"},{"id":"5c47a6f22037ef002282c2cf","name":"nostalgia","slug":"nostalgia"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35c","uuid":"1ac41982-aa36-47c5-997a-8cbb575d8814","title":"Started From the Batter, Now We're Here.","slug":"started-from-the-batter-now-were-here","published_at":"28 January, 2016","plaintext":"I know. I know. The title and the song I'm telling you to listen while reading\nthis post don't match, but I felt I needed to up my Drake game a bit. Plus, now\nevery time I think of Drake, I picture him doing his little \"dance\"\n[https://youtu.be/uxpDa-c-4Mc]  over and over again. It brings me a LOT  of joy.\nI also love the SNL parody of it [https://www.youtube.com/watch?v=cjeORm4LMDk] \nbut that's not really relevant.\n\nFirst off, HAPPY NATIONAL CHOCOLATE CAKE DAY! I was not aware that this was an \nACTUAL  holiday but I'm not gonna complain. I firmly believe that everyday\nshould be National Chocolate Cake Day! But hey, I'll take one day a year.\n\nSecond, it's your lucky week! You get TWO whole posts from me! I've been sick\nsince Sunday, so I've been vegetating on my couch, watching a few too many chick\nflicks, all whilst drinking the world's supply of ginger chai (hence my\ncaffeine-fueled poem on Sunday which you should also totally read and\nappreciate) [http://cookinginpjs.com/an-ode-to-chai/].\n\nSo, let's get to it!\n\nAs the self-designated baker for my friend group, I've been baking birthday\ncakes for pretty much everyone. I've been trying to tailor each cake to\nsomething either they've specifically requested or what I think they would\nenjoy. This cake in particular was for one of my friends who loves whiskey. Her\nonly requirement was that, and I quote, \"I do not kill her.\" I took it as a\nchallenge in that I was going to put as much alcohol as possible in the cake\nwhile retaining its ability to taste good.\n\nThree things happened with this:\n\n 1. I made a deliciously boozy cake\n 2. I finished a LOT of the whiskey bottle I bought for this very specific\n    purpose.\n 3. I ended up getting fairly tipsy after a few batter taste tests\n\nI also feel like I should include a warning: raw batter means raw eggs which\nalso means the potential for salmonella. So be careful not to eat spoonfuls of\nyour cake batter! That could get you very sick. Enjoy responsibly ;)\n\nHonestly, I'd say it was a completely successful experience. I totally recommend\nmaking boozy desserts to everyone (of legal age of course). :P Just don't expect\nto be productive after you put the cake in the oven. I had absolutely no\nattention span once I set that cake to bake. I ended up making one GIANT cake\nfor my friend, another little one for the rest of us to enjoy on our own, and a\nfew cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the\ncupcakes were gone within 20 minutes of me sending an email announcing the\narrival of whiskey cupcakes. I'm now officially known as the dessert lady at\nwork.\n\n\n\nChocolate Whiskey Cake\nFeel free to increase/decrease the amount of whiskey according to your\ntaste/tolerance. Just make sure to adjust the flour accordingly so your cake\nbatter isn't too liquidy. The general rule is for each extra tablespoon of\nWhiskey that you add, add an extra 2 tablespoons of flour to compensate.\n\nIngredients:\n2 1/2 cups flour\n 3/4 cups dark cocoa powder\n 2 cups granulated sugar\n 2 tsp baking soda\n 1 tsp baking powder\n 1 tsp salt\n 2 large eggs\n 1/2 cup strong black coffee (chilled)\n 1 cup whiskey\n 1 cup buttermilk\n 1/2 cup vegetable oil\n Directions:\nIf your coffee isn't chilled, then make sure to put it in your freezer to speed\nup that process. Otherwise the eggs will cook when you add the coffee to it. Set\nyour oven to preheat at 350 degrees.\n\nWhisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the\ncoffee is chilled, whisk that in as well.\n\nIn a separate bowl, stir the flour, cocoa powder, baking soda, baking powder,\nand salt together. Slowly pour the wet ingredients into the bowl with all the\ndry ingredients. Make sure to keep stirring while you pour.\n\nWhisk until smooth. Taste to make sure the whiskey level is right. If not add\nmore whiskey/flour accordingly.\n\nSpray your cake pan (or place cupcake liners in your cupcake pan if you're\nmaking cupcakes) and pour in the batter. Set your timer for about 25-30 minutes\n(or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick\n(something that can reach fairly deep inside the cake). If it comes out clean,\nyou're done! Cool the cake in the pan for 15 minutes, frost and devour!\n\nI did get lazy when it came to the frosting and just bought some chocolate\nfrosting from the store. I felt it might be a little TOO much if I spiked that\ntoo, so I just spread shit tons of frosting on top of the cake/cupcakes and ate\nit. I'd say that was the better choice! If you're going easy on the whiskey\ninside the cake itself (or in the words of my friend, \"are being a little\nbitch\"), then maybe you can spike the frosting. Otherwise you've got enough\nalcohol in there to get the deed done.\n\nYes. You know you needed all these gifs right now. Don't lie to yourself. I'm\npretty sure I just stared at this gif collection for a good 5 minutes, at least.\nYou're welcome.","feature_image":"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c376","uuid":"20792daa-31be-4587-acd6-d7f7951d8b6d","title":"An Ode to Chai","slug":"an-ode-to-chai","published_at":"25 January, 2016","plaintext":"There are some days where all you want to do is vegetate on your couch with your\nstuffed penguin, some Netflix and chai. Today is one of those days.\n\n\n\nFor the days of exhaust.\nFor the days of woe.\nFor the days of rain\nAnd those few in a row.The magical potion,\nWhich may many amaze,\nSimple preparation,\nPowerful result.\n\nA hint of ginger,\nA drop of milk,\nA spoonful of sugar,\nAnd sore throat no more.\n\nWhat magical mystical wonder is this?\nOh? You didn't you hear?\nJust some simple and plain and regular tea!\n\nSide note: this may have been inspired by one too many cups of ginger chai. I\nmay have a problem.","feature_image":"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg","tags":[{"id":"5c47a6f22037ef002282c2a2","name":"chai","slug":"chai"},{"id":"5c47a6f22037ef002282c2c0","name":"drinks","slug":"drinks"},{"id":"5c47a6f22037ef002282c2c1","name":"tea","slug":"tea"},{"id":"5c47a6f22037ef002282c2c2","name":"ginger","slug":"ginger"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35a","uuid":"015353ea-56fa-417c-983c-c5350fb3c81a","title":"Sweet Potato Pie","slug":"sweet-potato-pie","published_at":"25 January, 2016","plaintext":"I made some sweet potato pie today.\n\n\n\nThis was my second time making this dessert, and I made it in a more or less\nsimilar way.\n\nThe first time I made it, I bragged to my housemate, and he asked me if my\nmaking a sweet potato pie was cultural appropriation, and I had no idea, because\nI had no idea sweet potato pie was a thing that black people did. To be honest,\nI thought it was an all-American thing (immigrant probs, amirite?) So I\nresearched - and I found out that historically, sweet potato pie was a food\nslaves made in the south. And I had no idea until I made it and someone else\ncalled me out on it!\n\n\n\nHere's the thing about cultural appropriation in food - it happens ALL THE TIME.\nPeople love to take foods from other cultures - frequently every day,\ncommonplace foods - and remake them with slight tweaks and giant price tags. So\nhow do you avoid it? I personally advocate for research.\n\nI think it's important to know where the food you're making comes from,\nespecially when you're modifying it. I tend to modify a lot of recipes to make\nthem vegetarian or vegan, but I try to do it in a way that feels as respectful\nto me as possible.\n\nI think there's space in food for innovation, but it has to be accompanied by\nrespect for the important place that food has in culture.\n\nSo, the moral of this story? Don't appropriate. Don't glorify the food of\nanother culture without trying to understand that culture itself. Accept that\nyou'll probably be clueless even with additional information, and do your best\nto be respectful.\n\nAnd also, have some pie.\n\n\n\nSweet Potato Pie\nThis is a filling dessert. You could tell yourself it's healthy because it has a\nvegetable as a filling, but let's be real - this is not a healthy dessert. And\nthat's a good thing - sometimes dessert just needs to be decadent.\n\nYield: 1 Pie\n\nTotal Time:  2 hours active cooking time\n\nIngredients:\nPie Crust\n3 C Flour\n 1 Tsp Salt3/4 C Coconut OilIce water, as needed\n Sweet Potato Filling\nThree Medium Sweet Potatoes\n 1 C Coconut Milk Liquid or 1/2 C Almond ButterMaple Syrup, to taste1 1/2 Tsp\nCinnamon1/2 Tsp Cardamom1/2 Tsp Pumpkin Pie Spice1 Tsp Vanilla Extract1 Tsp\nOrange Extract\n Directions:\n\n1.) The pie crust recipe is the same dough as that of my [Love\nTriangles](http://cookinginpjs.com/love_triangles/) from last week. The first\ntime I did it, I added a little bit too much ice water - perhaps a couple\ntablespoons too much - and I wound up with a loose dough I didn't want to add\nmore flour to. So that time, I rolled it out hastily, trying not to handle it\ntoo much to avoid the coconut oil melting prior to baking. This time I managed\nto avoid that pitfall, and carefully added only as much water as was necessary,\nresulting in a soft, elastic, and close-to-perfect dough. I recommend prepping\nand chilling that before you do anything else.\n\n\n2.) I went the simple route; I chopped the sweet potato small, into pieces about\na half inch wide. After you do that, douse them in spices and throw them in the\noven until they are melt-in-your-mouth cooked. Or, you know, about thirty\nminutes.\n\n\n3.) Mashed them, add maple syrup, the some almond butter, or the liquid from a\ncan of coconut milk for creaminess, and your spices and extracts. You want to\nmake sure it isn't too sweet, tasting every time you add a new ingredient to -\nahem - \"assess quality.\" Make sure that the pie isn't so sweet that you can't\ntaste the sweet potato. The goal is to enhance it so it can be the star, not\nmask it.\n\n\n4.) Preheat the oven to 375 F. Take out your pie dough which has, of course,\nchilled for at least four hours at this point, and roll it out gently. Set it\ninto a pie pan/tin, and crimp the edges however you're like. Reserve the cut off\nbits to create a decoration for your pie. Pop the crust in the oven for about\nfifteen minutes.\n\n\n5.) After the pie crust has baked for about fifteen, take the pie out of the\noven and layer in your filling. You want it to be up until the rim of the pie\npan - this filling won't expand, so you can fill it right up. Put the pie back\nin the oven for about twenty minutes.\n\n\n6.) In the meantime, roll out your spare dough and get creative! I went the way\nof stars and diamonds because those are the cookie cutters I found, but the\nworld is your oyster. When twenty minutes have passed, take your pie out of the\noven and carefully place the decorations on top. Put it back in for another 20\nminutes. Proceed to turn on the oven light and watch excitedly, as I did (I\nthink I mistook it for a television).\n\n\n7.) After another twenty minutes have passed, increase the oven temperature to\n400 F, and place your pies on the top rack - I like my top crust to be a little\nbrown, and this makes that happen!\n\n\n8.) Take your pie out of the oven and serve it up! I loved it with a dollop of\ncoconut whipped cream, but it would likely also taste good with ice cream, or\nnormal whipped cream, or any manner of things. It was also excellent all on its\nown.","feature_image":"https://pramods.box.com/shared/static/1me34o8e4hrj5zs0hqullpkoduharuvp.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c3","name":"sweetpotato","slug":"sweetpotato"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c2bc","name":"pastry","slug":"pastry"},{"id":"5c47a6f22037ef002282c2c4","name":"piecrust","slug":"piecrust"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"limit":6,"skip":24,"numPages":10,"currentPage":5}}