{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Orange Cream//Chocolate Cookies","slug":"orange-cream-chocolate-cookies","feature_image":null,"published_at":"02 May, 2016","html":"<p>There's something about the combination of chocolate and orange that just gets me every time. I love to make hot chocolate with just a few drops of orange in it, and I have been dying to make chocolate-y bread with bits of orange zest woven through it.</p>\n<p><img src=\"https://pramods.box.com/shared/static/j3affjujmdzyx46vui37m7aux09yuvg8.jpg\" alt=\"\"></p>\n<p>But this weekend, I found myself with coconut flour and coconut cream, and decided on chocolate cookies with a delicious, lightly orange-flavored cream.</p>\n<p>If you want to get all hipster buzzwords about it, this recipe is: grain free, refined sugar free, vegan.</p>\n<p>If you just want to be totally super normal about it, this recipe is: delicious.</p>\n<p>Give it a try :)</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Orange Cream//Chocolate Cookies</h2>\n    <div class=\"summary\">\n      <p><em>This is a super simple and quick recipe. There is literally no reason not to give it a try.</em></p>\n      <p>Yield: 26 1.5\" cookies</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Chocolate Cookie</h4>\n          <li class=\"ingredient\">3/4 C Coconut Flour</li>\n          <li class=\"ingredient\">1/4 C Cacao Powder</li>\n <li class=\"ingredient\">1/4 C Coconut Oil</li>\n <li class=\"ingredient\">1/4 C Maple Syrup</li>\n <li class=\"ingredient\">Soy milk as needed</li>\n        <h4>Orange Cream</h4>\n          <li class=\"ingredient\">1 Can Chilled Coconut Cream</li>\n          <li class=\"ingredient\">1/4 C Powdered Sugar</li>\n<li class=\"ingredient\">Three Drops Orange Oil</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n1.) Mix together coconut flour and cacao powder in a bowl. \n</p><p>\n</p><p>\n2.) Put the coconut oil (solid; refrigerate if needed) into the flour mixture and cut it with a fork. You want it to be sort of crumbly and sandy when you're done. \n</p><p>\n</p><p>\n3.) Pour the maple syrup (cold) into the mixture, and again, mix it in with a fork. This mixture will remain sort of sandy and crumbly. \n</p><p>\n</p><p>\n4.) Add soy milk a tablespoon at a time. Your dough will be a little crumbly, but will stick together in one huge mass when you're done. It won't be elastic, but it will stick together reasonably well. \n</p><p>\n</p><p>\n5.) Shape into 26 cookies and set on a greased baking sheet - these cookies won't spread, so flatten them to the shape you want. Stick in the fridge, and preheat the oven to 350. \n</p><p>\n</p><p>\n6.) When the oven is ready, put your cookies in and set a timer for fifteen minutes. Mine took right around 18, so I would check them at fifteen, and let them go till they're done! \n</p><p>\n</p><p>\n7.) While the cookies are baking, take out your coconut cream and flip it upside down. Open it, and there should be some liquid there. Pour that into a cup (it's delicious, and can be used in smoothies) and scoop out the cream into a separate bowl. Whip, then add the sugar and orange oil and whip some more. \n</p><p>\n</p><p>\n8.) Take a cookie, through a dollop of cream on there and dig in; delicious! \n        </p>\n      </div>\n    </div>\n  </div>\n</div>","plaintext":"There's something about the combination of chocolate and orange that just gets\nme every time. I love to make hot chocolate with just a few drops of orange in\nit, and I have been dying to make chocolate-y bread with bits of orange zest\nwoven through it.\n\n\n\nBut this weekend, I found myself with coconut flour and coconut cream, and\ndecided on chocolate cookies with a delicious, lightly orange-flavored cream.\n\nIf you want to get all hipster buzzwords about it, this recipe is: grain free,\nrefined sugar free, vegan.\n\nIf you just want to be totally super normal about it, this recipe is: delicious.\n\nGive it a try :)\n\nOrange Cream//Chocolate Cookies\nThis is a super simple and quick recipe. There is literally no reason not to\ngive it a try.\n\nYield: 26 1.5\" cookies\n\nTotal Time:  1 hour\n\nIngredients:\nChocolate Cookie\n3/4 C Coconut Flour\n 1/4 C Cacao Powder\n 1/4 C Coconut Oil\n 1/4 C Maple Syrup\n Soy milk as needed\n Orange Cream\n1 Can Chilled Coconut Cream\n 1/4 C Powdered SugarThree Drops Orange Oil\n Directions:\n\n1.) Mix together coconut flour and cacao powder in a bowl.\n\n\n\n\n2.) Put the coconut oil (solid; refrigerate if needed) into the flour mixture\nand cut it with a fork. You want it to be sort of crumbly and sandy when you're\ndone.\n\n\n\n\n3.) Pour the maple syrup (cold) into the mixture, and again, mix it in with a\nfork. This mixture will remain sort of sandy and crumbly.\n\n\n\n\n4.) Add soy milk a tablespoon at a time. Your dough will be a little crumbly,\nbut will stick together in one huge mass when you're done. It won't be elastic,\nbut it will stick together reasonably well.\n\n\n\n\n5.) Shape into 26 cookies and set on a greased baking sheet - these cookies\nwon't spread, so flatten them to the shape you want. Stick in the fridge, and\npreheat the oven to 350.\n\n\n\n\n6.) When the oven is ready, put your cookies in and set a timer for fifteen\nminutes. Mine took right around 18, so I would check them at fifteen, and let\nthem go till they're done!\n\n\n\n\n7.) While the cookies are baking, take out your coconut cream and flip it upside\ndown. Open it, and there should be some liquid there. Pour that into a cup (it's\ndelicious, and can be used in smoothies) and scoop out the cream into a separate\nbowl. Whip, then add the sugar and orange oil and whip some more.\n\n\n\n\n8.) Take a cookie, through a dollop of cream on there and dig in; delicious!","tags":[]}},"pageContext":{"slug":"orange-cream-chocolate-cookies","previous":{"html":"<p>I'm sure most of y'all have been on a bar crawl - you have a list of bars, and you hit them up one after the other, sipping a little of this and a little of that at each one.</p>\n<p>This is similar, but with FOOD. While you are certainly welcome bring booze into the mix, these are instructions for figuring out an all food crawl; it's an excellent way to explore a new city!</p>\n<p>It's also a really good way to spend a couple of hours with friends without spending a ton of money; if you're on a budget, this is a great way to try lots of different food, and see quite a bit, without breaking the bank. We each paid for one entree at one place, and it came out perfectly for us!</p>\n<p>First, you need a walkable city. I myself did this with my friends Eden and Hafsa in San Francisco, the day I last left Sumu.</p>\n<p><img src=\"https://pramods.box.com/shared/static/nswhwh2moi2lyt9ett886237vfike5xh.jpg\" alt=\"\"></p>\n<p>Second, do some preliminary research. Don't actually choose all the places you want to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff you're interested in exploring. We found ourselves wandering around the Mission District, ogling wall art and talking about gentrification.</p>\n<p>Third, set off on your journey! Start with a place you know you want to go to; we started with Philz Coffee, which also let us sip and wander for a bit before we found real food.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg\" alt=\"\"></p>\n<p>Over the course of the next several hours, we tried Thai food, Mexican food, Vietnamese food, and, finally, Ethiopian food. At each place, we would choose one entree to share, so that in the end, we all got to try tons of yummy food for relatively little!</p>\n<p>We were having so much fun we failed to take a lot of pictures, but this is definitely one of those days that I'll be remembering for quite a while! If you do a food crawl, let me know how it goes!</p>\n<p>And, if you're in DC or San Francisco and you're interested in doing this, hit Sumu or I up! We'd love to have you :)</p>\n","title":"How to do a food crawl","slug":"food-crawl","published_at":"25 April, 2016","feature_image":"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg","tags":[{"id":"5c47a6f22037ef002282c2c6","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","slug":"eating-out"},{"id":"5c47a6f22037ef002282c235","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c243","slug":"mexican"},{"id":"5c47a6f22037ef002282c250","slug":"thai"},{"id":"5c47a6f22037ef002282c2f5","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c31b","slug":"betterlate"},{"id":"5c47a6f22037ef002282c31c","slug":"than-never"},{"id":"5c47a6f22037ef002282c31d","slug":"monday"},{"id":"5c47a6f22037ef002282c31e","slug":"food-crawl"},{"id":"5c47a6f22037ef002282c31f","slug":"ethiopian"},{"id":"5c47a6f22037ef002282c320","slug":"mission"}]},"next":{"html":"<p><img src=\"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg\" alt=\"\"></p>\n<p>So I was terribly sick last week whilst recovering from Coachella so I've decided to treat you guys with not one but TWO whole posts! I know right?! So awesome. You can thank me later. AND to make things better... instead of sharing just a single song... I'm going to gift you with a whole playlist of my favorite songs from Coachella!</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify%3Auser%3A1217494097%3Aplaylist%3A7vHswNAsv4lLIjCNrjvzeZ\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>So very typical of me, I didn't double check my flight timings when booking so I ended up flying out to LAX a whole 10 hours before the rest of my group. I decided to start the trip out right, eggs Benedict and a mimosa at the airport with a side of Gilmore Girls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/egnkhg8zefh3rl0xkh1co74s074cr4c0.jpg\" alt=\"\"></p>\n<p>Usually 10 hours stranded at an airport is a bummer, but there are worse places to get stranded than LAX. It kind of ended up working out for me because I took my camera and explored! I walked from Santa Monica Pier to Venice Beach and soaked in the gorgeous SoCal sun.</p>\n<p>In Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously, probably the best I've ever had in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/0i02gxp1jckp0svdv6cu8wi5ewctzsvm.jpg\" alt=\"\"></p>\n<p>In Venice Beach, I decided to have a lighter option and enjoyed some Burrata and Beets at Larry's Bar &amp; Grill.</p>\n<p><img src=\"https://pramods.box.com/shared/static/6dynwvyb7q9fon9luvmogmd3wbei2szk.jpg\" alt=\"\"></p>\n<p>The most adventurous meal was at dinner with a friend at Wurstküche. We enjoyed some cold beers and Rattlesnake Sausages. It honestly didn't taste much different from other sausages and was actually pretty good but I can't say I'd comfortably eat that again.</p>\n<p><img src=\"https://pramods.box.com/shared/static/aypjyy5024v7hcfqhqa4dwl3x6injkm7.jpg\" alt=\"\"></p>\n<p>The weekend was filled with new musical obsessions, including Zhu &amp; Flume (seriously check out that playlist ^), new friends, delicious eats, and lots and lots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the unfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon, Sean Paul, and Nico&amp;Vinz during Matoma's set.</p>\n<p><img src=\"https://pramods.box.com/shared/static/duq94s8q18b3qklwj730gkuu2l5szcpm.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/ie4gkxnr4yruv5grnjyaya1iunyoj6pm.jpg\" alt=\"\"></p>\n<p>I came back home the following Monday sunburned (what happens when you wander around LA without sunscreen) and exhausted out of my mind; Cue sickness.</p>\n<p>This was my first year attending Coachella, every instagrammer's and basic bitch's haven. Of course I had to have ONE basic picture myself to commemorate the experience.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z7gfp3dlql2f2wag911y4lvsznp2q06v.jpg\" alt=\"insert basic watermelon picture here\"></p>\n<p>Coachella is also a GREAT place for foodies. While you needed to be a VIP to get access to some of the tastiest and more exclusive food, there was plenty of delicious options to spare. Looking back at my food photos, I realize that I basically survived off fries. Just fries. And obviously watermelon, because it IS Coachella. But these fries were no ordinary fries my friends. They were all loaded with various toppings and delicious goodness.</p>\n<p>Veggie Monster Fries with lots of types of slaw and jalapeños!<br>\n<img src=\"https://pramods.box.com/shared/static/z4ge00bngygbfezcdyv3x4gdsve5p72u.jpg\" alt=\"\"></p>\n<p>Vegetarian Poutin Fries with cheese curds!<br>\n<img src=\"https://pramods.box.com/shared/static/uyr9jkumf8n2a6mzue6bxdrimbfblro2.jpg\" alt=\"\"></p>\n<p>Crab Fries! This meant crab aioli AND crab topping! Double yum!<br>\n<img src=\"https://pramods.box.com/shared/static/bcjeq6dasdfv4jbihq44hhsudjks88eh.jpg\" alt=\"\"></p>\n<p>Chicharones Fries with Sriracha and curry aioli!<br>\n<img src=\"https://pramods.box.com/shared/static/2uta04ogd3ap0dy1aw8ya7xit7ocqvul.jpg\" alt=\"\"></p>\n<p>I honestly have no idea how most of these things were made but my stomach was hella happy. :)</p>\n","title":"FoodChella","slug":"foodchella","published_at":"04 May, 2016","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","tags":[{"id":"5c47a6f22037ef002282c321","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","slug":"fries"},{"id":"5c47a6f22037ef002282c246","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","slug":"la"},{"id":"5c47a6f22037ef002282c329","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","slug":"eating-out"}]}}}