{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35e","uuid":"28e9fca4-1790-4afe-9663-c046b09f3043","title":"FoodChella","slug":"foodchella","published_at":"04 May, 2016","plaintext":"\n\nSo I was terribly sick last week whilst recovering from Coachella so I've\ndecided to treat you guys with not one but TWO whole posts! I know right?! So\nawesome. You can thank me later. AND to make things better... instead of sharing\njust a single song... I'm going to gift you with a whole playlist of my favorite\nsongs from Coachella!\n\nSo very typical of me, I didn't double check my flight timings when booking so I\nended up flying out to LAX a whole 10 hours before the rest of my group. I\ndecided to start the trip out right, eggs Benedict and a mimosa at the airport\nwith a side of Gilmore Girls.\n\n\n\nUsually 10 hours stranded at an airport is a bummer, but there are worse places\nto get stranded than LAX. It kind of ended up working out for me because I took\nmy camera and explored! I walked from Santa Monica Pier to Venice Beach and\nsoaked in the gorgeous SoCal sun.\n\nIn Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously,\nprobably the best I've ever had in my life.\n\n\n\nIn Venice Beach, I decided to have a lighter option and enjoyed some Burrata and\nBeets at Larry's Bar & Grill.\n\n\n\nThe most adventurous meal was at dinner with a friend at Wurstküche. We enjoyed\nsome cold beers and Rattlesnake Sausages. It honestly didn't taste much\ndifferent from other sausages and was actually pretty good but I can't say I'd\ncomfortably eat that again.\n\n\n\nThe weekend was filled with new musical obsessions, including Zhu & Flume\n(seriously check out that playlist ^), new friends, delicious eats, and lots and\nlots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the\nunfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon,\nSean Paul, and Nico&Vinz during Matoma's set.\n\n\n\n\n\nI came back home the following Monday sunburned (what happens when you wander\naround LA without sunscreen) and exhausted out of my mind; Cue sickness.\n\nThis was my first year attending Coachella, every instagrammer's and basic\nbitch's haven. Of course I had to have ONE basic picture myself to commemorate\nthe experience.\n\n\n\nCoachella is also a GREAT place for foodies. While you needed to be a VIP to get\naccess to some of the tastiest and more exclusive food, there was plenty of\ndelicious options to spare. Looking back at my food photos, I realize that I\nbasically survived off fries. Just fries. And obviously watermelon, because it\nIS Coachella. But these fries were no ordinary fries my friends. They were all\nloaded with various toppings and delicious goodness.\n\nVeggie Monster Fries with lots of types of slaw and jalapeños!\n\n\nVegetarian Poutin Fries with cheese curds!\n\n\nCrab Fries! This meant crab aioli AND crab topping! Double yum!\n\n\nChicharones Fries with Sriracha and curry aioli!\n\n\nI honestly have no idea how most of these things were made but my stomach was\nhella happy. :)","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","tags":[{"id":"5c47a6f22037ef002282c321","name":"coachella","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","name":"poutin","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","name":"crab","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","name":"chicharones","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","name":"music","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","name":"venice beach","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","name":"santa monica","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","name":"LA","slug":"la"},{"id":"5c47a6f22037ef002282c329","name":"rattlesnake","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","name":"burrata","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34f","uuid":"7e8c442d-4c8d-4c6b-8667-33acc5c95e1a","title":"The Glorious Monstrosities of Frita Batidos","slug":"frita-batidos","published_at":"27 March, 2015","plaintext":"\n\nFrita Batidos is one of the crown jewels of Ann Arbor, MI. It is a small cuban\nstreet food restaurant in downtown Ann Arbor. While it may be a slight walk from\nthe University of Michigan campus, many students make the trek despite any\nridiculous weather conditions to get a bite of these burgers.\n\nThey have the one of the most delicious, insanely huge and jam packed burgers\nI’ve ever eaten in my life. No matter the patty you want inside your burger,\nwhether it be black bean, chicken, or chorizo, you’re bound to get a tasty\nconcoction which will blow your mind. Honestly I have yet to meet a person at\nthe University of Michigan who doesn’t like their burgers.\n\nThe basic burger (or Frita) is simple, just the patty between two egg buns and\nstuffed with fries. I also added some cilantro-lime salsa and tropical slaw to\njuice it up a little. Safe to say, I don’t think I would be trying to impress\nanyone while eating this monstrosity.\n\n\n\nMy brother always goes with a sunny side up egg and avocado spread on his frita.\nAs soon as you bite into the burger, the yolk bursts, spreading that wonderful\nflavor into every bite thereafter.\n\n\n\nThis trip to Frita Batidos was special because we brought one of my friends here\nfor her first time. She decided to go big or go home and made her frita “loco.”\nThis means that they just go “loco” and add ALL of their available toppings on\ntop of your burger: muenster, a sunny side up egg, cilantro lime salsa, tropical\nslaw, AND avocado spread! This is pretty much the mother of all burgers. I mean\nits GINORMOUS. My friend wasn’t even able to attempt to eat this with her hands.\nBut oh was it delicious.\n\n\n\nDon’t get me started on their garlic-cilantro fries. Frita Batidos has some of\nthe simplest yet most amazing fries I’ve had. I can’t even describe them, you\nhave to try them yourself!\n\n\n\nIf you are ever in Ann Arbor MAKE SURE  you head to downtown to taste one of\nthese monstrosities, these glorious monstrosities of Frita Batidos.\n\nCheck them out [http://www.fritabatidos.com]!","feature_image":"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c263","name":"frita batidos","slug":"frita-batidos"},{"id":"5c47a6f22037ef002282c264","name":"burgers","slug":"burgers"},{"id":"5c47a6f22037ef002282c265","name":"cuban","slug":"cuban"},{"id":"5c47a6f22037ef002282c266","name":"garlic","slug":"garlic"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c358","uuid":"9e154487-bd40-42d8-b6a9-c7b35fe895a0","title":"DAMN SON, Those are Some Seriously Loaded Fries","slug":"damn-son-those-are-some-seriously-loaded-fries","published_at":"10 March, 2015","plaintext":"\n\nFor the few weeks, I've been bored at home while my parents are away at work.\nI've been taking some time off between graduation and when I start work next\nmonth. So when one of my friends was also bored at home during her spring break,\nshe decided to come over and join me in being a bum for a day. And what better\nfood to have while lazing around then some Mexican loaded fries.\n\n\n\nFeel free to use sour cream instead of ranch or even add guacamole and other\ntoppings you usually put on nachos! We didn't really want to leave the house and\ngo grocery shopping, so we went with whatever was in the fridge. I usually make\nmy own mexican seasoning, but feel free to replace the spices with a store\nbought seasoning if you want.\n\n\n\nMexican Loaded Fries\nThis is a very rough recipe. Feel free to throw in whatever you feel would taste\nbest!\n\nIngredients:\n½ bag of fries (I used crinkle cut)\n ranch (or sour cream)\n as much shredded cheese as you wantRefried Beans\n1 can black beans\n 1½ teaspoons cumin powder\n 1 teaspoon paprika\n salt to taste\n cayenne pepper to taste\n chili lime hot sauce to taste (optional)Pico De Gallo Salsa\n3 roma tomatoes diced\n ½ large onion diced\n juice of ½ a lime\n salt to taste\n few sprigs of cilantro Directions:\nRefried Beans:  Pour the black beans onto a skillet on the stove. Add all of the\nspices and keep stirring until the beans are soft and are super flavorful.\n\nSalsa:Mix all the ingredients in a bowl and let it sit so that the salt and lime\ncan bring out the flavor in the tomatoes.\n\nBake the fries according to the directions on the packet. When the fries are\ndone, don't turn off the oven. Top with the bean mixture and sprinkle all the\ncheese that your heart desires. Bake the topped fries in the oven until the\ncheese has melted. Take out the fries and top with salsa and ranch. Dig in!","feature_image":"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","name":"salsa","slug":"salsa"},{"id":"5c47a6f22037ef002282c25f","name":"beans","slug":"beans"},{"id":"5c47a6f22037ef002282c260","name":"appetizers","slug":"appetizers"},{"id":"5c47a6f22037ef002282c261","name":"loaded","slug":"loaded"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c347","uuid":"156f6a9c-9dc3-4bcf-9a10-98c40146b162","title":"Squash Galore","slug":"squash-galore","published_at":"10 November, 2014","plaintext":"So recently my mom bought various different types of squash. We had spagetti\nsquash, acorn squash and some other types I honestly have no idea what they are\ncalled.\n\nOriginally they had all just been sliced in half and used as decorative bowl for\na lunch party my mom threw. But unfortunately, that resulted in tons and tons of\nleftover squash. I decided to attempt to make use of them.\n\nFirst, I made an \"alfredo\" penne pasta. Here's the recipe for reference. I did\nmake a few adjustments partially on accident; I apparently used a different kind\nof similar tasting squash instead of acorn squash (pictured below), I used\nnormal milk instead of plant milk and a little mozzerella cheese instead of\nyeast flakes.\n\n\n\nAcorn Alfredo Pasta\n[http://kblog.lunchboxbunch.com/2010/10/acorn-squash-vegan-alfredo-sauce-kamut.html]\nRecipe by\nhttp://kblog.lunchboxbunch.com/2010/10/acorn-squash-vegan-alfredo-sauce-kamut.html\n\nIngredients:\nAcorn Alfredo Sauce\n4 Cups roasted Acorn Squash (about 1 medium squash)\n 1 cup fresh basil\n 3/4 cup milk\n 1/3 cup mozzarella cheese\n 2-3 Tbsp EVOO\n 2-3 Tbsp Dijon Mustard\n 2-3 Tbsp apple cider vinegar\n 2 Tbsp roasted garlic\n 2 Tbsp dried Italian herbs (basil, oregano, thyme)\n 1 Tbsp maple syrup\n 1 tsp red pepper flakes or dash of cayenne\n salt and pepper\n \n1 bag pasta\n 2-3 cups mushrooms\n Directions:\nTurn on oven to 350 degrees.\n\nFill a casserole dish with an inch of water. Slice Acorn Squash in half\n(horizontal slice as shown) and lay flat in dish. Place in oven to roast at 350\ndegrees for 60-75 minutes.\n\nWhen your squash is roasted the skin should peel away quite easily. Remove all\nskin and place squash flesh in a food processor. Add all other ingredients.\n\nBlend on high for at least 2 minutes. You want all the parsley to chop into fine\nbits. Set sauce aside.\n\nBoil a pot of salted water. Cook your pasta. 2-3 minutes before the pasta is\nready to drain, add mushrooms and optional protein add-in's. Drain as usual.\nToss dry pasta in a splash of EVOO (opt'l).\n\nToss warm pasta in your Acorn Alfredo Sauce. Mix well so each pasta bit is\ncoated.\n\n\n\n\n\nIt honestly looked quite delicious! It wasn't bad, but personally I'd rather\njust eat a smaller portion of normal alfredo rather than fabricating the same\nkind of taste with squash.\n\nWhen my mom came home and informed me I had used the wrong squash to make my\npasta, we decided to actually make use of the REAL acorn squash! We kept it\nsimple, just seasoning slice and roasting them as \"fries\". This in comparison\nwas amazing. It was very similar to sweet potato fries. We loved it so much we\nactually ate most of them before even thinking of taking a photo! :)\n\nThe final remaining squash we had left was spaghetti squash. Initially, we were\nconfused on what it had to do with spaghetti at all, but once we stuck it in the\noven for a while with a little oil, it finally made sense. After roasting the\nsquash, it looks just like spaghetti! Doesn't quite taste the same, but could\nwork as a substitute.\n\nThis time we decided to make pizza using the squash to make the crust. The most\nimportant thing to keep in mind when using spaghetti squash to make pizza crust\nis to really squeeze ALL of the moisture out of it before putting it in the\noven. The less moisture when cooking, the crispier and less flimsy the pizza\ncrust! We used this recipe\n[http://sharedappetite.com/recipes/gluten-free-spaghetti-squash-pizza-crust/] \nby Shared Appetite [http://sharedappetite.com]. We covered 1/2 of the pizza with\npesto sauce (hence the insane amount of oil in the picture) and 1/2 with\nmarinara sauce, tossed a few mushroom slices, covered it with cheese and then\nbaked the \"pizza\".\n\n\n\nIn all honesty, I realize I'm not a HUGE squash fan. My parents didn't hate the\npasta or the pizza. It just didn't feel the same. I'd personally rather indulge\nin smaller portions in the real thing rather than trying to replicate the same\nexperience with other ingredients. However, I would definitely recommend that\nyou try acorn squash fries! Those were amazing :)","feature_image":"https://farm6.staticflickr.com/5613/15216086813_bef71f0970_b.jpg","tags":[{"id":"5c47a6f22037ef002282c22e","name":"squash","slug":"squash"},{"id":"5c47a6f22037ef002282c22f","name":"pasta","slug":"pasta"},{"id":"5c47a6f22037ef002282c230","name":"pizza","slug":"pizza"},{"id":"5c47a6f22037ef002282c231","name":"acorn","slug":"acorn"},{"id":"5c47a6f22037ef002282c232","name":"spaghetti","slug":"spaghetti"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"}]}}]}},"pageContext":{"slug":"fries","limit":6,"skip":0,"numPages":1,"currentPage":1}}