{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37f","uuid":"eaed4c13-ea2f-4325-9310-725d55d2c0ea","title":"Scrambled","slug":"scrambled-tofu","published_at":"18 April, 2016","plaintext":"My brain feels scrambled. I've thrown all sorts of information in there and\ngiven it a good shake, and things are tumbling about pretty wildly right now.\n\nExam season is upon me, and I am not bearing up well under the stress. Just\ndon't ask me how many hot Cheetos I've consumed, because that could get super\nembarrassing super fast. My food consumption these days in 50% leftovers, 30%\neggs, 10% random free food, and 10% cheese, so you could say things are a bit\nmad right now.\n\nI'm so excited to finish the semester and start cooking again. In the meantime\nthough, I want to leave this recipe I made a bit ago here.\n\n\n\nI'd never made tofu scramble before, so there was quite a bit of googling\ninvolved. In the end, I came up with a recipe that hit all the right spots, and\nwas healthy to boot! I would recommend this for anyone who enjoys savory\nbreakfast, even the pledged carnivores; this tofu is delicious!\n\nTofu Scramble\nThere are two keys to making this a good recipe: (1) extremely firm tofu - the\nfirmest you can locate at the store, and (2) marinate it over night.\n\nYield: 2 servings\n\nTotal Time:  30 minutes\n\nIngredients:\nMarinade\n2 Tbsp Soy Sauce\n 2 Tbsp C Vinegar4 Tbsp Nutritional Year1 Tsp Garlic Powder1 Tsp Onion Powder\n Scramble\n1 Package Extremely Firm Tofu\n Handful of BroccoliHandful of Kale5-6 Mushrooms\n Directions:\n\n1.) Mix your marinade ingredients together, and add water if you need to so that\nit's not too thick. It should be roughly the consistency of gravy.\n\n  \n2.) Rip your tofu into bit sized chunks with forks or with your hands, and mix\nthe marinade into the tofu. Set the mixture in the fridge overnight.\n\n  \n3.) Chop your broccoli, kale, and mushrooms, and cook your veg - broccoli, then\nkale and mushrooms together. Be sure to add some salt and spices to the\nvegetables!\n\n  \n4.) When the vegetables are half cooked, create a space, and pour your tofu\nscramble in. Let it cook for a few minutes, 5-7 should be just enough.\n\n  \n5.) Pour into a bowl with some hashbrowns and enjoy!    </p>\n  </div>\n</div>","feature_image":"https://pramods.box.com/shared/static/tj5saknljx5vewphutanvgu2he6w75gg.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c313","name":"savory","slug":"savory"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c319","name":"scramble","slug":"scramble"},{"id":"5c47a6f22037ef002282c31a","name":"noms","slug":"noms"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35f","uuid":"e0f988c3-12d8-419a-b327-025e484d0fd2","title":"When a moon hits your eye like a big pizza pi(e)","slug":"when-a-moon-hits-your-eye-like-a-big-pizza-pi","published_at":"07 April, 2016","plaintext":"March 14th is a very famous day. Tis a day of celebration. Tis a day of\nlearning. Tis a day that we call \"Pi Day.\" Tis also a day mostly famous amongst\nengineers, mathematicians, and physicists more than anyone else, but hey we're\nthe awesome ones anyways ;)\n\nWe had a pi(e) baking competition at work. Here's a look at some of the amazing\ncreations that were submitted!\n\n\n\n\n\nOne of the best things about this competition was that began at exactly 1:59pm.\nIt took me a LONG time until I realized that it was intended to begin at 3/14\n1:59, which are the next few digits in pi.\n\nOnce I got over how clutch that was, I began planning what I would bake to enter\nin this competition. There were tons of categories including best newbie, most\ncreative, best savory, best sweet, etc. I decided I would do something different\nand make a savory pie, but what to make... THEN I realized I could make Indian\nsavory pies (cover my dinner for a few days) and attempt to blow everyone's\nminds. I decided to enter 2 pies: a paneer tikka pie and a samosa pie. Yes, I am\nvery well aware that a samosa pie is really just a LARGE samosa, it's just\nsemantics. I have also realized I have watched too much Psych when I use the\nphrase \"it's just semantics\" excessively.\n\n\n\nSince I decided to experiment so much you guys get TWO recipes this week all\nwrapped up inside one post. I know we're terrible people who haven't posted in a\nbit, but I promise we'll make it up to you guys and more. Since I used frozen\npie crust, the overall time I spent baking was actually not as long as I had\nanticipated. I'm not going to write out the whole pie recipe because its fairly\ngeneric and you can follow the timings/instructions on the pie crust box itself.\nI made double crusted pies (where theres crust below and on top of the filling)\nso I just followed the instructions on the top pie crust box. It was something\nlike this crust\n[http://www.pillsbury.com/products/pie-crust/refrigerated-pie-crust], the kind\nyou roll out and lay on top of the pie.\n\n\n\nThere's actually some chicken tikka mini pies in that picture above but that was\nmainly for myself ;)\n\n\n\nPaneer Tikka Pi(e) Filling\nIngredients:\nUncooked paneer, cubed\n 4 tbsp tandoori masala powder (I really like Kissan Tandoori Masala)\n Dahi (curds)\n Directions:\nMix the tandoori masala and 2-3 large spoons of dahi together in a large bowl.\nAdd the paneer and mix until the paneer pieces are fully covered in the\nmarinade. Add more dahi and tandoori masala as needed. Let the paneer marinate\nfor at least 2 hours.\n\n\n\nSamosa Pi(e) Filling\nIngredients:\n3 medium sized potatoes\n 1 cup green peas\n 1 tsp ginger-garlic paste\n 1 tsp garam masala powder\n 1 tsp red chili powder\n 1 tsp dry mango powder\n 1 tsp coriander powder\n 3/4 tsp cumin seeds\n 2 tbsp chopped coriander\n 1 tsp garam masala powder\n lemon juice (to taste)\n salt (to taste)\n Directions:\nFill a pot 3/4 full with water and add the potatoes and a pinch of salt. Boil on\nmedium-high heat until potatoes are cooked completely. Put the potatoes in a\nbowl of cold water to cool for a minute. Peel and chop the potatoes into cubes.\n\nHeat a little oil in a pan. Add cumin and roast. When the cumin starts\ncrackling, add the ginger-garlic paste and sauté until the smell of raw ginger\ngoes away. Lower the heat and add all the dry spices and stir.\n\nAdd the potatoes and peas along with salt (to taste). Sauté for a few minutes\nand then mix in chopped coriander and lemon juice (to taste).\n\n\n\n\n\n\n\nI know this is terrible... but I HAD to. :D","feature_image":"https://pramods.box.com/shared/static/exwct8krjwx28uvx3j7ksk7g91ey4yp5.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c309","name":"piday","slug":"piday"},{"id":"5c47a6f22037ef002282c30a","name":"samosa","slug":"samosa"},{"id":"5c47a6f22037ef002282c30b","name":"paneer","slug":"paneer"},{"id":"5c47a6f22037ef002282c30c","name":"tikka","slug":"tikka"},{"id":"5c47a6f22037ef002282c30d","name":"competition","slug":"competition"},{"id":"5c47a6f22037ef002282c312","name":"pie","slug":"pie"},{"id":"5c47a6f22037ef002282c313","name":"savory","slug":"savory"}]}}]}},"pageContext":{"slug":"savory","limit":6,"skip":0,"numPages":1,"currentPage":1}}