{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c375","uuid":"1afdf9c1-368f-4d78-acab-73f49594829c","title":"Tere Ghar Ke Samne, Khana Banaunga","url":"https://cookinginpjs.herokuapp.com/tere-ghar-ke-samne-khana-banaunga/","published_at":"04 February, 2016","html":"<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/dg39NzgJZg4?wmode=transparent\"></iframe>\n</div>\n<p>Why this song you may ask? While growing up my mom always used to sing this song to me. The song literally translates to &quot;I'm going to build a house in front of your house.&quot; It's supposed to be this cute love song where the guy wants to &quot;build his world in front of her house.&quot; My question is, wouldn't it be more romantic if he built a house FOR them WITH her? Why does he only want to be in front of her house? I may be missing some context from the rest of the movie but regardless that's a whole different tangent.</p>\n<p>This song was pretty much just my mom telling me she wants to live right across the street from my and constantly spoil her future grandchildren. I'm pretty sure my mom wanted a full on re-enactment of &quot;Everybody loves Raymond.&quot; But hey, who's gonna complain about a free babysitter and delicious food? :P</p>\n<center>**Love you Amma! <3**< center=\"\">\n<p><img src=\"https://pramods.box.com/shared/static/qvuujqsw2q4cswg2630ahefurw3iyfnt.jpg\" alt=\"\"></p>\n<p>(While you're at it, you should also <a href=\"http://uppukhara.com\">check out her blog here</a>! It's basically every recipe she made for me growing up that I have random cravings for since I've moved out to California.)</p>\n<p>Sometimes I feel like I'm not a complete adult yet. Even though I'm currently supporting myself, paying my own bills, taxes, and insurance, I don't always feel like a &quot;real&quot; adult. Then, there are times when suddenly I feel like a full on housewife, which is something I NEVER EVER want to be.</p>\n<p>One such instance was this past weekend, when I was anxiously awaiting the arrival of my new electric pressure cooker. One thing I'm <em>sure</em> every child growing up in an Indian household can relate to, is the sound of a pressure cooker. That sound TERRIFIED me to my core throughout my childhood, and to this day. I always feel like something somewhere is going to explode. Even in college when my roommate decided to make dal and turned on the pressure cooker, we used to hide behind our bedroom doors waiting for it to go off enough times so could turn it off and continue hiding. You'd think that it wouldn't be worth the fear, but honestly have you ever had dal or even better, Bangalore-style saaru? Yea, it's worth it. (If you're wondering what that is, it's a less liquidy and better version of rasam with more dal in it). I've tried all sorts of cooking techniques, but saaru just doesn't taste quite the same unless you use a pressure cooker. And this way, you don't end up wasting hours and hours making your meal. THAT is not worth it.</p>\n<p>The sound of our pressure cooker is even worse for our dog because he can hear the noise WAY before we can. He panics and runs all the way up the stairs and cowers near my parent's bedroom door. This happens without fail every time my mom STARTS the pressure cooker. He knows it's coming and refuses to come down from his hiding spot until he's completely sure it's not going to go off again. Poor baby. But I'm sure you'll all realize why once you get your own pressure cookers!</p>\n<p><img src=\"https://pramods.box.com/shared/static/btjgsul6c32hvenzfsw74q4e2xc34mi3.jpg\" alt=\"\"></p>\n<p>But AHA! What is this?! An ELECTRIC pressure cooker? What is this magical device? So quiet and effective? Truly this can't be real! But miraculously, IT IS!</p>\n<p><img src=\"http://ecx.images-amazon.com/images/I/51jpKXz6EuL._AC_UL320_SR308,320_.jpg\" alt=\"\"></p>\n<p>I've never been so excited for any adult purchase in my life, except <em>maybe</em> my car. This was a glorious purchase. NOT ONLY can it make dal in 4 minutes, but I can use it to make dahi (yogurt or curds generally eaten with indian food), rice, and basically anything else in life I could ever think of! ALL WITHOUT MAKING A SOUND! I didn't even realize it had even started and it made a beeping noise indicating that my food was READY! It's wonderful.</p>\n<p>Amidst all this excitement over the pressure cooker, I got kind of homesick for my mom's food. I then proceeded to facetime my mom for an hour while she carefully explained step by step instructions on how to make one of my favorite childhood dishes, Bendekai Huli or for you non-Kannada speaking people out there, Okra Sambar. Most kids hate okra, but honestly it's one of my favorite vegetables, especially when it's in Indian food.</p>\n<p>I know this might not be the most flattering picture of any of us (mainly my brother) but whatever.</p>\n<p>One thing I will mention is that I am not sure where to get the huli pudi (sambar powder). My parents usually bring bags back from this little store in Bangalore every time anyone visits, but I'm sure you can find something similar in local Indian stores. I mean, I know I couldn't live without sambar so I'm sure there are other people who feel the same way and have found a way! There are also instant mixes available at the Indian store - while these aren't quite as good, they can satisfy the occasional craving!</p>\n<p>Now that you've learned a little bit of Kannada, and hopefully are as excited as I was, let's begin!</p>\n<p><img src=\"https://pramods.box.com/shared/static/gqm35vb6v2zox6pbikr2rrwd7fwe0y6u.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Okra Sambar or Bendekai Huli</h2>\n    <div class=\"summary\">\n      <p><em>I'm giving these instructions based on my electric pressure cooker. You may have to adjust the dal portion of the recipe according to however you make it. Pressure cookers scare the bejesus out of me so be careful!</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <h4>Dal</h4>\n          <li class=\"ingredient\">1 cup toor dal</li>\n          <li class=\"ingredient\">1/2-3/4 tsp turmeric powder</li>\n          <li class=\"ingredient\">2 1/2 cup water</li>\n          <h4>Sambar</h4>\n          <li class=\"ingredient\">oil</li>\n          <li class=\"ingredient\">1/2-3/4 tsp mustard seeds</li>\n          <li class=\"ingredient\">1 small package frozen okra</li>\n          <li class=\"ingredient\">1/2-3/4 tsp tamarind paste</li>\n          <li class=\"ingredient\">1 1/2 spoons huli powder (sambar powder)</li>\n          <li class=\"ingredient\">water</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Add the toor dal to your pressure cooker and rinse. Add the water and turmeric and turn on the pressure cooker. I did the Manual setting for 4 minutes. Also make sure its set to low pressure and all the pieces are in place. When the pressure cooker was done it went into keep warm (displayed \"L00:00\") and started counting up. I unplugged it and let it release the pressure on its own.</p>\n        <p>In a pot, add some oil and mustard seeds on medium heat, this is called vagarne. When the mustard seeds start popping, add the frozen okra. When the okra starts to get kinda sticky and stringy, add the tamarind paste and a little bit of water. Keep cooking and mixing the okra occasionally until it is cooked through.</p>\n![](https://pramods.box.com/shared/static/uq45bcrldnses3q369jmzcs1v1srqmqv.jpg)\n        <p>Add huli powder and salt to taste and let it come to a boil. Add the dal and more water until it's the right consistency. Taste it as you go. I needed to add a little more tamarind paste and huli powder to fit my taste but that depends person to person.</p>\n        <p>Let it cook for a few minutes and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/wlq7z13f7uqkm9b2jpei4zk2ruai6hp2.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/4y2jxv3s81ef223fs8ejkb5fp2bhxwf7.jpg\" alt=\"\"></p>\n</3**<></center>","feature_image":"https://pramods.box.com/shared/static/jsq0nkdtbwdws84izepapwnja2t93efo.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c297","name":"mom","slug":"mom"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2d1","name":"pressure cooker","slug":"pressure-cooker"},{"id":"5c47a6f22037ef002282c2d2","name":"crock pot","slug":"crock-pot"},{"id":"5c47a6f22037ef002282c2d3","name":"okra","slug":"okra"},{"id":"5c47a6f22037ef002282c2d4","name":"sambar","slug":"sambar"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c359","uuid":"a15671eb-987c-4a1e-b6cb-d2b26eff884a","title":"Netflix and Chilaquiles","url":"https://cookinginpjs.herokuapp.com/netflix-and-chilaquiles/","published_at":"20 January, 2016","html":"<p>This Christmas vacation, Anagha and I were reunited for the first time in almost a year. There are many phases of a best friend reunion, according to this <a href=\"http://www.buzzfeed.com/kelseydarragh/when-your-bff-comes-to-town#.nsbQEmYJq\">buzzfeed article</a>. Pretty much every single thing in that article happened, except in our friendship instead of drinking our weight in wine, we cook. And eat.</p>\n<p><strong>A LOT OF FOOD</strong></p>\n<p><img src=\"https://ak-hdl.buzzfed.com/static/2015-12/8/18/enhanced/webdr11/anigif_original-21914-1449616517-5.gif\" alt=\"\"></p>\n<p>I'm pretty sure Anagha spent 50% of her time at my place and the other 50% at her own parents' house. We didn't even do anything most of the time... I would be working and she would be reading at the opposite end of the table. She had also never met the newest addition to my family, Miggy Pramod, who is basically the most adorable dog known to man.</p>\n<p>True to form, they became best friends immediately.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ijnjkbtgaycn5ddhbx2dwakh9gcrq3ua.jpg\" alt=\"\"></p>\n<p>Seriously though, who couldn't love a weirdo that sleeps like this regularly?</p>\n<p><img src=\"https://pramods.box.com/shared/static/j1fczq8yhjzxhz0ae852f1lu4wqdp00s.jpg\" alt=\"\"></p>\n<p>Just look at him.</p>\n<p><img src=\"https://pramods.box.com/shared/static/8429t2jqhh8zkgv3fuc8vszlqh3y8dbj.jpg\" alt=\"\"></p>\n<p>This past August, my dad decided that my mom's birthday gift would be to finally get a puppy. My entire family, brimming with excitement, spent hours and hours looking on petfinder.com and various shelter sites for the perfect little CALM addition to our family. After countless shelter visits and close calls with various puppies, we were extremely tired and disheartened. The process of finding the perfect dog for our family had become a lot more emotionally draining than we had originally thought. My mom wasn't sure if she could get attached to another dog and see him/her join another family. Then one day, my parents went to this small little animal hospital in Sterling Heights, MI and instantly became smitten with, what we were told, was a little beagle mix. He was an adorable 18 pound ball of affection who just wanted to play. One week later, he was ready to come home.</p>\n<p><img src=\"https://pramods.box.com/shared/static/dcypl744jtl2r4ey4gb8xydob6hi09g6.jpg\" alt=\"\"></p>\n<p>He was a VERY little 5 month old puppy. Little did we know that the tiny little boy that we brought home was a little more German Shepherd than Beagle. Currently, Miggy is a happy 40 pounds and the obsession of my entire family, weird sleeping positions, ear licking fetishes and all.</p>\n<p>ANYWAYS putting the puppy love aside, whenever we weren't spoiling Miggles with never ending attention, we were watching Netflix and eating All The Brunch. If it hasn't become obvious from some of our <a href=\"http://cookinginpjs.com/brunch-conquers-all/\">previous posts</a>, We <strong>LOVE</strong> brunch. Best of all, it means that we can roll out of bed in our pajamas and enjoy some scrumptiousness that we could concoct using eggs and veggies. Yay Pajamas! YAY Brunch!</p>\n<p>Then, it's time for a relaxing, vacation time food coma. There's that one episode of friends where Joey and Ross discover that they are each other's best nap buddies. Exactly. Who <em>DOESN'T</em> want a nap buddy and best of all your best friend?! So we spent most of our afternoons watching Netflix and chilling (no not like that you perv!) but literally watching Netflix reruns and napping with my puppy.</p>\n<p><strong>Best. Break. Ever.</strong></p>\n<p><img src=\"https://45.media.tumblr.com/78bddaf03bdfb59b75a09a3c3db38b10/tumblr_ngbxx0rIAb1snhpyjo1_r1_500.gif\" alt=\"\"></p>\n<p>We also love Mexican food. No explanation needed. It's just the best. So OBVIOUSLY nothing could be better than combining the two things we are always craving. In came chilaquiles.</p>\n<p>I've had varieties of chilaquiles in the past. From the beaches of Cancun to the streets of San Francisco and San Diego. Everywhere, they put their own spin on the classic Mexican dish. Traditionally it's kept very simple with just fried tortillas, salsa, egg, and beans (and/or meat). California, on the other hand, tends to add avocado to everything so it's very colorful. Our variation probably includes WAY more vegetables than most but I love it and it tasted delicious.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/9r2pggwyj4j7fre2tlxu47nhkj2be8mh.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/3g098w0hj52qe8k9d45ddalcfxo4a2oh.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/eb3enu78qybtf2rl2qygx4gx64l9r7zn.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chilaquiles</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">1 bottle <a href=\"http://www.lavictoria.com/products/salsa/thickn-chunky-salsa-verde-medium/\">Salsa Verde</a></li>\n          <li class=\"ingredient\">1 bag tortilla chips</li>\n          <li class=\"ingredient\">1 can black beans</li>\n          <li class=\"ingredient\"><a href=\"http://cookinginpjs.com/estoy-cantando/\">Sumedha's Super Secret Fajita Seasoning</a></li>\n          <li class=\"ingredient\">1 avocado cubed</li>\n          <li class=\"ingredient\">1 egg per person</li>\n          <li class=\"ingredient\">sour cream</li>\n          <li class=\"ingredient\">cheese (shredded or Cotija)</li>\n          <li class=\"ingredient\">chopping cilantro to garnish</li>\n        <h4>Pico De Gallo Salsa</h4>\n          <li class=\"ingredient\">2 roma tomatoes</li>\n          <li class=\"ingredient\">1/2 onion diced</li>\n          <li class=\"ingredient\">1/4 cup chopped cilantro</li>\n          <li class=\"ingredient\">lemon juice to taste</li>\n          <li class=\"ingredient\">salt to taste</li>\n        <h4>Corn Salsa</h4>\n          <li class=\"ingredient\">1 can sweet corn kernels</li>\n          <li class=\"ingredient\">4 sliced jalapeños (more or less based on your spice tolerance)</li>\n          <li class=\"ingredient\">lemon juice to taste</li>\n          <li class=\"ingredient\">salt to taste</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Put two handfuls of tortilla chips in a pan and cover with the salsa verde. Let the chips soak on low-medium heat while completing the remaining steps. Make sure to stir occasionally so all of the chips are covered in salsa</p>\n        <img src=\"https://pramods.box.com/shared/static/h40kxa1n2f931rxbfyg2ckvllshtz13o.jpg\">\n        <p>Cook the beans with as much of Sumedha's Super Secret Fajita Seasoning as you like. For each salsa, combine the ingredients in a bowl and keep to the side.</p>\n        <p>When the beans are almost done, make one sunny side up egg for each person. You are more than welcome to scramble them if you don't like runny eggs.</p>\n        <p>Spread the soaked tortilla chips on each plate. Layer the beans, egg, salsas, avocado, cheese, sour cream and cilantro on top of the chips. Grab your fork and knife and let the egg yolk flow. ;)</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/t03aga3evw84924kvc9harwbozrs50a9.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/1fcrzhi9xfs643a73eziigxq1qmtnkah.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/sl6dcu7i0xy3w2cv0wxx6bduskqus5r7.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/fco4k8iom9446zmbd42f9dby9n7o3cmn.jpg","tags":[{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c2b8","name":"puppy","slug":"puppy"},{"id":"5c47a6f22037ef002282c2b9","name":"chilaquiles","slug":"chilaquiles"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ba","name":"reunion","slug":"reunion"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c2bf","name":"naps","slug":"naps"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"slug":"puppy","limit":6,"skip":0,"numPages":1,"currentPage":1}}