{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"FoodChella","slug":"foodchella","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","published_at":"04 May, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg\" alt=\"\"></p>\n<p>So I was terribly sick last week whilst recovering from Coachella so I've decided to treat you guys with not one but TWO whole posts! I know right?! So awesome. You can thank me later. AND to make things better... instead of sharing just a single song... I'm going to gift you with a whole playlist of my favorite songs from Coachella!</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify%3Auser%3A1217494097%3Aplaylist%3A7vHswNAsv4lLIjCNrjvzeZ\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>So very typical of me, I didn't double check my flight timings when booking so I ended up flying out to LAX a whole 10 hours before the rest of my group. I decided to start the trip out right, eggs Benedict and a mimosa at the airport with a side of Gilmore Girls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/egnkhg8zefh3rl0xkh1co74s074cr4c0.jpg\" alt=\"\"></p>\n<p>Usually 10 hours stranded at an airport is a bummer, but there are worse places to get stranded than LAX. It kind of ended up working out for me because I took my camera and explored! I walked from Santa Monica Pier to Venice Beach and soaked in the gorgeous SoCal sun.</p>\n<p>In Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously, probably the best I've ever had in my life.</p>\n<p><img src=\"https://pramods.box.com/shared/static/0i02gxp1jckp0svdv6cu8wi5ewctzsvm.jpg\" alt=\"\"></p>\n<p>In Venice Beach, I decided to have a lighter option and enjoyed some Burrata and Beets at Larry's Bar &amp; Grill.</p>\n<p><img src=\"https://pramods.box.com/shared/static/6dynwvyb7q9fon9luvmogmd3wbei2szk.jpg\" alt=\"\"></p>\n<p>The most adventurous meal was at dinner with a friend at Wurstk端che. We enjoyed some cold beers and Rattlesnake Sausages. It honestly didn't taste much different from other sausages and was actually pretty good but I can't say I'd comfortably eat that again.</p>\n<p><img src=\"https://pramods.box.com/shared/static/aypjyy5024v7hcfqhqa4dwl3x6injkm7.jpg\" alt=\"\"></p>\n<p>The weekend was filled with new musical obsessions, including Zhu &amp; Flume (seriously check out that playlist ^), new friends, delicious eats, and lots and lots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the unfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon, Sean Paul, and Nico&amp;Vinz during Matoma's set.</p>\n<p><img src=\"https://pramods.box.com/shared/static/duq94s8q18b3qklwj730gkuu2l5szcpm.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/ie4gkxnr4yruv5grnjyaya1iunyoj6pm.jpg\" alt=\"\"></p>\n<p>I came back home the following Monday sunburned (what happens when you wander around LA without sunscreen) and exhausted out of my mind; Cue sickness.</p>\n<p>This was my first year attending Coachella, every instagrammer's and basic bitch's haven. Of course I had to have ONE basic picture myself to commemorate the experience.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z7gfp3dlql2f2wag911y4lvsznp2q06v.jpg\" alt=\"insert basic watermelon picture here\"></p>\n<p>Coachella is also a GREAT place for foodies. While you needed to be a VIP to get access to some of the tastiest and more exclusive food, there was plenty of delicious options to spare. Looking back at my food photos, I realize that I basically survived off fries. Just fries. And obviously watermelon, because it IS Coachella. But these fries were no ordinary fries my friends. They were all loaded with various toppings and delicious goodness.</p>\n<p>Veggie Monster Fries with lots of types of slaw and jalape単os!<br>\n<img src=\"https://pramods.box.com/shared/static/z4ge00bngygbfezcdyv3x4gdsve5p72u.jpg\" alt=\"\"></p>\n<p>Vegetarian Poutin Fries with cheese curds!<br>\n<img src=\"https://pramods.box.com/shared/static/uyr9jkumf8n2a6mzue6bxdrimbfblro2.jpg\" alt=\"\"></p>\n<p>Crab Fries! This meant crab aioli AND crab topping! Double yum!<br>\n<img src=\"https://pramods.box.com/shared/static/bcjeq6dasdfv4jbihq44hhsudjks88eh.jpg\" alt=\"\"></p>\n<p>Chicharones Fries with Sriracha and curry aioli!<br>\n<img src=\"https://pramods.box.com/shared/static/2uta04ogd3ap0dy1aw8ya7xit7ocqvul.jpg\" alt=\"\"></p>\n<p>I honestly have no idea how most of these things were made but my stomach was hella happy. :)</p>\n","plaintext":"\n\nSo I was terribly sick last week whilst recovering from Coachella so I've\ndecided to treat you guys with not one but TWO whole posts! I know right?! So\nawesome. You can thank me later. AND to make things better... instead of sharing\njust a single song... I'm going to gift you with a whole playlist of my favorite\nsongs from Coachella!\n\nSo very typical of me, I didn't double check my flight timings when booking so I\nended up flying out to LAX a whole 10 hours before the rest of my group. I\ndecided to start the trip out right, eggs Benedict and a mimosa at the airport\nwith a side of Gilmore Girls.\n\n\n\nUsually 10 hours stranded at an airport is a bummer, but there are worse places\nto get stranded than LAX. It kind of ended up working out for me because I took\nmy camera and explored! I walked from Santa Monica Pier to Venice Beach and\nsoaked in the gorgeous SoCal sun.\n\nIn Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously,\nprobably the best I've ever had in my life.\n\n\n\nIn Venice Beach, I decided to have a lighter option and enjoyed some Burrata and\nBeets at Larry's Bar & Grill.\n\n\n\nThe most adventurous meal was at dinner with a friend at Wurstk端che. We enjoyed\nsome cold beers and Rattlesnake Sausages. It honestly didn't taste much\ndifferent from other sausages and was actually pretty good but I can't say I'd\ncomfortably eat that again.\n\n\n\nThe weekend was filled with new musical obsessions, including Zhu & Flume\n(seriously check out that playlist ^), new friends, delicious eats, and lots and\nlots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the\nunfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon,\nSean Paul, and Nico&Vinz during Matoma's set.\n\n\n\n\n\nI came back home the following Monday sunburned (what happens when you wander\naround LA without sunscreen) and exhausted out of my mind; Cue sickness.\n\nThis was my first year attending Coachella, every instagrammer's and basic\nbitch's haven. Of course I had to have ONE basic picture myself to commemorate\nthe experience.\n\n\n\nCoachella is also a GREAT place for foodies. While you needed to be a VIP to get\naccess to some of the tastiest and more exclusive food, there was plenty of\ndelicious options to spare. Looking back at my food photos, I realize that I\nbasically survived off fries. Just fries. And obviously watermelon, because it\nIS Coachella. But these fries were no ordinary fries my friends. They were all\nloaded with various toppings and delicious goodness.\n\nVeggie Monster Fries with lots of types of slaw and jalape単os!\n\n\nVegetarian Poutin Fries with cheese curds!\n\n\nCrab Fries! This meant crab aioli AND crab topping! Double yum!\n\n\nChicharones Fries with Sriracha and curry aioli!\n\n\nI honestly have no idea how most of these things were made but my stomach was\nhella happy. :)","tags":[{"id":"5c47a6f22037ef002282c321","name":"coachella","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","name":"poutin","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","name":"crab","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","name":"chicharones","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","name":"music","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","name":"venice beach","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","name":"santa monica","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","name":"LA","slug":"la"},{"id":"5c47a6f22037ef002282c329","name":"rattlesnake","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","name":"burrata","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"}]}},"pageContext":{"slug":"foodchella","previous":{"html":"<p>There's something about the combination of chocolate and orange that just gets me every time. I love to make hot chocolate with just a few drops of orange in it, and I have been dying to make chocolate-y bread with bits of orange zest woven through it.</p>\n<p><img src=\"https://pramods.box.com/shared/static/j3affjujmdzyx46vui37m7aux09yuvg8.jpg\" alt=\"\"></p>\n<p>But this weekend, I found myself with coconut flour and coconut cream, and decided on chocolate cookies with a delicious, lightly orange-flavored cream.</p>\n<p>If you want to get all hipster buzzwords about it, this recipe is: grain free, refined sugar free, vegan.</p>\n<p>If you just want to be totally super normal about it, this recipe is: delicious.</p>\n<p>Give it a try :)</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Orange Cream//Chocolate Cookies</h2>\n    <div class=\"summary\">\n      <p><em>This is a super simple and quick recipe. There is literally no reason not to give it a try.</em></p>\n      <p>Yield: 26 1.5\" cookies</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Chocolate Cookie</h4>\n          <li class=\"ingredient\">3/4 C Coconut Flour</li>\n          <li class=\"ingredient\">1/4 C Cacao Powder</li>\n <li class=\"ingredient\">1/4 C Coconut Oil</li>\n <li class=\"ingredient\">1/4 C Maple Syrup</li>\n <li class=\"ingredient\">Soy milk as needed</li>\n        <h4>Orange Cream</h4>\n          <li class=\"ingredient\">1 Can Chilled Coconut Cream</li>\n          <li class=\"ingredient\">1/4 C Powdered Sugar</li>\n<li class=\"ingredient\">Three Drops Orange Oil</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n1.) Mix together coconut flour and cacao powder in a bowl. \n</p><p>\n</p><p>\n2.) Put the coconut oil (solid; refrigerate if needed) into the flour mixture and cut it with a fork. You want it to be sort of crumbly and sandy when you're done. \n</p><p>\n</p><p>\n3.) Pour the maple syrup (cold) into the mixture, and again, mix it in with a fork. This mixture will remain sort of sandy and crumbly. \n</p><p>\n</p><p>\n4.) Add soy milk a tablespoon at a time. Your dough will be a little crumbly, but will stick together in one huge mass when you're done. It won't be elastic, but it will stick together reasonably well. \n</p><p>\n</p><p>\n5.) Shape into 26 cookies and set on a greased baking sheet - these cookies won't spread, so flatten them to the shape you want. Stick in the fridge, and preheat the oven to 350. \n</p><p>\n</p><p>\n6.) When the oven is ready, put your cookies in and set a timer for fifteen minutes. Mine took right around 18, so I would check them at fifteen, and let them go till they're done! \n</p><p>\n</p><p>\n7.) While the cookies are baking, take out your coconut cream and flip it upside down. Open it, and there should be some liquid there. Pour that into a cup (it's delicious, and can be used in smoothies) and scoop out the cream into a separate bowl. Whip, then add the sugar and orange oil and whip some more. \n</p><p>\n</p><p>\n8.) Take a cookie, through a dollop of cream on there and dig in; delicious! \n        </p>\n      </div>\n    </div>\n  </div>\n</div>","title":"Orange Cream//Chocolate Cookies","slug":"orange-cream-chocolate-cookies","published_at":"02 May, 2016","feature_image":null,"tags":[]},"next":{"html":"<p>K this second post for the week took a bit longer than expected but I finally perfected the pictures so we're good now. YAY Post #2 for the week! And that too, to celebrate one of the nerdiest holidays out there! STAR WARS DAY!</p>\n<p><img src=\"https://media.giphy.com/media/4PbEHW8mN4xhK/giphy.gif\" alt=\"\"></p>\n<p>All the wonderful puns.</p>\n<p>Also because this recipe is banana filled, I HAD the little song by the Minions from Despicable Me stuck in my head. So I figured I should share that adorableness and mental torture with you guys.</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/sFukyIIM1XI?wmode=transparent\"></iframe>\n</div>\n<p>Anyways... after being home sick for an entire week in what I consider my personal version of solitary confinement, I hit a new level of insanity. I was deprived of social interaction to such a point that I legit LOL'd at a Buzzfeed article of ridiculous snapchats for a good 20 minutes. And by LOL'd I mean curled over laughing so hard I could barely breathe. No Buzzfeed article is THAT funny. I had such bad sinus pain that working on my computer for long periods of time was pretty rough. So I decided rather than wallowing in my bed, I was going to make SOME productive use of my time... baking for you guys!</p>\n<p>I found this recipe on Pinterest a while back of <a href=\"http://www.carlsbadcravings.com/cream-cheese-stuffed-chocolate-chip-banana-coffee-cake-recipe/\">Cream Cheese Filled Chocolate Chip Banana Coffee Cake</a>. I do want to preface my recipe with this:</p>\n<ol>\n<li>I didn't some of the ingredients so this is my altered version for lazy bakers :)</li>\n<li>I also don't have a bundt cake pan, so mine didn't come out as gorgeous looking as this but there is one thing I CAN guarantee, which is that they came out DELICIOUS. Probably one of my favorite desserts I've ever made, next to Tiramisu and my mom's Mush Cake.</li>\n<li>I didn't have brown sugar and didn't want to bother making a second grocery store trip for that so I just didn't bother making the streusel topping that was in the original recipe. I can only imagine how much more mind blowing it would have been had I added the streusel, maybe you can make yours with it and let me know!</li>\n</ol>\n<p><img src=\"https://pramods.box.com/shared/static/1tjouximy6nxjmeaomjqkrsd4i5ouqxi.jpg\" alt=\"\"></p>\n<p>Over the last few weeks I've been trying to figure out where in my new apartment I can do my food photography to optimize the natural light coming from my windows. In my old apartment it was extremely easy, I had giant sliding doors which brought in ALL the light and shown over pretty much my entire living room; and if that wasn't enough then I could go out onto my balcony and take the photos there! It was perfect. This week I discovered that if I angle one of my side tables properly and place the dish inside it, the light reflects off the walls of the table perfectly onto the the food and really brings out all the details in the food! I HAD FINALLY FIGURED IT OUT! Although this weird positioning did lead to some old people back pain for me because of the weird positions that I laid in on the floor to get these photos. Such is the pain for beauty.</p>\n<p><img src=\"https://pramods.box.com/shared/static/l2l9lmho8q088kczuewl9ll8ec4uz2b8.jpg\" alt=\"\"></p>\n<p>I mean just look at it...</p>\n<p>This is one recipe I would HIGHLY recommend you try, whether it be my interpretation or the original recipe itself. It was delicious and my coworkers and friends LOVED it.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ficxwsing8l7wulb6s5v3pvs4w4grit7.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chocolate Chip Banana Cheesecake Coffee Cake </h2>\n    <div class=\"summary\">\n      <p><em>If you don't have over-ripe bananas, then Carlsbad Cravings gave a great suggestion of sticking them in the oven at 325 F degrees until they're dark on the outside and soft to the touch.</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n        <h4>Banana Coffee Cake</h4>\n          <li class=\"ingredient\">2 1/4 cups all purpose flour</li>\n          <li class=\"ingredient\">1 1/4 tsp baking powder</li>\n          <li class=\"ingredient\">1 1/4 tsp baking soda</li>\n          <li class=\"ingredient\">1 tsp salt</li>\n          <li class=\"ingredient\">2 tsp cinnamon</li>\n          <li class=\"ingredient\">1/2 cup butter, softened</li>\n          <li class=\"ingredient\">1 1/2 cup sugar</li>\n          <li class=\"ingredient\">2 large eggs</li>\n          <li class=\"ingredient\">4 large bananas, over-ripe and mashed</li>\n          <li class=\"ingredient\">1 tbsp vanilla extract</li>\n          <li class=\"ingredient\">1 1/4 cups non-fat plain yogurt (or greek yogurt)</li>\n          <li class=\"ingredient\">3/4 cup chocolate chips</li>\n        <h4>Cheesecake filling</h4>\n          <li class=\"ingredient\">16 oz cream cheese, softened</li>\n          <li class=\"ingredient\">1/2 cup reserved batter (from banana coffee cake above)</li>\n          <li class=\"ingredient\">1/2 cup sugar</li>\n          <li class=\"ingredient\">2 tsp vanilla extract</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Preheat oven to 350 degrees F and spray your pan with nonstick cooking spray and flour the inside of your pan.</p>\n        <p>In a medium bowl, whisk together flour, baking powder, baking soda, salt, and cinnamon. Set aside.</p>\n        <p>Using a hand mixer, beat the butter and sugar together until fluffy. Add the eggs in one at a time and beat until blended. Mix in the vanilla and bananas until just combined.</p>\n        <p>Gradually add the dry ingredients to the wet ingredients, alternating with the yogurt. Beat until just combined. Measure out 1/2 cup of batter and keep aside for the cheesecake filling. Stir in the chocolate chips into the remaining batter and keep aside. Measure out about 1 cup of the batter with chocolate chips and keep aside to layer on top of the cheesecake filling. Pour the remaining batter into your pan.</p>\n        <p>In a separate bowl, mix together the 1/2 cup batter you set aside earlier with the rest of the cheesecake filling ingredients on high speed until smooth and creamy.</p>\n        <p>Spread the cheesecake filling on top of the current layer batter in the pan. It's okay if it sinks in a bit, this cake is much more moist than the original recipe so the cheesecake layer is more variable in size. Pour the top layer of batter on top of the cheesecake filling. If you made a streusel, now is the time to sprinkle it on top.</p>\n        <p>Bake for 55-60 minutes at 350 degrees F or until toothpick inserted comes out clean (ignoring the melted chocolate chips and any possible cream cheese that still may not be solid). Let it cool and enjoy!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://pramods.box.com/shared/static/lozxye3uf7ndz1bq5qwgk1o2lajyls2a.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/ialsxs0p5kgc7foopbw58jrhar6jgh74.jpg\" alt=\"\"></p>\n<p>![] (<a href=\"https://pramods.box.com/shared/static/opdcb8ciiq9ib1qbz8nfbz84gtjvanxz.jpg\">https://pramods.box.com/shared/static/opdcb8ciiq9ib1qbz8nfbz84gtjvanxz.jpg</a>)</p>\n<p><img src=\"https://pramods.box.com/shared/static/aof6kocepcho6w5yauqnzhv6mtlxbruc.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/e280e6xw9g6h0p4m05q7nexwwj3vrtby.jpg\" alt=\"\"></p>\n","title":"Ba-na-na Ba-na-nana Po-ta-tooo Po-ta-to-naaaa","slug":"ba-na-na-ba-na-nana-po-ta-tooo-po-ta-to-naaaa","published_at":"05 May, 2016","feature_image":"https://pramods.box.com/shared/static/l2l9lmho8q088kczuewl9ll8ec4uz2b8.jpg","tags":[{"id":"5c47a6f22037ef002282c291","slug":"banana"},{"id":"5c47a6f22037ef002282c280","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","slug":"cake"},{"id":"5c47a6f22037ef002282c253","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c272","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c32b","slug":"chocolate-chips"},{"id":"5c47a6f22037ef002282c32c","slug":"experiments"},{"id":"5c47a6f22037ef002282c32d","slug":"minions"},{"id":"5c47a6f22037ef002282c32e","slug":"star-wars"},{"id":"5c47a6f22037ef002282c32f","slug":"sick-days"}]}}}