{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c383","uuid":"64999048-482e-4f3b-9b9b-dc46e14cb5c8","title":"Brunch Conquers All","slug":"brunch-conquers-all","published_at":"14 February, 2015","plaintext":"\n\nWhen I was younger, my family rarely did breakfast all together; on weekdays we\nwere all rushing around, and on weekends we would all emerge from our rooms at\nour own times, grazing on whatever acceptable breakfast food was around. For\nmany years, breakfast on Saturday meant spending the entire morning alone on the\ncouch, watching cartoons, dodging my mother's attempts to make me a productive\ncitizen, and eating sugary cereal with abandon. Occasionally, we would have\nguests and my mother would cook some traditional Indian breakfast items - dosa,\nroti, upma, etc. - and we would have brunch. But these days were usually paired\nwith pre and post cleaning and formal clothing, so while we loved the company,\nthe whole situation was no bueno.\n\nIt wasn't until I got to college that I really understood brunch. On our campus,\nLandon dining hall had the most amazing brunch you can imagine - everything from\nice cream to omelettes to fresh fruit and berries was represented, and you could\nliterally eat your heart out. In addition to that, we lived in close proximity\nto Golden Harvest, a small brunch area in Lansing that has a following that\nborders on obsessive. In East Lansing, brunch does not just pass you by, and\nfrom the minute I stepped into Landon, with a slight headache and stomache,\ncraving grease and comfort food, I was a convert.\n\n\n\nBrunch is neither breakfast nor lunch; it's an in between meal, and as such,\ndoesn't have the conventions of the other two. You can enjoy some giggle juice\nwith brunch. You can dip strawberries in chocolate and throw it on a waffle with\nsugar and it won't count as dessert. You can show up all smelly at your best\nfriend's house at eleven o'clock, post late wake up call and workout, demand\neggs, toast, and avocados, and call THAT brunch.\n\nYou can wake up at eight AM and race to Golden Harvest, wait in line for over an\nhour and a half in the freezing cold, and earn your brunch. Or you can have a\nlie in at home and make yourself some waffles or toast and watch television, and\nit could be the most lovely brunch you'll ever have.\n\n\n\nBrunch is the most welcoming of the meals.\n\nBrunch is patient, brunch is kind. It does not envy, it does not boast, it is\nnot proud. It is not rude, it is not self-seeking, it is not easily angered, it\nkeeps no record of wrongs. Brunch does not delight in evil but rejoices with the\ntruth. It always protects, always trusts, always hopes, always perseveres.\nBrunch never fails.*\n\nBrunch is love, y'all. Show someone a little love and pan fry some potatoes and\nthrow a poached egg on top. Give yourself a little treat and stick an overeasy\nfried egg in a sandwhich with some mixed greens and tomatoes. Use avocado\nliberally, and consider experimenting with sriracha and truffle oil. Kale and\nwhite sugar are both invited to this party, because brunch does not\ndiscriminate.\n\nLet your creative juices and chocolate sauce flow; brunch is a meal without\nprotocol or limitations, and you definitely deserve that business in your life.\n\n\n\n*I took some creative licenses with Corinthians 13:4-8a. I did it with utmost\nrespect for the original verse.","feature_image":"https://farm6.staticflickr.com/5612/15837068312_eeff7d20e1_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c23b","name":"eggs","slug":"eggs"},{"id":"5c47a6f22037ef002282c23c","name":"hash","slug":"hash"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c23e","name":"sandwich","slug":"sandwich"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c24e","name":"love","slug":"love"},{"id":"5c47a6f22037ef002282c2a4","name":"valentines day","slug":"valentines-day"}]}}]}},"pageContext":{"slug":"hash","limit":6,"skip":0,"numPages":1,"currentPage":1}}