{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c340","uuid":"279e49d2-aba1-4211-82c1-089cbd2da209","title":"Gaadi Chaats","slug":"bread","published_at":"08 February, 2016","plaintext":"Welcome to another trip to India! When I was there, I ate a ton of food. All of\nmy family members were happy to feed me, and between the amazing home cooking,\nand the delicious food available on every street corner, it's almost a miracle\nthat I didn't pack on pounds.\n\nI am, generally, pretty picky about my food. I waver between being vegan and\nvegetarian, and I'm usually pretty careful about ingredients I allow in my\nkitchen. But, like everyone else, I have a fatal flaw and it's this; I love\nstreet food.\n\nI know that someone involved didn't wash their hands, I know that the\ningredients aren't always top notch, I know that the fat, salt, and sugar\ncontent is probably WAY higher than anything I should be consuming. But I don't\nparticularly care.\n\nIn India a \"gaadi\" is a vehicle, and \"chaat\" is street food that has fresh\nvegetable, puffed rice, sweet and spicy sauces, and some fried components. So\n\"gaadi chaat\" is street food you get out of a flat bed cart.\n\nIn Bangalore, there's a street people refer to as \"chaat street,\" and the street\nis lined with street food vendors. One end has a bakery, and the other end (the\nend I like to start on) has a few fruit carts, and one \"corn\" cart. I usually\nget my corn spiced with salt and chili, and mixed with raw, unripe mangoes\n(delicious!)\n\n\n\nThen it's time for Masala Chaat! This is one of my absolute favorites; it\nfeatures a thick, spicy lentil soup layered atop crispy, crackly puris (indian\n\"chips\" and under sweet and spicy chutney, some fresh onion and cilantro, and a\nsprinkle of \"chaat masala.\"\n\n\n\nIt's The Chaat Shop!\n\nNext up: Gobi Manchurian. Cauliflower dipped in dough and deep fried, then\ndredged in fresh onion and cilantro, and delicious, spicy, tomato-ey garlic-y\nsauces.\n\n\n\nThis is the Gobi Manchurian man! He also makes noodles. He is obviously\nsupremely talented.\n\nNow that you're ALMOST too full (because you've eaten your way down the street)\nit's time for dessert! There's a bakery you can step into, vendors with all\nkinds of sweets and shaved ice, and (my personal favorite) Mango Kulfi!\n\n\n\nGo to bed. It's been a long day, and you're long overdue for a satisfying food\ncoma.","feature_image":"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg","tags":[{"id":"5c47a6f22037ef002282c2d5","name":"chaat","slug":"chaat"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36b","uuid":"8abb8e5a-35f6-448b-a1d9-8decec1d3d4d","title":"Vidhyarthi Bhavan","slug":"vidhyarthi-bhavan","published_at":"01 February, 2016","plaintext":"I'm feeling homesick today. A year ago, I was in India, probably eating chaat\n(Indian street food), or taking pictures of my cousins while they danced around\nwith stuffed animals.\n\n\n\nI miss India a lot. I always loved visiting my family there, and going for eight\nmonths was one of the most valuable times in my life. I loved every minute of\nit.\n\nThis is a post about a breakfast place in Bangalore, Karnataka, India that\neveryone goes to. I hope you enjoy it as much as I did.\n\n\n--------------------------------------------------------------------------------\n\n\n\nEvery city has this restaurant. It's not classically pretty, and there's no one\nwaiting at the door to see whether or not you want to come in. This is a place\nwhere you have to leave your diet at the door (no one has any idea how many\ncalories/protein grams/vats of butter are in your food anyway). The waiters are\ninattentive enough that a newcomer would have left on the spot, and there are\nliterally never enough seats. There are a few places like this in Bangalore (in\na city this big, with this much traffic, you need multiple choice breakfast\nspots), but Vidhyarthi Bhavan is arguably one of the most delicious.\n\nIt's packed to the brim every day; I went on a Monday morning, and we had to\nstand behind people to snake their seats. And after we ate, people were standing\nbehind us to snake ours. The restaurant is famous for it's Masala Dosa, although\nthere are a couple of other items on the menu if you're interested.\n\nWhile you wait for your order, there are gorgeous photos of Mount Kailash, and\nreally interesting pencil sketches of famous poets and writers of India adorning\nthe walls.\n\n\n\nThere's plenty of fodder for people watching, if the smells wafting from the\nkitchen aren't enough to keep you totally occupied. Finally, your order comes\nout.\n\nThe dosas come to you on plates piled high in the waiter's arms (you have a\nbrief moment where you are concerned that the bottom of someone else's plate has\nbeen all over your food); the waiter never actually looks at you before he heads\nto the next table. Then a second waiter, arguably less attentive than the first,\ncomes over with a tureen of coconut, cilantro, and mint chutney and pours it\nonto your plate.\n\nYou dig in with your fingers, barely resisting the urge to just dig in with your\nwhole face. Finishing one of these babies is a task and a half, but you are\ndefinitely up to the challenge; going, going...gone.\n\n\n\nFinally, you get a cup of some excellent filter coffee to finish you right off,\nbefore you stumble into the daylight, and onto a street lined with flower and\nfruit merchants.\n\nYou amble along, sniffing deeply and enjoying the almost-too-full-but-not-quite\nfeeling in your stomach, and all feels right with the world.","feature_image":"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg","tags":[{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ca","name":"masala dosa","slug":"masala-dosa"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c2cb","name":"indian food","slug":"indian-food"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2cd","name":"bangalore","slug":"bangalore"},{"id":"5c47a6f22037ef002282c2ce","name":"vidhyarthi bhavan","slug":"vidhyarthi-bhavan"},{"id":"5c47a6f22037ef002282c2cf","name":"nostalgia","slug":"nostalgia"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c357","uuid":"37a98e77-e446-4f06-bbf8-6fbc1677f180","title":"The only thing weird would be if someone didn't like Mexican food, because I'm making FAJITAS!!","slug":"im-making-fajitas","published_at":"14 January, 2016","plaintext":"We all love Ross. Despite his many divorces and nerdy dinosaur quirks, Dr.\nGellar (no not that kind of doctor) was one of my favorite characters on\nFriends. Every time I make fajitas I remember Ross absolutely \"NOT\" being weird\nabout Joey and Rachel starting to go out. One of the most classic Ross moments\non the show.\n\n\n\nI was in India when Netflix released all ten seasons of Friends.\n\nALL. TEN. SEASONS. EASILY. ACCESSIBLE. ON. THE. INTERNET.\n\nThis was huge. I can't even begin to count the endless number of illegally\nuploaded episodes I've watched on YouTube with Spanish subtitles. I ended up\nlearning various inappropriate words through context. Made for some fun giggles\nduring Spanish class.\n\nWhile I was searching a mood song for this post, I stumbled onto this gem. It's\nso weird that it HAD to make it into the post.\n\nBack to the point. So this January when I was in India, my cousin had major\ncravings for Mexican food. We decided to enhance our existing Galentine's Day\nplans from just red velvet cupcakes\n[http://cookinginpjs.com/galentines-day-cupcakes/]  to include some simple yet\ndelicious Mexican food.\n\nA lot of the parts of this recipe have already been posted in other posts, so\nI'm just going to link those rather than retyping. I just sautéd a some spinach,\nbell peppers, onions, and mushrooms with my own fajita seasoning\n[http://cookinginpjs.com/estoy-cantando/]  recipe. Added some corn salsa and \nhomemade sour cream [http://cookinginpjs.com/taco-tuesday/]  and flour tortillas\n[http://cookinginpjs.com/taco-tuesday/]. All you have left to do is roll it up\nand enjoy!\n\nRecipes:\n\n * fajita seasoning [http://cookinginpjs.com/estoy-cantando/]\n * homemade sour cream & flour tortillas [http://cookinginpjs.com/taco-tuesday/]","feature_image":"https://pramods.box.com/shared/static/3chnt4gzvs3sg5exnvkiiy2q53zgqxfd.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c252","name":"fajitas","slug":"fajitas"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c29d","name":"ross","slug":"ross"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34d","uuid":"7021b7b8-3bef-4bf1-ab64-7a42245fdc06","title":"Taco Tuesday!","slug":"taco-tuesday","published_at":"10 February, 2015","plaintext":"\n\nOne of the coolest thing about restaurants and coffee shops that open franchises\ninternationally is that they tend to adapt their menu to the tastes of the\ncountry the store is in. For example, McDonald's in India actually has\ncompletely vegetarian options. Due to the large  population of vegetarians in\nIndia, McDonald's has 2 segregated kitchens for vegetarian and non-vegetarian\nfood. In addition, they don't serve any beef items, in contrast to the\nMcDonald's in the US, which is primarily beef burgers. Honestly, I love\nMcDonald's in India! They've managed to merge Indian flavors into simple\nAmerican burgers and come out with amazing dishes such as the McSpicy Paneer and\nMcAloo Tiki Burger. If you haven't yet, you should definitely try the McSpicy\nPaneer Burger, it's my favorite! :)\n\n\n\nMy cousin recently had a major craving for Mexican food. The only problem is\nthat we're in India and the Mexican food available doesn't taste quite the same\nnor as authentic. In order to quench our cravings, we even tried going to Taco\nBell, which has a new item called the Paneer Tikka Masala Burrito! Unfortunately\nthe menu had been too Indianized and no longer tasted Mexican. While this style\nof Taco Bell is very popular with people in India, it doesn't quite measure up\nto the Taco Bell we have in the US.\n\n\n\nOur best bet was to figure out how to make it our selves. Unfortunately we did\nrun into a few bumps along the road:\n\n 1. It is a lot harder to find iceberg lettuce in Bangalore than originally\n    suspected. Iceberg lettuce isn't really in any kind of Indian food therefore\n    only available at some special markets rather than on every street vegetable\n    cart.\n\n\n\n 2. Many people tend to substitute dahi for sour cream out of convenience,\n    however, this doesn't have quite the same taste. Conveniently, we found a\n    fairly easy recipe\n    [http://www.tarladalal.com/Sour-Cream-(--Wraps-and-Rolls)-32623r]  on how to\n    make our own homemade sour cream! Tarla Dalal [http://www.tarladalal.com] \n    to the rescue!\n\n\n\n 3. Making the refried beans for the tacos ended up being extremely time\n    consuming. If I had been in the US, I could have just bought a can of beans,\n    cooked them with some cumin and cayene pepper and been done with it. I\n    completely took for granted the preparation needed to make refried beans.\n    First you needed to soak and cook the beans until they were soft, and then\n    cook them in a pan with the appropriate seasoning. This took much longer\n    than I had originally expected.\n\n\n\nWe realized even making tortillas by hand wouldn't be so bad. Every morning, the\ncook at my grandparents house makes chapatis from scratch. Tortillas are\nesentially chapatis made from normal flour, not wheat. So my grandmother quickly\nwhipped up a huge ball of dough for us to roll out and make into tortillas.\n\n\n\n\n\nNo taco would be complete without salsa! We made 2 different types of salsa,\ncorn with jalapenos and pico de gallo salsa. Both salsas are extremely easy to\nmake. For the corn salsa, you just need to combine boiled sweet corn kernels,\ndiced jalapenos, lemon juice, salt, and some cilantro. Mix it together and\nviola! You have salsa. Similarly, if you mix diced tomatoes and onions, minced\ngarlic, cilantro, and lemon juice you get pico de gallo salsa. Both can be made\nvery quickly and are fresh and delicious!\n\n\n\n\nSurprisingly everything turned out really tasty and me and my cousin happily\nenjoyed delicious Mexican food for the next 2 days! :) My cousin loved it so\nmuch, she ate it for breakfast, lunch, AND dinner for the next 2 days. Mission\nSuccess!","feature_image":"https://farm8.staticflickr.com/7450/16401091685_d0ed039ea7_o.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c244","name":"tacos","slug":"tacos"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"}]}}]}},"pageContext":{"slug":"india","limit":6,"skip":0,"numPages":1,"currentPage":1}}