{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c372","uuid":"329792b8-9854-417e-a287-153b2af1d843","title":"Bhaaji Re Bhaaji Re Bhaaji RE!","slug":"bhaaji-re-bhaaji-re-bhaaji-re","published_at":"03 March, 2016","plaintext":"\n\nSo just to make up for my epic fail(s) these past weeks, I'm giving you 2 songs\nto listen to during this post!! (And to console an angry friend of mine :) I\nlove you!)\n\nLast month was the Super Bowl. Probably one of the MOST hyped up events in the\nUnited States. Usually, I'm not affected by much of this hype. There have even\nbeen years where I've forgotten to watch the Super Bowl altogether. I know. HOW\nCOULD I? How very un-American of me. But nonetheless, if my team wasn't playing\nI was generally not too interested.\n\nThis year was different. I've been in a Super Bowl city before; Detroit hosting\nin 2006. I probably lived about the same distance from all the events then than\nI did this time around, but this time was different. Super Bowl 50 was hosted by\nthe city of San Francisco this year. Hilariously enough, the ACTUAL stadium that\nthe teams were going to play at was a good 50 miles away from San Francisco. So\nTECHNICALLY the Super Bowl was hosted by the city of Santa Clara, but how many\npeople actually know where that is?\n\nExactly.\n\nSo all the official hubbub leading up to the Super Bowl was held in downtown San\nFrancisco. They set up this huge thing called \"Super Bowl City\" with various\nevents starting a little more than a week before the actual big game. They had\nEVERYTHING; the puppy bowl, player signings, concerts (including the amazing\nAlicia Keys). San Francisco really pulled out all the stops for the event.\n\nI live in Sunnyvale right now. It's a little suburb town about 45 miles from\ndowntown San Francisco. Usually, no issue. It's a quiet little area with lots of\nfamilies and anything and everything Indian you could ever want. I'm really not\nkidding about that. There's a Indian grocery or jewelry or clothing or something\nstore in each and every strip mall complex (I think that's what they're called\nanyways...) I legitimately give people directions to my house by telling them to\ngo to Madras Cafe (one of the most popular dosa places in all of the Bay Area)\nand then turn onto my street instead of going into that restaurant. Ultimately\nit means that I'm dragged to that restaurant more than I'd ever like, me being\nsomeone who dislikes dosa (go on...hate on me all you want I am that South\nIndian that doesn't like dosa).\n\nAnyways... why is this important you may ask? Sunnyvale just HAPPENS to be\napproximately a 10 minute drive from the new and shiny Levi's Stadium in Santa\nClara. The very stadium that happened to be hosting the Super Bowl last weekend.\nI know, lucky me! I get to go see all these tailgates and do all these cool\nfootball related things. Don't get me wrong... I LOVE football but it made me\nvery bitter all weekend. In case you forgot, all the cool and fun events that\nwere happening for the Super Bowl were happening in downtown San Francisco. So\nno cool pre-Super Bowl events for me. You'd think that AT LEAST I'd get to do\nsome fun things the day of.... NOPE you thought wrong. Apparently you either\nneeded to have specific connections/be a season ticket holder OR you needed to\ncough up some serious money to participate in all of these tailgating events.\nLevi's Stadium also has a strict no-tailgating policy for their parking lots, so\nI didn't get to attend anything. Clearly I'm not bitter at all about this.\n\nAnyway, my Super Bowl plans consisted of making an large amount of Pav Bhaaji\nand watching the game with my friend whilst we stuffed our faces. I was going to\nadd a little bit of a rant about the Coldplay halftime show but that's for\nanother time. I may not be a complete fan of Coldplay's Hymn for the Weekend\nmusic video but I do love the song...so I was very disappointed that they cut it\nfrom the Super Bowl halftime performance.\n\nRegardless, we had pav bhaaji to console us over Chris Martin being the left\nshark of this year's Super Bowl. Pav Bhaji is a wonderful, buttery delicacy from\nthe streets of Mumbai. I'm thoroughly convinced that pav bhaaji tastes better\nwhen you get it from grungier and shadier places, aka a variety of street\nvendors. What street food doesn't taste better, when it's made and served to you\nfrom a giant stove in the middle of some market?!\n\n\n\nI did have a slight mishap in making the pav bhaaji. I was so concentrated on\ncombining a few different recipes into one that I absent-mindedly added\nbisibelebaath masala instead of pav bhaaji masala. While I do love me some\nbisibelebaath... the masala doesn't quite give you the taste you're looking for\nin pav bhaaji. So there I was, watching my disaster simmer and cook on my stove\nwhile the clock ticked down to the start of the game. Then I realized that I may\nhave some the ingredients in my spice rack to make my own make-shift pav bhaaji\nmasala. Pav bhaaji masala is made by grinding cardamom, coriander seeds, cumin,\nfennel seeds, dry chilies, cinnamon sticks, cloves, and dry mango powder. I\nsomehow had most of these things, so I proceeded to add varied amounts of dry\nmango powder, cumin powder, ground cardamoms, and coriander seeds until it\ntasted close to pav bhaaji I like.\n\nNot in any way perfect, but not bad either! My friend being the sweetheart that\nhe is claimed that he loved it! I feel like he was just being a nice friend so I\nhighly recommend getting the pav bhaaji masala and using that instead of making\nyour own with w/e you have in your kitchen. It'll just taste better and closer\nto what you would have wanted to begin with.\n\n\n\nPav Bhaaji\nIngredients:\nGhee\n 1 bell pepper, chopped\n 1 cup water\n 4 roma tomatoes, chopped\n 4 medium potatoes, chopped\n 1 cup cauliflower florets\n 1 1/2 tsp ginger-garlic paste\n 1 onion, chopped\n 2 tbsp pav bhaaji masala\n 1 1/2 tbsp red chili powder\n 1 tsp garam masala powder\n 1 tsp turmeric\n 1 tbsp kasuri methi (dried fenugreek) powder\n lime wedges for garnish\n some chopped onion for garnish\n salt according to taste\n pav buns (plain slider buns can also work)\n Directions:\nIn your pressure cooker, cook the potatoes and cauliflower until soft and\ntender.\n\nAdd butter (or ghee :D) to a large pan. Once it's heated, add the chopped bell\npepper to it. Once that has softened, add a little water and mash.\n\nStir in the tomatoes and boiled vegetables and cook for 2-3 minutes. Add\nginger-garlic paste and sauté for 2 minutes. Once the tomatoes have cooked, mash\neverything with a masher (or anything close to that).\n\nIn a separate pan, sauté chopped onion in ghee until it becomes a pale brown\ncolor. Add all the spices and salt and sauté for a few more minutes. Add some\nmore water if it starts getting dry.\n\nAdd the onion mixture to the bhaaji and mix. Add water until it reaches the\ndesirable consistency. Similarly with the spices and lime juice. Toast some pav\nbuns and enjoy!","feature_image":"https://pramods.box.com/shared/static/f7wa8q2kf71bf86gecd2viybgn70o510.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"},{"id":"5c47a6f22037ef002282c2e9","name":"super bowl","slug":"super-bowl"},{"id":"5c47a6f22037ef002282c2ea","name":"salman khan","slug":"salman-khan"},{"id":"5c47a6f22037ef002282c2eb","name":"bollywood","slug":"bollywood"},{"id":"5c47a6f22037ef002282c2ec","name":"pav bhaaji","slug":"pav-bhaaji"},{"id":"5c47a6f22037ef002282c2ed","name":"cravings","slug":"cravings"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c340","uuid":"279e49d2-aba1-4211-82c1-089cbd2da209","title":"Gaadi Chaats","slug":"bread","published_at":"08 February, 2016","plaintext":"Welcome to another trip to India! When I was there, I ate a ton of food. All of\nmy family members were happy to feed me, and between the amazing home cooking,\nand the delicious food available on every street corner, it's almost a miracle\nthat I didn't pack on pounds.\n\nI am, generally, pretty picky about my food. I waver between being vegan and\nvegetarian, and I'm usually pretty careful about ingredients I allow in my\nkitchen. But, like everyone else, I have a fatal flaw and it's this; I love\nstreet food.\n\nI know that someone involved didn't wash their hands, I know that the\ningredients aren't always top notch, I know that the fat, salt, and sugar\ncontent is probably WAY higher than anything I should be consuming. But I don't\nparticularly care.\n\nIn India a \"gaadi\" is a vehicle, and \"chaat\" is street food that has fresh\nvegetable, puffed rice, sweet and spicy sauces, and some fried components. So\n\"gaadi chaat\" is street food you get out of a flat bed cart.\n\nIn Bangalore, there's a street people refer to as \"chaat street,\" and the street\nis lined with street food vendors. One end has a bakery, and the other end (the\nend I like to start on) has a few fruit carts, and one \"corn\" cart. I usually\nget my corn spiced with salt and chili, and mixed with raw, unripe mangoes\n(delicious!)\n\n\n\nThen it's time for Masala Chaat! This is one of my absolute favorites; it\nfeatures a thick, spicy lentil soup layered atop crispy, crackly puris (indian\n\"chips\" and under sweet and spicy chutney, some fresh onion and cilantro, and a\nsprinkle of \"chaat masala.\"\n\n\n\nIt's The Chaat Shop!\n\nNext up: Gobi Manchurian. Cauliflower dipped in dough and deep fried, then\ndredged in fresh onion and cilantro, and delicious, spicy, tomato-ey garlic-y\nsauces.\n\n\n\nThis is the Gobi Manchurian man! He also makes noodles. He is obviously\nsupremely talented.\n\nNow that you're ALMOST too full (because you've eaten your way down the street)\nit's time for dessert! There's a bakery you can step into, vendors with all\nkinds of sweets and shaved ice, and (my personal favorite) Mango Kulfi!\n\n\n\nGo to bed. It's been a long day, and you're long overdue for a satisfying food\ncoma.","feature_image":"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg","tags":[{"id":"5c47a6f22037ef002282c2d5","name":"chaat","slug":"chaat"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"}]}}]}},"pageContext":{"slug":"street-food","limit":6,"skip":0,"numPages":1,"currentPage":1}}