{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c360","uuid":"bd3e7708-eadc-4969-886c-47fdd2138304","title":"How to do a food crawl","slug":"food-crawl","published_at":"25 April, 2016","html":"<p>I'm sure most of y'all have been on a bar crawl - you have a list of bars, and you hit them up one after the other, sipping a little of this and a little of that at each one.</p>\n<p>This is similar, but with FOOD. While you are certainly welcome bring booze into the mix, these are instructions for figuring out an all food crawl; it's an excellent way to explore a new city!</p>\n<p>It's also a really good way to spend a couple of hours with friends without spending a ton of money; if you're on a budget, this is a great way to try lots of different food, and see quite a bit, without breaking the bank. We each paid for one entree at one place, and it came out perfectly for us!</p>\n<p>First, you need a walkable city. I myself did this with my friends Eden and Hafsa in San Francisco, the day I last left Sumu.</p>\n<p><img src=\"https://pramods.box.com/shared/static/nswhwh2moi2lyt9ett886237vfike5xh.jpg\" alt=\"\"></p>\n<p>Second, do some preliminary research. Don't actually choose all the places you want to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff you're interested in exploring. We found ourselves wandering around the Mission District, ogling wall art and talking about gentrification.</p>\n<p>Third, set off on your journey! Start with a place you know you want to go to; we started with Philz Coffee, which also let us sip and wander for a bit before we found real food.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg\" alt=\"\"></p>\n<p>Over the course of the next several hours, we tried Thai food, Mexican food, Vietnamese food, and, finally, Ethiopian food. At each place, we would choose one entree to share, so that in the end, we all got to try tons of yummy food for relatively little!</p>\n<p>We were having so much fun we failed to take a lot of pictures, but this is definitely one of those days that I'll be remembering for quite a while! If you do a food crawl, let me know how it goes!</p>\n<p>And, if you're in DC or San Francisco and you're interested in doing this, hit Sumu or I up! We'd love to have you :)</p>\n","feature_image":"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c250","name":"thai","slug":"thai"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c31b","name":"betterlate","slug":"betterlate"},{"id":"5c47a6f22037ef002282c31c","name":"than never","slug":"than-never"},{"id":"5c47a6f22037ef002282c31d","name":"monday","slug":"monday"},{"id":"5c47a6f22037ef002282c31e","name":"food crawl","slug":"food-crawl"},{"id":"5c47a6f22037ef002282c31f","name":"ethiopian","slug":"ethiopian"},{"id":"5c47a6f22037ef002282c320","name":"mission","slug":"mission"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c378","uuid":"4f6c5f80-e95b-43b4-882b-0df100605e8e","title":"New City, New Beginnings","slug":"new-city-new-beginnings","published_at":"14 April, 2016","html":"<iframe src=\"https://embed.spotify.com/?uri=spotify:track:0MgfdN0hWlNeQCSLqjfn6C\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>So things have been a bit crazy for me over the last few weeks. I made my first solo move as an adult. I packed up my apartment in Sunnyvale and <em>finally</em> moved to San Francisco. If you're wondering why I picked this specific Van Morrison song, I felt like it was meant to be. The song Saint Dominic's Preview has a lot of references to the Saint Dominic's Church on the intersection of Bush and Steiner in San Francisco, literally a block from my new apartment. Everyday when I walk back from the bus stop after work, I pass by this gorgeous church and admire it. It just felt right to pick this song for the post. :)</p>\n<p>However, if that song isn't your speed and you want something a little more sultry, try this one by Carmen McRae.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:4jsrzfNVVFAtNtMPVpFdwo\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>I've had a blast since moving out here. I get to see my friends almost every day. I have a wonderful new roommate who I've known since college. Even after only a week, I've got to attend all sorts of weird and yet awesome things! This was an art exhibit that was installed right outside City Hall over this past week.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ssreqfxw68u26d0ezcxhj7m41o5rtp8x.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/dzi45k6s5vrfkhd5s4tymemg446eu46v.jpg\" alt=\"\"></p>\n<p>And best of all, I get to cook with my friends, both old and new! I went over to a friend's place yesterday night and me and a new friend, Kerry, began to make some DELICIOUS fresh spring rolls. Granted, the recipe for this has been posted on this site before, the food could never have been more delicious and different. We filled these with lettuce, shrimp, vermicelli noodles, and more! We even made some peanut sauce to dip the rolls in (just mix some hoisin sauce and creamy peanut butter together). Simple, yet delicious!</p>\n<p>We did have some mishaps during the process. San Francisco kitchens are usually TINY, as are a lot of the apartments. My friend's kitchen is very much sizable for 1 person cooking. When you try to squeeze 4 people in there, chaos ensues.</p>\n<ol>\n<li>We were lied to about the presence of peanut butter, hence sending the boys on one trip to the store</li>\n<li>Kerry and I weren't aware that the pasta strainer LOCKED onto the pot we were cooking the noodles in. This unfortunately caused ALL of the noodles to fall into the sink, hence a second trip to the store to get more noodles</li>\n<li>The boys may never let us live this down. Highly unlikely after all the sass given while Kerry and I made their dinner.</li>\n<li>They showed me this <a href=\"https://www.youtube.com/watch?v=3Y7Vq9749s8\">amazing group that performs acoustic covers of popular songs</a>... MIND BLOWING. I'm not gonna lie I may have teared up a bit.</li>\n</ol>\n<p>While I may not have an explicit recipe for you, I have plenty of photos and full stomachs as proof. Enjoy!</p>\n<p><img src=\"https://pramods.box.com/shared/static/o2nfryr3uy3wo1af3au1fqj06g6hsnqt.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/88lgsulz4dmss371kbnei54af3yaazqq.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/j1aa87dqcpkscn4u9iwph6xbgrqzrhrm.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c30e","name":"spring rolls","slug":"spring-rolls"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c30f","name":"fresh rolls","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c317","name":"shrimp","slug":"shrimp"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c371","uuid":"c29b2ef2-5742-41db-8c7d-ee40d863ac36","title":"California Gurrrrllllll","slug":"california-gurrrrllllll","published_at":"29 February, 2016","html":"<p>Spring break baby! As of Friday, I am SORT OF on spring break. While I have an assignment due tomorrow that I am still working on, I've been in California visiting Sumu since Friday!</p>\n<p>While I've buckled down a bit today, Sumu and I spent all of yesterday and this morning running around San Francisco and nearby beaches.</p>\n<p>The soundtrack to our trip?</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/vWaRiD5ym74\"></iframe>\n</div>\n<p>We started off our day at Land's End Recreation Area, which was hands down my favorite part of the trip so far. We parked, and it was about a mile walk to the beach. The entire area was insanely picturesque, and I was half convinced that we had stepped out of San Francisco and into a Lord of the Rings movie.</p>\n<p><img src=\"https://pramods.box.com/shared/static/x2uo0tras4nbnknlrtbrmqs3jrq69hz0.jpg\" alt=\"\"></p>\n<p>From there, we went to get brunch, before heading to Valencia St. to look at street art, before heading to Dolores Park. On the way, we passed the The Women's Building, which has one of the coolest murals I've ever seen on it - if you find yourself in SF, definitely head over there. It's a celebration of women, and it's totally gorgeous.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ov0xg36h85u5eqaz30mfp3ilsw60dxeq.jpeg\" alt=\"\"></p>\n<p>After that, we went to Dolores Park and visited the Golden Gate Bridge at sunset!</p>\n<p>Today, we woke up bright and early and headed to Capitola and Natural Bridges State Beach. We wandered around the beach for a while before getting ourselves to our favorite meal: brunch.</p>\n<p><img src=\"https://pramods.box.com/shared/static/25ppba8otn16vj1tw7nr0naf1xjmglm5.jpg\" alt=\"\"></p>\n<p>This place was pretty small, but really cute, and had excellent brunch options. I ordered Gallo Pinto, which was described on the menu as a Costa Rican dish.</p>\n<p><img src=\"https://pramods.box.com/shared/static/hinrb93xbood40avb37ozvuldf5qqbtg.jpg\" alt=\"\"></p>\n<p>I liked my dish a lot; the plantains, rice, egg, and sauce went really well together, and I found myself clearing my plate!</p>\n<p>Sumu got the Veggie Cocota, with was veggies and poached eggs covered in a Cocota sauce. Research indicates that Cocota is a neighborhood in Brasil, although I can't speak to the authenticity of the sauce. Either way, it was pretty good; the sauce is quite strong, and while I thought it was delicious, it was a bit much for brunch.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z6r4ajucixwzwnh3bv2t9bxe5auaf6rg.jpeg\" alt=\"\"></p>\n<p>Either way, definitely worth a visit. If you're in Santa Cruz, definitely head over; they also have fresh juice that's perfect for taking with you to the beach!</p>\n","feature_image":"https://pramods.box.com/shared/static/hinrb93xbood40avb37ozvuldf5qqbtg.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c26c","name":"california","slug":"california"},{"id":"5c47a6f22037ef002282c2f1","name":"besties","slug":"besties"},{"id":"5c47a6f22037ef002282c2f2","name":"visits","slug":"visits"},{"id":"5c47a6f22037ef002282c2f3","name":"spring break","slug":"spring-break"},{"id":"5c47a6f22037ef002282c2f4","name":"santa cruz","slug":"santa-cruz"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c2f6","name":"land's end","slug":"lands-end"},{"id":"5c47a6f22037ef002282c2f8","name":"natural bridges","slug":"natural-bridges"},{"id":"5c47a6f22037ef002282c2f7","name":"the shire","slug":"the-shire"},{"id":"5c47a6f22037ef002282c2f9","name":"golden gate","slug":"golden-gate"},{"id":"5c47a6f22037ef002282c2fa","name":"the women's center","slug":"the-womens-center"},{"id":"5c47a6f22037ef002282c2fb","name":"cafe brasil","slug":"cafe-brasil"}]}}]}},"pageContext":{"slug":"san-francisco","limit":6,"skip":0,"numPages":1,"currentPage":1}}