{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"New City, New Beginnings","slug":"new-city-new-beginnings","feature_image":"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg","published_at":"14 April, 2016","html":"<iframe src=\"https://embed.spotify.com/?uri=spotify:track:0MgfdN0hWlNeQCSLqjfn6C\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>So things have been a bit crazy for me over the last few weeks. I made my first solo move as an adult. I packed up my apartment in Sunnyvale and <em>finally</em> moved to San Francisco. If you're wondering why I picked this specific Van Morrison song, I felt like it was meant to be. The song Saint Dominic's Preview has a lot of references to the Saint Dominic's Church on the intersection of Bush and Steiner in San Francisco, literally a block from my new apartment. Everyday when I walk back from the bus stop after work, I pass by this gorgeous church and admire it. It just felt right to pick this song for the post. :)</p>\n<p>However, if that song isn't your speed and you want something a little more sultry, try this one by Carmen McRae.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:4jsrzfNVVFAtNtMPVpFdwo\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>I've had a blast since moving out here. I get to see my friends almost every day. I have a wonderful new roommate who I've known since college. Even after only a week, I've got to attend all sorts of weird and yet awesome things! This was an art exhibit that was installed right outside City Hall over this past week.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ssreqfxw68u26d0ezcxhj7m41o5rtp8x.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/dzi45k6s5vrfkhd5s4tymemg446eu46v.jpg\" alt=\"\"></p>\n<p>And best of all, I get to cook with my friends, both old and new! I went over to a friend's place yesterday night and me and a new friend, Kerry, began to make some DELICIOUS fresh spring rolls. Granted, the recipe for this has been posted on this site before, the food could never have been more delicious and different. We filled these with lettuce, shrimp, vermicelli noodles, and more! We even made some peanut sauce to dip the rolls in (just mix some hoisin sauce and creamy peanut butter together). Simple, yet delicious!</p>\n<p>We did have some mishaps during the process. San Francisco kitchens are usually TINY, as are a lot of the apartments. My friend's kitchen is very much sizable for 1 person cooking. When you try to squeeze 4 people in there, chaos ensues.</p>\n<ol>\n<li>We were lied to about the presence of peanut butter, hence sending the boys on one trip to the store</li>\n<li>Kerry and I weren't aware that the pasta strainer LOCKED onto the pot we were cooking the noodles in. This unfortunately caused ALL of the noodles to fall into the sink, hence a second trip to the store to get more noodles</li>\n<li>The boys may never let us live this down. Highly unlikely after all the sass given while Kerry and I made their dinner.</li>\n<li>They showed me this <a href=\"https://www.youtube.com/watch?v=3Y7Vq9749s8\">amazing group that performs acoustic covers of popular songs</a>... MIND BLOWING. I'm not gonna lie I may have teared up a bit.</li>\n</ol>\n<p>While I may not have an explicit recipe for you, I have plenty of photos and full stomachs as proof. Enjoy!</p>\n<p><img src=\"https://pramods.box.com/shared/static/o2nfryr3uy3wo1af3au1fqj06g6hsnqt.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/88lgsulz4dmss371kbnei54af3yaazqq.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/j1aa87dqcpkscn4u9iwph6xbgrqzrhrm.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg\" alt=\"\"></p>\n","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c30e","name":"spring rolls","slug":"spring-rolls"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c30f","name":"fresh rolls","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c317","name":"shrimp","slug":"shrimp"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"}]}},"pageContext":{"slug":"new-city-new-beginnings","previous":{"html":"<p>So I haven't been cooking much lately, but I have been reading a ton of recipes for when I get my life back post-finals! So, I'm starting a new feature! The &quot;Quick Recipe Fix&quot; - your dose of some of my favorite recipes that I've found on the interwebs.</p>\n<p><img src=\"https://pramods.box.com/shared/static/e1ww9g1kidb63ndvuqe4zzlsqv8mjane.jpg\" alt=\"\"></p>\n<p>Enjoy the recipes, and cut me some slack, internet. I've been busy :)</p>\n<p>1.) Love and Lemons is one of my favorite food blogs; they have gorgeous pictures, and I love their fresh approach to food. They have a cookbook out right now that everyone should totally get. I'm also waiting for the day when I can try this recipe for <a href=\"http://www.loveandlemons.com/chickpea-flour-pizza-asparagus/?utm_source=feedly&amp;utm_medium=webfeeds\">Chickpea Flour Pizza Crust</a> because YUM.</p>\n<p>2.) Minimalist Baker hits it out of the park every time. They have a real talent for finding fresh, simple recipes with easy (and short!) cleanup! Check out their recipe for <a href=\"http://minimalistbaker.com/gingery-thai-kale-salad-cashew-dressing/\">Gingery Thai Kale Salad with Cashew Dressing</a></p>\n<p>3.) I love Annie's Eats, especially her cocktail posts! Now that summer's coming, it's time to turn out minds to summertime cocktails, and there's something about this <a href=\"http://www.annies-eats.com/2016/03/25/gin-grapefruit-and-rosemary-cocktail/\">Gin, Grapefruit, and Rosemary Cocktail</a> that feels delightfully spring-y.</p>\n<p>4.) Smitten Kitten is incredibly prolific; they do an amazing job of posting super frequently with high quality recipes! Here's one of there's that I'm pretty sure is an Italian sort of Shakshouka <a href=\"http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/\">Eggs in Purgatory, Puttanesca-Style</a>.</p>\n<p>5.) The Beeroness is one of my favorite people on the internet. All of her recipes are accompanied by great stories about her life, and the food itself is nothing to sneeze at. If you're a beer lover OR a food lover, you'll love her blog; right now, I really want to try her <a href=\"http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/\">Grilled Garlic-Beer Flatbread</a>.</p>\n<p>Enjoy the recipes, and if you get a chance to try them before I do (super likely) let me know how it goes!</p>\n","title":"A Quick Recipe Fix (Numero Uno)","slug":"recipes","published_at":"11 April, 2016","feature_image":"https://pramods.box.com/shared/static/75ycreg8gpwyyvfdmpmdtiomxiop1sg4.jpg","tags":[{"id":"5c47a6f22037ef002282c26b","slug":"food-truck"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c242","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c2c6","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c314","slug":"loving-lately"},{"id":"5c47a6f22037ef002282c315","slug":"favorite-blogs"},{"id":"5c47a6f22037ef002282c316","slug":"yum"}]},"next":{"html":"<p>My brain feels scrambled. I've thrown all sorts of information in there and given it a good shake, and things are tumbling about pretty wildly right now.</p>\n<p>Exam season is upon me, and I am not bearing up well under the stress. Just don't ask me how many hot Cheetos I've consumed, because that could get super embarrassing super fast. My food consumption these days in 50% leftovers, 30% eggs, 10% random free food, and 10% cheese, so you could say things are a bit mad right now.</p>\n<p>I'm so excited to finish the semester and start cooking again. In the meantime though, I want to leave this recipe I made a bit ago here.</p>\n<p><img src=\"https://pramods.box.com/shared/static/tj5saknljx5vewphutanvgu2he6w75gg.jpg\" alt=\"\"></p>\n<p>I'd never made tofu scramble before, so there was quite a bit of googling involved. In the end, I came up with a recipe that hit all the right spots, and was healthy to boot! I would recommend this for anyone who enjoys savory breakfast, even the pledged carnivores; this tofu is delicious!</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Tofu Scramble</h2>\n    <div class=\"summary\">\n      <p><em>There are two keys to making this a good recipe: (1) extremely firm tofu - the firmest you can locate at the store, and (2) marinate it over night.</em></p>\n      <p>Yield: 2 servings</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">30 minutes</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Marinade</h4>\n          <li class=\"ingredient\">2 Tbsp Soy Sauce</li>\n          <li class=\"ingredient\">2 Tbsp C Vinegar</li>\n<li class=\"ingredient\">4 Tbsp Nutritional Year</li>\n<li class=\"ingredient\">1 Tsp Garlic Powder</li>\n<li class=\"ingredient\">1 Tsp Onion Powder</li>\n        <h4>Scramble</h4>\n          <li class=\"ingredient\">1 Package Extremely Firm Tofu</li>\n          <li class=\"ingredient\">Handful of Broccoli</li>\n<li class=\"ingredient\">Handful of Kale</li>\n<li class=\"ingredient\">5-6 Mushrooms</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n1.) Mix your marinade ingredients together, and add water if you need to so that it's not too thick. It should be roughly the consistency of gravy. \n</p><p> \n2.) Rip your tofu into bit sized chunks with forks or with your hands, and  mix the marinade into the tofu. Set the mixture in the fridge overnight. \n</p><p> \n3.) Chop your broccoli, kale, and mushrooms, and cook your veg - broccoli, then kale and mushrooms together. Be sure to add some salt and spices to the vegetables!\n</p><p> \n4.) When the vegetables are half cooked, create a space, and pour your tofu scramble in. Let it cook for a few minutes, 5-7 should be just enough. \n</p><p> \n5.) Pour into a bowl with some hashbrowns and enjoy! \n<pre><code>    &lt;/p&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n  </p></div>\n</div></div></div>","title":"Scrambled","slug":"scrambled-tofu","published_at":"18 April, 2016","feature_image":"https://pramods.box.com/shared/static/tj5saknljx5vewphutanvgu2he6w75gg.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c318","slug":"tofu"},{"id":"5c47a6f22037ef002282c23f","slug":"breakfast"},{"id":"5c47a6f22037ef002282c23d","slug":"brunch"},{"id":"5c47a6f22037ef002282c313","slug":"savory"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c319","slug":"scramble"},{"id":"5c47a6f22037ef002282c31a","slug":"noms"}]}}}