{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c351","uuid":"4080fb6c-a3b5-40a7-b378-db7d61633324","title":"Challenge Accepted","slug":"challenge-accepted","published_at":"02 January, 2016","plaintext":"Welcome to 2016!\n\n2015 was interesting year for us, and we want to make sure that in the future,\nthe blog reflects our lives a bit more. For example, I (Anu) spent half the year\nin India, but you guys never read about my adventures with street food, or my\nquest to find the best masala dosas in Bangalore. While Sumu kept you all a bit\nmore updated on her goings on, the fact is, we both want to do better.\n\nSo with that in mind, we're challenging ourselves to post once a week each in\n2016! You'll be getting a new post from Sumu on Wednesdays, and Anu on Sundays.\nWe'll be sharing bits of our lives and kitchens all year, and in the interest of\naccountability, we've decided to implement some penalties for failure to\ndeliver.\n\nOffense 1: Donate ten dollars to a slush fund that we will donate to a charity\nat the end of the year! Every other penalty on the list is also accompanied by\nthis, so there's potential for us to donate 80 at the end of the year.\n\nOffense 2: The innocent party gets to pick 1 song for you to listen to during\nyour entire commute.\n\nOffense 3: The innocent party gets to take a picture or pictures with puppies\nand send it to the offender, to show them what they're missing.\n\nOffense 4: The Chopped Challenge; the innocent party assigned the offending\nparty a random list of ingredients, from which they must produce and consume a\nmeal. The production of said meal must be videotaped for the innocent party's\nviewing pleasure.\n\nAny offenses over and above this will result in the offending party having to\ncomplete a dare that is entirely up to the whim of the innocent party. So that's\npretty terrifying. All posts will also include the tag #challenge2016 so you can\nalso check up on us.\n\nMay the force be with you\n\nWe hope you're as excited as we are :)\nSumu and Anu\n\n\n\nNOTE: I (Sumu) have done a complete redesign of the blog so please email me @ \nsumu@cookinginpjs.com  if you've got any thoughts/bugs/general comments about it\nso I can address them ASAP! Thanks and Enjoy!","feature_image":"https://lh3.googleusercontent.com/M5419MoPiaFyC2XgHnxDAf99IksEcWU37d40IalYRH94Wapcd6ciC14x2WQLvG03lWYoQX_Uwb6jGUURtVJH7Lq9o6r0Gn5B0_bFEu9-1SLwIQo-bZ50ANJg31mW77lmKy0-6aMCt0ubf3MQfGa_X938ufNZNJd3pFDH8T3fSlcD6pHIQb-7791O7iWzpBE5E94gD-4Ggcpto1Jb2OxgfFI7TzHTBd10Jc2GQp_txHOOwYIEuXNkKf-owKXQmNTcNdOvjPFLJBSbvC1cQNXsevRNex5LpSy20-DBbbymh9NdKsQH95Px46UqyIOA-3TdMn6ALT5GX0YtkNbygrUhYvQszcMFR0QEXkxmo-IFNOdb-_E3ZYZnbhUseSV_oaeppP-eWH-lwIAp0KrpDfW1UwGbyd6NteW9_HlD9Q_ECqOz5HquabMPJv0jkaAz4r5FNcvoH2PcmPxWW_cKpS7c2HqjQVrssItea_fqbjnvHAXD35dAFnPZkZbHNz2lJXUNgyh4UxSCcKWLYHsZC7s14T66vX5pY96VTd1-ZpyNkcillReAM8FhbQ-qaxad5hXXbU86bw=w353-h546-no","tags":[{"id":"5c47a6f22037ef002282c2a5","name":"new years","slug":"new-years"},{"id":"5c47a6f22037ef002282c2a6","name":"challenge2016","slug":"challenge2016"},{"id":"5c47a6f22037ef002282c2a7","name":"redesign","slug":"redesign"}]}}]}},"pageContext":{"slug":"new-years","limit":6,"skip":0,"numPages":1,"currentPage":1}}