{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34c","uuid":"9b20a1b5-7251-4618-856c-afaa843490da","title":"Is \"butter\" a carb?","url":"https://cookinginpjs.herokuapp.com/is-butter-a-carb/","published_at":"17 November, 2014","html":"<p> Sumu and I have been rescheduling taco day for weeks. We had a grand plan to make eight different kinds of tacos, with a wild assortment of toppings, for all the people we knew. We invited friends, looked up taco recipes with abandon, and prepared our stomachs by eating as much avocado as possible. Then gradually, all our friends realized they had lives, and we had contemplated the plan for so long that it no longer seemed appealing. In the manner of gifts that you were supposed to “grow into,” something that seemed so exciting when we first considered it lost all appeal with lengthy consideration. </p>\n<p> Suddenly, taco day was a chore, something we needed to do – and if you ask either of our mothers, they will tell you that we rarely do those things. </p>  \n<p> So we shoved the plan to the back of the closet, along with “The Scarlet Letter” (which I received when I was only nine) and other childhood detritus. We adopted a new plan: lettuce wraps. Lettuce wraps, we reasoned, are healthier than traditional tacos – there are fewer carbs, or grains, or something that we know we’re supposed to avoid eating in excess. </p> \n<p><img src=\"https://farm9.staticflickr.com/8545/15649695779_61aac68719_b.jpg\" alt=\"\"></p>\n<p> We made Asian style lettuce wraps with egg fried noodles, vegetables cooked in soy sauce, and thai-inspired peanut sauce. </p> \n<p> To make the noodles, just make regular noodles according to the package instructions. Drain them, rinse them slightly in cold water, then cooking them in sesame oil on the stove until they’re hot all the way through. Crack eggs right on to noodles and stir until fully cooked, and voila! </p>  \n<p> For the vegetables, just toss them in soy sauce, a little rice vinegar, and salt and pepper, and then stir fry them until they’re ready. </p>\n<p> And for the peanut sauce, mix a half cup of creamy peanut butter with a tablespoon of rice vinegar, and about a half cup of soy sauce in a bowl. Then, in a pan, put about two tablespoons of sesame oil. Cook about a half cup of diced onions until fragrant and translucent, and add chili flakes to your taste. Once your chili flakes are fully incorporated, add your mixture of peanut butter, soy sauce, and vinegar and cook until heated through. </p>\n<p> We made Mexican style lettuce wraps with homemade salsa, sweet potatoes diced and pan roasted with taco seasonings, and mushrooms. </p>  \n<p> For this recipe, you can pretty much make any sort of salsa you like – feel free to experiment! For the sweet potatoes, just dice and cook in a pan until slightly crispy, and add taco seasoning like there’s no tomorrow. Trust us; you cannot have enough taco seasoning. </p>   \n<p><img src=\"https://farm6.staticflickr.com/5611/15811854346_887e2574e5_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7524/15215525994_155fdec421_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8638/15650656340_36a8b87812_b.jpg\" alt=\"\"></p>\n<p> Once we were done cooking, we set all our toppings out alongside the washed and dried lettuce leaves, and sat right down on the floor and stuffed our faces. </p>\n<p> It. Was. Awesome. </p>\n","feature_image":"https://farm9.staticflickr.com/8545/15649695779_61aac68719_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c237","name":"lettuce wraps","slug":"lettuce-wraps"}]}}]}},"pageContext":{"slug":"lettuce-wraps","limit":6,"skip":0,"numPages":1,"currentPage":1}}