{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c380","uuid":"b112724c-4311-432f-81e6-540c215fce32","title":"Ba-na-na Ba-na-nana Po-ta-tooo Po-ta-to-naaaa","slug":"ba-na-na-ba-na-nana-po-ta-tooo-po-ta-to-naaaa","published_at":"05 May, 2016","plaintext":"K this second post for the week took a bit longer than expected but I finally\nperfected the pictures so we're good now. YAY Post #2 for the week! And that\ntoo, to celebrate one of the nerdiest holidays out there! STAR WARS DAY!\n\n\n\nAll the wonderful puns.\n\nAlso because this recipe is banana filled, I HAD the little song by the Minions\nfrom Despicable Me stuck in my head. So I figured I should share that\nadorableness and mental torture with you guys.\n\nAnyways... after being home sick for an entire week in what I consider my\npersonal version of solitary confinement, I hit a new level of insanity. I was\ndeprived of social interaction to such a point that I legit LOL'd at a Buzzfeed\narticle of ridiculous snapchats for a good 20 minutes. And by LOL'd I mean\ncurled over laughing so hard I could barely breathe. No Buzzfeed article is THAT\nfunny. I had such bad sinus pain that working on my computer for long periods of\ntime was pretty rough. So I decided rather than wallowing in my bed, I was going\nto make SOME productive use of my time... baking for you guys!\n\nI found this recipe on Pinterest a while back of Cream Cheese Filled Chocolate\nChip Banana Coffee Cake\n[http://www.carlsbadcravings.com/cream-cheese-stuffed-chocolate-chip-banana-coffee-cake-recipe/]\n. I do want to preface my recipe with this:\n\n 1. I didn't some of the ingredients so this is my altered version for lazy\n    bakers :)\n 2. I also don't have a bundt cake pan, so mine didn't come out as gorgeous\n    looking as this but there is one thing I CAN guarantee, which is that they\n    came out DELICIOUS. Probably one of my favorite desserts I've ever made,\n    next to Tiramisu and my mom's Mush Cake.\n 3. I didn't have brown sugar and didn't want to bother making a second grocery\n    store trip for that so I just didn't bother making the streusel topping that\n    was in the original recipe. I can only imagine how much more mind blowing it\n    would have been had I added the streusel, maybe you can make yours with it\n    and let me know!\n\n\n\nOver the last few weeks I've been trying to figure out where in my new apartment\nI can do my food photography to optimize the natural light coming from my\nwindows. In my old apartment it was extremely easy, I had giant sliding doors\nwhich brought in ALL the light and shown over pretty much my entire living room;\nand if that wasn't enough then I could go out onto my balcony and take the\nphotos there! It was perfect. This week I discovered that if I angle one of my\nside tables properly and place the dish inside it, the light reflects off the\nwalls of the table perfectly onto the the food and really brings out all the\ndetails in the food! I HAD FINALLY FIGURED IT OUT! Although this weird\npositioning did lead to some old people back pain for me because of the weird\npositions that I laid in on the floor to get these photos. Such is the pain for\nbeauty.\n\n\n\nI mean just look at it...\n\nThis is one recipe I would HIGHLY recommend you try, whether it be my\ninterpretation or the original recipe itself. It was delicious and my coworkers\nand friends LOVED it.\n\n\n\nChocolate Chip Banana Cheesecake Coffee Cake \nIf you don't have over-ripe bananas, then Carlsbad Cravings gave a great\nsuggestion of sticking them in the oven at 325 F degrees until they're dark on\nthe outside and soft to the touch.\n\nIngredients:\nBanana Coffee Cake\n2 1/4 cups all purpose flour\n 1 1/4 tsp baking powder\n 1 1/4 tsp baking soda\n 1 tsp salt\n 2 tsp cinnamon\n 1/2 cup butter, softened\n 1 1/2 cup sugar\n 2 large eggs\n 4 large bananas, over-ripe and mashed\n 1 tbsp vanilla extract\n 1 1/4 cups non-fat plain yogurt (or greek yogurt)\n 3/4 cup chocolate chips\n Cheesecake filling\n16 oz cream cheese, softened\n 1/2 cup reserved batter (from banana coffee cake above)\n 1/2 cup sugar\n 2 tsp vanilla extract\n Directions:\nPreheat oven to 350 degrees F and spray your pan with nonstick cooking spray and\nflour the inside of your pan.\n\nIn a medium bowl, whisk together flour, baking powder, baking soda, salt, and\ncinnamon. Set aside.\n\nUsing a hand mixer, beat the butter and sugar together until fluffy. Add the\neggs in one at a time and beat until blended. Mix in the vanilla and bananas\nuntil just combined.\n\nGradually add the dry ingredients to the wet ingredients, alternating with the\nyogurt. Beat until just combined. Measure out 1/2 cup of batter and keep aside\nfor the cheesecake filling. Stir in the chocolate chips into the remaining\nbatter and keep aside. Measure out about 1 cup of the batter with chocolate\nchips and keep aside to layer on top of the cheesecake filling. Pour the\nremaining batter into your pan.\n\nIn a separate bowl, mix together the 1/2 cup batter you set aside earlier with\nthe rest of the cheesecake filling ingredients on high speed until smooth and\ncreamy.\n\nSpread the cheesecake filling on top of the current layer batter in the pan.\nIt's okay if it sinks in a bit, this cake is much more moist than the original\nrecipe so the cheesecake layer is more variable in size. Pour the top layer of\nbatter on top of the cheesecake filling. If you made a streusel, now is the time\nto sprinkle it on top.\n\nBake for 55-60 minutes at 350 degrees F or until toothpick inserted comes out\nclean (ignoring the melted chocolate chips and any possible cream cheese that\nstill may not be solid). Let it cool and enjoy!\n\n\n\n\n\n![] (https://pramods.box.com/shared/static/opdcb8ciiq9ib1qbz8nfbz84gtjvanxz.jpg)","feature_image":"https://pramods.box.com/shared/static/l2l9lmho8q088kczuewl9ll8ec4uz2b8.jpg","tags":[{"id":"5c47a6f22037ef002282c291","name":"banana","slug":"banana"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c32b","name":"chocolate chips","slug":"chocolate-chips"},{"id":"5c47a6f22037ef002282c32c","name":"experiments","slug":"experiments"},{"id":"5c47a6f22037ef002282c32d","name":"minions","slug":"minions"},{"id":"5c47a6f22037ef002282c32e","name":"star wars","slug":"star-wars"},{"id":"5c47a6f22037ef002282c32f","name":"sick days","slug":"sick-days"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35e","uuid":"28e9fca4-1790-4afe-9663-c046b09f3043","title":"FoodChella","slug":"foodchella","published_at":"04 May, 2016","plaintext":"\n\nSo I was terribly sick last week whilst recovering from Coachella so I've\ndecided to treat you guys with not one but TWO whole posts! I know right?! So\nawesome. You can thank me later. AND to make things better... instead of sharing\njust a single song... I'm going to gift you with a whole playlist of my favorite\nsongs from Coachella!\n\nSo very typical of me, I didn't double check my flight timings when booking so I\nended up flying out to LAX a whole 10 hours before the rest of my group. I\ndecided to start the trip out right, eggs Benedict and a mimosa at the airport\nwith a side of Gilmore Girls.\n\n\n\nUsually 10 hours stranded at an airport is a bummer, but there are worse places\nto get stranded than LAX. It kind of ended up working out for me because I took\nmy camera and explored! I walked from Santa Monica Pier to Venice Beach and\nsoaked in the gorgeous SoCal sun.\n\nIn Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously,\nprobably the best I've ever had in my life.\n\n\n\nIn Venice Beach, I decided to have a lighter option and enjoyed some Burrata and\nBeets at Larry's Bar & Grill.\n\n\n\nThe most adventurous meal was at dinner with a friend at Wurstküche. We enjoyed\nsome cold beers and Rattlesnake Sausages. It honestly didn't taste much\ndifferent from other sausages and was actually pretty good but I can't say I'd\ncomfortably eat that again.\n\n\n\nThe weekend was filled with new musical obsessions, including Zhu & Flume\n(seriously check out that playlist ^), new friends, delicious eats, and lots and\nlots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the\nunfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon,\nSean Paul, and Nico&Vinz during Matoma's set.\n\n\n\n\n\nI came back home the following Monday sunburned (what happens when you wander\naround LA without sunscreen) and exhausted out of my mind; Cue sickness.\n\nThis was my first year attending Coachella, every instagrammer's and basic\nbitch's haven. Of course I had to have ONE basic picture myself to commemorate\nthe experience.\n\n\n\nCoachella is also a GREAT place for foodies. While you needed to be a VIP to get\naccess to some of the tastiest and more exclusive food, there was plenty of\ndelicious options to spare. Looking back at my food photos, I realize that I\nbasically survived off fries. Just fries. And obviously watermelon, because it\nIS Coachella. But these fries were no ordinary fries my friends. They were all\nloaded with various toppings and delicious goodness.\n\nVeggie Monster Fries with lots of types of slaw and jalapeños!\n\n\nVegetarian Poutin Fries with cheese curds!\n\n\nCrab Fries! This meant crab aioli AND crab topping! Double yum!\n\n\nChicharones Fries with Sriracha and curry aioli!\n\n\nI honestly have no idea how most of these things were made but my stomach was\nhella happy. :)","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","tags":[{"id":"5c47a6f22037ef002282c321","name":"coachella","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","name":"poutin","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","name":"crab","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","name":"chicharones","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","name":"music","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","name":"venice beach","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","name":"santa monica","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","name":"LA","slug":"la"},{"id":"5c47a6f22037ef002282c329","name":"rattlesnake","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","name":"burrata","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c353","uuid":"f5490185-fc56-4bcc-9410-b3869e6ebe60","title":"Orange Cream//Chocolate Cookies","slug":"orange-cream-chocolate-cookies","published_at":"02 May, 2016","plaintext":"There's something about the combination of chocolate and orange that just gets\nme every time. I love to make hot chocolate with just a few drops of orange in\nit, and I have been dying to make chocolate-y bread with bits of orange zest\nwoven through it.\n\n\n\nBut this weekend, I found myself with coconut flour and coconut cream, and\ndecided on chocolate cookies with a delicious, lightly orange-flavored cream.\n\nIf you want to get all hipster buzzwords about it, this recipe is: grain free,\nrefined sugar free, vegan.\n\nIf you just want to be totally super normal about it, this recipe is: delicious.\n\nGive it a try :)\n\nOrange Cream//Chocolate Cookies\nThis is a super simple and quick recipe. There is literally no reason not to\ngive it a try.\n\nYield: 26 1.5\" cookies\n\nTotal Time:  1 hour\n\nIngredients:\nChocolate Cookie\n3/4 C Coconut Flour\n 1/4 C Cacao Powder\n 1/4 C Coconut Oil\n 1/4 C Maple Syrup\n Soy milk as needed\n Orange Cream\n1 Can Chilled Coconut Cream\n 1/4 C Powdered SugarThree Drops Orange Oil\n Directions:\n\n1.) Mix together coconut flour and cacao powder in a bowl.\n\n\n\n\n2.) Put the coconut oil (solid; refrigerate if needed) into the flour mixture\nand cut it with a fork. You want it to be sort of crumbly and sandy when you're\ndone.\n\n\n\n\n3.) Pour the maple syrup (cold) into the mixture, and again, mix it in with a\nfork. This mixture will remain sort of sandy and crumbly.\n\n\n\n\n4.) Add soy milk a tablespoon at a time. Your dough will be a little crumbly,\nbut will stick together in one huge mass when you're done. It won't be elastic,\nbut it will stick together reasonably well.\n\n\n\n\n5.) Shape into 26 cookies and set on a greased baking sheet - these cookies\nwon't spread, so flatten them to the shape you want. Stick in the fridge, and\npreheat the oven to 350.\n\n\n\n\n6.) When the oven is ready, put your cookies in and set a timer for fifteen\nminutes. Mine took right around 18, so I would check them at fifteen, and let\nthem go till they're done!\n\n\n\n\n7.) While the cookies are baking, take out your coconut cream and flip it upside\ndown. Open it, and there should be some liquid there. Pour that into a cup (it's\ndelicious, and can be used in smoothies) and scoop out the cream into a separate\nbowl. Whip, then add the sugar and orange oil and whip some more.\n\n\n\n\n8.) Take a cookie, through a dollop of cream on there and dig in; delicious!","feature_image":null,"tags":[]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c360","uuid":"bd3e7708-eadc-4969-886c-47fdd2138304","title":"How to do a food crawl","slug":"food-crawl","published_at":"25 April, 2016","plaintext":"I'm sure most of y'all have been on a bar crawl - you have a list of bars, and\nyou hit them up one after the other, sipping a little of this and a little of\nthat at each one.\n\nThis is similar, but with FOOD. While you are certainly welcome bring booze into\nthe mix, these are instructions for figuring out an all food crawl; it's an\nexcellent way to explore a new city!\n\nIt's also a really good way to spend a couple of hours with friends without\nspending a ton of money; if you're on a budget, this is a great way to try lots\nof different food, and see quite a bit, without breaking the bank. We each paid\nfor one entree at one place, and it came out perfectly for us!\n\nFirst, you need a walkable city. I myself did this with my friends Eden and\nHafsa in San Francisco, the day I last left Sumu.\n\n\n\nSecond, do some preliminary research. Don't actually choose all the places you\nwant to go, but choose 1 or 2, or find a neighborhood that has a ton of stuff\nyou're interested in exploring. We found ourselves wandering around the Mission\nDistrict, ogling wall art and talking about gentrification.\n\nThird, set off on your journey! Start with a place you know you want to go to;\nwe started with Philz Coffee, which also let us sip and wander for a bit before\nwe found real food.\n\n\n\nOver the course of the next several hours, we tried Thai food, Mexican food,\nVietnamese food, and, finally, Ethiopian food. At each place, we would choose\none entree to share, so that in the end, we all got to try tons of yummy food\nfor relatively little!\n\nWe were having so much fun we failed to take a lot of pictures, but this is\ndefinitely one of those days that I'll be remembering for quite a while! If you\ndo a food crawl, let me know how it goes!\n\nAnd, if you're in DC or San Francisco and you're interested in doing this, hit\nSumu or I up! We'd love to have you :)","feature_image":"https://pramods.box.com/shared/static/ifb3j8uif6p154mugitpvrh06kyjpziu.jpeg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c235","name":"vietnamese","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c250","name":"thai","slug":"thai"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c31b","name":"betterlate","slug":"betterlate"},{"id":"5c47a6f22037ef002282c31c","name":"than never","slug":"than-never"},{"id":"5c47a6f22037ef002282c31d","name":"monday","slug":"monday"},{"id":"5c47a6f22037ef002282c31e","name":"food crawl","slug":"food-crawl"},{"id":"5c47a6f22037ef002282c31f","name":"ethiopian","slug":"ethiopian"},{"id":"5c47a6f22037ef002282c320","name":"mission","slug":"mission"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c348","uuid":"313c1a1d-1b55-4ba8-873a-3b11e1eccab7","title":"Teeny Weenie Itsy Bitsy Cinni Minis","slug":"teeny-weenie-itsy-bitsy-cinni-minis","published_at":"20 April, 2016","plaintext":"I know I know this week I'm kind of skimping out! I have been rushing to get my\nweek's work done by yesterday so that I can be ready to fully enjoy Coachella\nthis year! I am currently on my way there and unbelievably excited! I will\nreport back next week with all the food and excitement!\n\nI had made these Cinnamon buns a while back when I used to make treats for my\ncoworkers (unfortunately it's been some time since I've done that). I didn't\nreally experiment too much, more or less made the recipe verbatim. I found this\nrecipe for simple and quick whole wheat mini cinnamon buns\n[http://www.halfbakedharvest.com/whole-wheat-30-minute-mini-cinnamon-buns-and-they-are-healthy/]\n.\n\nMy chief complaint with this recipe is the fact that whole wheat gives it a\nwhole different and drier texture. Personally if I were to remake these, I'd\njust use normal flour and make smaller size cinnamon buns. They're tiny anyways\nso we can splurge on the flour ;)\n\nLet me know what you think!!","feature_image":"https://pramods.box.com/shared/static/wd6yuffsgpi30wby34ow9ew6hmzb2wom.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c29b","name":"cinnamon","slug":"cinnamon"},{"id":"5c47a6f22037ef002282c30f","name":"fresh rolls","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37f","uuid":"eaed4c13-ea2f-4325-9310-725d55d2c0ea","title":"Scrambled","slug":"scrambled-tofu","published_at":"18 April, 2016","plaintext":"My brain feels scrambled. I've thrown all sorts of information in there and\ngiven it a good shake, and things are tumbling about pretty wildly right now.\n\nExam season is upon me, and I am not bearing up well under the stress. Just\ndon't ask me how many hot Cheetos I've consumed, because that could get super\nembarrassing super fast. My food consumption these days in 50% leftovers, 30%\neggs, 10% random free food, and 10% cheese, so you could say things are a bit\nmad right now.\n\nI'm so excited to finish the semester and start cooking again. In the meantime\nthough, I want to leave this recipe I made a bit ago here.\n\n\n\nI'd never made tofu scramble before, so there was quite a bit of googling\ninvolved. In the end, I came up with a recipe that hit all the right spots, and\nwas healthy to boot! I would recommend this for anyone who enjoys savory\nbreakfast, even the pledged carnivores; this tofu is delicious!\n\nTofu Scramble\nThere are two keys to making this a good recipe: (1) extremely firm tofu - the\nfirmest you can locate at the store, and (2) marinate it over night.\n\nYield: 2 servings\n\nTotal Time:  30 minutes\n\nIngredients:\nMarinade\n2 Tbsp Soy Sauce\n 2 Tbsp C Vinegar4 Tbsp Nutritional Year1 Tsp Garlic Powder1 Tsp Onion Powder\n Scramble\n1 Package Extremely Firm Tofu\n Handful of BroccoliHandful of Kale5-6 Mushrooms\n Directions:\n\n1.) Mix your marinade ingredients together, and add water if you need to so that\nit's not too thick. It should be roughly the consistency of gravy.\n\n  \n2.) Rip your tofu into bit sized chunks with forks or with your hands, and mix\nthe marinade into the tofu. Set the mixture in the fridge overnight.\n\n  \n3.) Chop your broccoli, kale, and mushrooms, and cook your veg - broccoli, then\nkale and mushrooms together. Be sure to add some salt and spices to the\nvegetables!\n\n  \n4.) When the vegetables are half cooked, create a space, and pour your tofu\nscramble in. Let it cook for a few minutes, 5-7 should be just enough.\n\n  \n5.) Pour into a bowl with some hashbrowns and enjoy!    </p>\n  </div>\n</div>","feature_image":"https://pramods.box.com/shared/static/tj5saknljx5vewphutanvgu2he6w75gg.jpg","tags":[{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c23f","name":"breakfast","slug":"breakfast"},{"id":"5c47a6f22037ef002282c23d","name":"brunch","slug":"brunch"},{"id":"5c47a6f22037ef002282c313","name":"savory","slug":"savory"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c319","name":"scramble","slug":"scramble"},{"id":"5c47a6f22037ef002282c31a","name":"noms","slug":"noms"}]}}]}},"pageContext":{"limit":6,"skip":6,"numPages":10,"currentPage":2}}