{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c361","uuid":"90fcc5c1-73f9-4b23-a38e-697f92bdfb7e","title":"This Shit is Bananas, B-A-N-A-N-A-S","slug":"this-shit-is-bananas-b-a-n-a-n-a-s","published_at":"18 February, 2016","plaintext":"I konw this post can't come close to as sweet as the one Anagha wrote this week.\nBut I pinky promise, in addition to making up for last weeks missing post, I\nwill also make up for Valentine's day. I know, I know... lots of promises but\nyou don't mess with pinky promises!\n\nYou knew this song was coming... don't lie. Just relish in the throwback and\nketchup on some food blog reading ;)\n\nSince this past weekend was the SUPERBOWL I had this whole great plan on how I\nwas going to post about what I made to eat then. But of course my inner Dory\ncame out and I forgot to upload all the tantalizing pictures I took. A specific\nfriend of mine, cough cough Breane, had requested the recipe so I TOTALLY\napologize for my brain fart and promise I'll post it next week! But until then,\nyou'll have to bear with me and enjoy this post instead :).\n\nSo personally, I think my mom is the QUEEN of making banana bread. Like,\nseriously. Her banana bread the most glorious thing since, well, sliced bread\n(badum chhhhhhhhh). It's the perfect combination soft and moist and not too\nsweet. Of course, my banana bread can never live up to that standard but, hey, I\ncan try!\n\n\n\nOne thing I've learned about all of my mom's recipes is that her measurements\naren't always... Exact. She always shows me measurements using the length of her\nfingers. Problem is we have different sized hands AND how do you quantify that\nmeasurement so that you can replicate it? I've tried SO many times to get\nteaspoon measurements for everything but can't say I've been entirely\nsuccessful. This is the sole reason I haven't been able to make my food taste\nlike my mom's food.\n\nAnyways, a girl can try right? Now back to her mind-BLASTING banana bread.\n\n\n\nMany of my friends are aware that I don't particularly have a sweet tooth. I\nmean sure I get cravings on occasion, however, banana bread has always been one\nof my favorite things, mainly because it's just the right level of sweetness. It\nhas a strong taste of vanilla and of course banana! What could be better?!\n\nOnce when I was having said cravings, I really really wanted to eat my mom's\nbanana bread. So I decided to do my own take on her recipe, I know already going\ndownhill, by adding zucchini and carrot. You know, hiding a little bit of\nhealthy things in there to make you feel better about eating desserts.\n\n\n\nIt actually came out pretty good, not quite mom level, but still pretty amazing.\nI may have eaten an embarrassingly large number of these muffins. Let me know\nwhat you think!!!\n\nZucchini Carrot Banana Bread Muffins\nIngredients:\n1/2 cup shortening\n 1 cup sugar\n 2 eggs\n 4 mashed bananas\n 1 tsp lemon juice\n 2 cups sifted flour\n 1/2 tsp salt\n 1 cup chopped nuts\n 1 zucchini, shredded\n 1 carrot, shredded strips\n Directions:\nCream shortening and sugar together. Beat eggs until light and add. Mix in\nbananas and add lemon juice. Blend with creamed mixture. Sift flour, baking\npowder and salt together and mix quickly into the banana mixture. Add the nuts,\nzucchini, and carrots and mix. Pour batter into cupcake pans and bake at 375\ndegrees about 30 minutes, or until a toothpick comes out clean when you poke it.","feature_image":"https://pramods.box.com/shared/static/be3rtijtmhldb0ap2j7o8218p2z8gkw7.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c296","name":"bananas","slug":"bananas"},{"id":"5c47a6f22037ef002282c294","name":"zucchini","slug":"zucchini"},{"id":"5c47a6f22037ef002282c295","name":"carrot","slug":"carrot"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}}]}},"pageContext":{"slug":"zucchini","limit":6,"skip":0,"numPages":1,"currentPage":1}}