{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34f","uuid":"7e8c442d-4c8d-4c6b-8667-33acc5c95e1a","title":"The Glorious Monstrosities of Frita Batidos","slug":"frita-batidos","published_at":"27 March, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7651/16863218825_882de53cd6_b.jpg\" alt=\"\"></p>\n<p>Frita Batidos is one of the crown jewels of Ann Arbor, MI.  It is a small cuban street food restaurant in downtown Ann Arbor. While it may be a slight walk from the University of Michigan campus, many students make the trek despite any ridiculous weather conditions to get a bite of these burgers.</p>\n<p>They have the one of the most delicious, insanely huge and jam packed burgers I’ve ever eaten in my life. No matter the patty you want inside your burger, whether it be black bean, chicken, or chorizo, you’re bound to get a tasty concoction which will blow your mind. Honestly I have yet to meet a person at the University of Michigan who doesn’t like their burgers.</p>\n<p>The basic burger (or Frita) is simple, just the patty between two egg buns and stuffed with fries. I also added some cilantro-lime salsa and tropical slaw to juice it up a little. Safe to say, I don’t think I would be trying to impress anyone while eating this monstrosity.</p>\n<p><img src=\"https://farm8.staticflickr.com/7598/16243253993_f6b6d7018a_b.jpg\" alt=\"\"></p>\n<p>My brother always goes with a sunny side up egg and avocado spread on his frita. As soon as you bite into the burger, the yolk bursts, spreading that wonderful flavor into every bite thereafter.</p>\n<p><img src=\"https://farm9.staticflickr.com/8679/16837349936_c34c5ef899_b.jpg\" alt=\"\"></p>\n<p>This trip to Frita Batidos was special because we brought one of my friends here for her first time. She decided to go big or go home and made her frita “loco.” This means that they just go “loco” and add ALL of their available toppings on top of your burger: muenster, a sunny side up egg, cilantro lime salsa, tropical slaw, AND avocado spread! This is pretty much the mother of all burgers. I mean its GINORMOUS. My friend wasn’t even able to attempt to eat this with her hands. But oh was it delicious.</p>\n<p><img src=\"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg\" alt=\"\"></p>\n<p>Don’t get me started on their garlic-cilantro fries. Frita Batidos has some of the simplest yet most amazing fries I’ve had.  I can’t even describe them, you have to try them yourself!</p>\n<p><img src=\"https://farm8.staticflickr.com/7588/16863220175_acd3bd5a0b_b.jpg\" alt=\"\"></p>\n<p>If you are ever in Ann Arbor <strong>MAKE SURE</strong> you head to downtown to taste one of these monstrosities, these glorious monstrosities of Frita Batidos.</p>\n<p>Check them <a href=\"http://www.fritabatidos.com\">out</a>!</p>\n","feature_image":"https://farm9.staticflickr.com/8669/16240858444_1a3f8e5341_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c263","name":"frita batidos","slug":"frita-batidos"},{"id":"5c47a6f22037ef002282c264","name":"burgers","slug":"burgers"},{"id":"5c47a6f22037ef002282c265","name":"cuban","slug":"cuban"},{"id":"5c47a6f22037ef002282c266","name":"garlic","slug":"garlic"}]}}]}},"pageContext":{"slug":"frita-batidos","limit":6,"skip":0,"numPages":1,"currentPage":1}}