{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c347","uuid":"156f6a9c-9dc3-4bcf-9a10-98c40146b162","title":"Squash Galore","slug":"squash-galore","published_at":"10 November, 2014","plaintext":"So recently my mom bought various different types of squash. We had spagetti\nsquash, acorn squash and some other types I honestly have no idea what they are\ncalled.\n\nOriginally they had all just been sliced in half and used as decorative bowl for\na lunch party my mom threw. But unfortunately, that resulted in tons and tons of\nleftover squash. I decided to attempt to make use of them.\n\nFirst, I made an \"alfredo\" penne pasta. Here's the recipe for reference. I did\nmake a few adjustments partially on accident; I apparently used a different kind\nof similar tasting squash instead of acorn squash (pictured below), I used\nnormal milk instead of plant milk and a little mozzerella cheese instead of\nyeast flakes.\n\n\n\nAcorn Alfredo Pasta\n[http://kblog.lunchboxbunch.com/2010/10/acorn-squash-vegan-alfredo-sauce-kamut.html]\nRecipe by\nhttp://kblog.lunchboxbunch.com/2010/10/acorn-squash-vegan-alfredo-sauce-kamut.html\n\nIngredients:\nAcorn Alfredo Sauce\n4 Cups roasted Acorn Squash (about 1 medium squash)\n 1 cup fresh basil\n 3/4 cup milk\n 1/3 cup mozzarella cheese\n 2-3 Tbsp EVOO\n 2-3 Tbsp Dijon Mustard\n 2-3 Tbsp apple cider vinegar\n 2 Tbsp roasted garlic\n 2 Tbsp dried Italian herbs (basil, oregano, thyme)\n 1 Tbsp maple syrup\n 1 tsp red pepper flakes or dash of cayenne\n salt and pepper\n \n1 bag pasta\n 2-3 cups mushrooms\n Directions:\nTurn on oven to 350 degrees.\n\nFill a casserole dish with an inch of water. Slice Acorn Squash in half\n(horizontal slice as shown) and lay flat in dish. Place in oven to roast at 350\ndegrees for 60-75 minutes.\n\nWhen your squash is roasted the skin should peel away quite easily. Remove all\nskin and place squash flesh in a food processor. Add all other ingredients.\n\nBlend on high for at least 2 minutes. You want all the parsley to chop into fine\nbits. Set sauce aside.\n\nBoil a pot of salted water. Cook your pasta. 2-3 minutes before the pasta is\nready to drain, add mushrooms and optional protein add-in's. Drain as usual.\nToss dry pasta in a splash of EVOO (opt'l).\n\nToss warm pasta in your Acorn Alfredo Sauce. Mix well so each pasta bit is\ncoated.\n\n\n\n\n\nIt honestly looked quite delicious! It wasn't bad, but personally I'd rather\njust eat a smaller portion of normal alfredo rather than fabricating the same\nkind of taste with squash.\n\nWhen my mom came home and informed me I had used the wrong squash to make my\npasta, we decided to actually make use of the REAL acorn squash! We kept it\nsimple, just seasoning slice and roasting them as \"fries\". This in comparison\nwas amazing. It was very similar to sweet potato fries. We loved it so much we\nactually ate most of them before even thinking of taking a photo! :)\n\nThe final remaining squash we had left was spaghetti squash. Initially, we were\nconfused on what it had to do with spaghetti at all, but once we stuck it in the\noven for a while with a little oil, it finally made sense. After roasting the\nsquash, it looks just like spaghetti! Doesn't quite taste the same, but could\nwork as a substitute.\n\nThis time we decided to make pizza using the squash to make the crust. The most\nimportant thing to keep in mind when using spaghetti squash to make pizza crust\nis to really squeeze ALL of the moisture out of it before putting it in the\noven. The less moisture when cooking, the crispier and less flimsy the pizza\ncrust! We used this recipe\n[http://sharedappetite.com/recipes/gluten-free-spaghetti-squash-pizza-crust/] \nby Shared Appetite [http://sharedappetite.com]. We covered 1/2 of the pizza with\npesto sauce (hence the insane amount of oil in the picture) and 1/2 with\nmarinara sauce, tossed a few mushroom slices, covered it with cheese and then\nbaked the \"pizza\".\n\n\n\nIn all honesty, I realize I'm not a HUGE squash fan. My parents didn't hate the\npasta or the pizza. It just didn't feel the same. I'd personally rather indulge\nin smaller portions in the real thing rather than trying to replicate the same\nexperience with other ingredients. However, I would definitely recommend that\nyou try acorn squash fries! Those were amazing :)","feature_image":"https://farm6.staticflickr.com/5613/15216086813_bef71f0970_b.jpg","tags":[{"id":"5c47a6f22037ef002282c22e","name":"squash","slug":"squash"},{"id":"5c47a6f22037ef002282c22f","name":"pasta","slug":"pasta"},{"id":"5c47a6f22037ef002282c230","name":"pizza","slug":"pizza"},{"id":"5c47a6f22037ef002282c231","name":"acorn","slug":"acorn"},{"id":"5c47a6f22037ef002282c232","name":"spaghetti","slug":"spaghetti"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"}]}}]}},"pageContext":{"slug":"spaghetti","limit":6,"skip":0,"numPages":1,"currentPage":1}}