{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c378","uuid":"4f6c5f80-e95b-43b4-882b-0df100605e8e","title":"New City, New Beginnings","slug":"new-city-new-beginnings","published_at":"14 April, 2016","html":"<iframe src=\"https://embed.spotify.com/?uri=spotify:track:0MgfdN0hWlNeQCSLqjfn6C\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>So things have been a bit crazy for me over the last few weeks. I made my first solo move as an adult. I packed up my apartment in Sunnyvale and <em>finally</em> moved to San Francisco. If you're wondering why I picked this specific Van Morrison song, I felt like it was meant to be. The song Saint Dominic's Preview has a lot of references to the Saint Dominic's Church on the intersection of Bush and Steiner in San Francisco, literally a block from my new apartment. Everyday when I walk back from the bus stop after work, I pass by this gorgeous church and admire it. It just felt right to pick this song for the post. :)</p>\n<p>However, if that song isn't your speed and you want something a little more sultry, try this one by Carmen McRae.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:4jsrzfNVVFAtNtMPVpFdwo\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>I've had a blast since moving out here. I get to see my friends almost every day. I have a wonderful new roommate who I've known since college. Even after only a week, I've got to attend all sorts of weird and yet awesome things! This was an art exhibit that was installed right outside City Hall over this past week.</p>\n<p><img src=\"https://pramods.box.com/shared/static/ssreqfxw68u26d0ezcxhj7m41o5rtp8x.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/dzi45k6s5vrfkhd5s4tymemg446eu46v.jpg\" alt=\"\"></p>\n<p>And best of all, I get to cook with my friends, both old and new! I went over to a friend's place yesterday night and me and a new friend, Kerry, began to make some DELICIOUS fresh spring rolls. Granted, the recipe for this has been posted on this site before, the food could never have been more delicious and different. We filled these with lettuce, shrimp, vermicelli noodles, and more! We even made some peanut sauce to dip the rolls in (just mix some hoisin sauce and creamy peanut butter together). Simple, yet delicious!</p>\n<p>We did have some mishaps during the process. San Francisco kitchens are usually TINY, as are a lot of the apartments. My friend's kitchen is very much sizable for 1 person cooking. When you try to squeeze 4 people in there, chaos ensues.</p>\n<ol>\n<li>We were lied to about the presence of peanut butter, hence sending the boys on one trip to the store</li>\n<li>Kerry and I weren't aware that the pasta strainer LOCKED onto the pot we were cooking the noodles in. This unfortunately caused ALL of the noodles to fall into the sink, hence a second trip to the store to get more noodles</li>\n<li>The boys may never let us live this down. Highly unlikely after all the sass given while Kerry and I made their dinner.</li>\n<li>They showed me this <a href=\"https://www.youtube.com/watch?v=3Y7Vq9749s8\">amazing group that performs acoustic covers of popular songs</a>... MIND BLOWING. I'm not gonna lie I may have teared up a bit.</li>\n</ol>\n<p>While I may not have an explicit recipe for you, I have plenty of photos and full stomachs as proof. Enjoy!</p>\n<p><img src=\"https://pramods.box.com/shared/static/o2nfryr3uy3wo1af3au1fqj06g6hsnqt.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/88lgsulz4dmss371kbnei54af3yaazqq.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/j1aa87dqcpkscn4u9iwph6xbgrqzrhrm.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/me9os02qsilwhgg2oojd7wv5dvutsamk.jpg","tags":[{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c30e","name":"spring rolls","slug":"spring-rolls"},{"id":"5c47a6f22037ef002282c2f5","name":"san francisco","slug":"san-francisco"},{"id":"5c47a6f22037ef002282c30f","name":"fresh rolls","slug":"fresh-rolls"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c317","name":"shrimp","slug":"shrimp"},{"id":"5c47a6f22037ef002282c318","name":"tofu","slug":"tofu"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"}]}}]}},"pageContext":{"slug":"shrimp","limit":6,"skip":0,"numPages":1,"currentPage":1}}