{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Is \"butter\" a carb?","slug":"is-butter-a-carb","feature_image":"https://farm9.staticflickr.com/8545/15649695779_61aac68719_b.jpg","published_at":"17 November, 2014","html":"<p> Sumu and I have been rescheduling taco day for weeks. We had a grand plan to make eight different kinds of tacos, with a wild assortment of toppings, for all the people we knew. We invited friends, looked up taco recipes with abandon, and prepared our stomachs by eating as much avocado as possible. Then gradually, all our friends realized they had lives, and we had contemplated the plan for so long that it no longer seemed appealing. In the manner of gifts that you were supposed to “grow into,” something that seemed so exciting when we first considered it lost all appeal with lengthy consideration. </p>\n<p> Suddenly, taco day was a chore, something we needed to do – and if you ask either of our mothers, they will tell you that we rarely do those things. </p>  \n<p> So we shoved the plan to the back of the closet, along with “The Scarlet Letter” (which I received when I was only nine) and other childhood detritus. We adopted a new plan: lettuce wraps. Lettuce wraps, we reasoned, are healthier than traditional tacos – there are fewer carbs, or grains, or something that we know we’re supposed to avoid eating in excess. </p> \n<p><img src=\"https://farm9.staticflickr.com/8545/15649695779_61aac68719_b.jpg\" alt=\"\"></p>\n<p> We made Asian style lettuce wraps with egg fried noodles, vegetables cooked in soy sauce, and thai-inspired peanut sauce. </p> \n<p> To make the noodles, just make regular noodles according to the package instructions. Drain them, rinse them slightly in cold water, then cooking them in sesame oil on the stove until they’re hot all the way through. Crack eggs right on to noodles and stir until fully cooked, and voila! </p>  \n<p> For the vegetables, just toss them in soy sauce, a little rice vinegar, and salt and pepper, and then stir fry them until they’re ready. </p>\n<p> And for the peanut sauce, mix a half cup of creamy peanut butter with a tablespoon of rice vinegar, and about a half cup of soy sauce in a bowl. Then, in a pan, put about two tablespoons of sesame oil. Cook about a half cup of diced onions until fragrant and translucent, and add chili flakes to your taste. Once your chili flakes are fully incorporated, add your mixture of peanut butter, soy sauce, and vinegar and cook until heated through. </p>\n<p> We made Mexican style lettuce wraps with homemade salsa, sweet potatoes diced and pan roasted with taco seasonings, and mushrooms. </p>  \n<p> For this recipe, you can pretty much make any sort of salsa you like – feel free to experiment! For the sweet potatoes, just dice and cook in a pan until slightly crispy, and add taco seasoning like there’s no tomorrow. Trust us; you cannot have enough taco seasoning. </p>   \n<p><img src=\"https://farm6.staticflickr.com/5611/15811854346_887e2574e5_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7524/15215525994_155fdec421_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8638/15650656340_36a8b87812_b.jpg\" alt=\"\"></p>\n<p> Once we were done cooking, we set all our toppings out alongside the washed and dried lettuce leaves, and sat right down on the floor and stuffed our faces. </p>\n<p> It. Was. Awesome. </p>\n","plaintext":"  Sumu and I have been rescheduling taco day for weeks. We had a grand plan to\nmake eight different kinds of tacos, with a wild assortment of toppings, for all\nthe people we knew. We invited friends, looked up taco recipes with abandon, and\nprepared our stomachs by eating as much avocado as possible. Then gradually, all\nour friends realized they had lives, and we had contemplated the plan for so\nlong that it no longer seemed appealing. In the manner of gifts that you were\nsupposed to “grow into,” something that seemed so exciting when we first\nconsidered it lost all appeal with lengthy consideration. \n\n  Suddenly, taco day was a chore, something we needed to do – and if you ask\neither of our mothers, they will tell you that we rarely do those things. \n\n  So we shoved the plan to the back of the closet, along with “The Scarlet\nLetter” (which I received when I was only nine) and other childhood detritus. We\nadopted a new plan: lettuce wraps. Lettuce wraps, we reasoned, are healthier\nthan traditional tacos – there are fewer carbs, or grains, or something that we\nknow we’re supposed to avoid eating in excess. \n\n\n\n  We made Asian style lettuce wraps with egg fried noodles, vegetables cooked in\nsoy sauce, and thai-inspired peanut sauce. \n\n  To make the noodles, just make regular noodles according to the package\ninstructions. Drain them, rinse them slightly in cold water, then cooking them\nin sesame oil on the stove until they’re hot all the way through. Crack eggs\nright on to noodles and stir until fully cooked, and voila! \n\n  For the vegetables, just toss them in soy sauce, a little rice vinegar, and\nsalt and pepper, and then stir fry them until they’re ready. \n\n  And for the peanut sauce, mix a half cup of creamy peanut butter with a\ntablespoon of rice vinegar, and about a half cup of soy sauce in a bowl. Then,\nin a pan, put about two tablespoons of sesame oil. Cook about a half cup of\ndiced onions until fragrant and translucent, and add chili flakes to your taste.\nOnce your chili flakes are fully incorporated, add your mixture of peanut\nbutter, soy sauce, and vinegar and cook until heated through. \n\n  We made Mexican style lettuce wraps with homemade salsa, sweet potatoes diced\nand pan roasted with taco seasonings, and mushrooms. \n\n  For this recipe, you can pretty much make any sort of salsa you like – feel\nfree to experiment! For the sweet potatoes, just dice and cook in a pan until\nslightly crispy, and add taco seasoning like there’s no tomorrow. Trust us; you\ncannot have enough taco seasoning. \n\n\n\n\n\n\n\n  Once we were done cooking, we set all our toppings out alongside the washed\nand dried lettuce leaves, and sat right down on the floor and stuffed our faces.\n \n\n  It. Was. Awesome.","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c237","name":"lettuce wraps","slug":"lettuce-wraps"}]}},"pageContext":{"slug":"is-butter-a-carb","previous":{"html":"<p>So recently my mom bought various different types of squash. We had spagetti squash, acorn squash and some other types I honestly have no idea what they are called.</p>\n<p>Originally they had all just been sliced in half and used as decorative bowl for a lunch party my mom threw. But unfortunately, that resulted in tons and tons of leftover squash. I decided to attempt to make use of them.</p>\n<p>First, I made an &quot;alfredo&quot; penne pasta. Here's the recipe for reference. I did make a few adjustments partially on accident; I apparently used a different kind of similar tasting squash instead of acorn squash (pictured below), I used normal milk instead of plant milk and a little mozzerella cheese instead of yeast flakes.</p>\n<p><img src=\"https://farm6.staticflickr.com/5613/15216086813_bef71f0970_b.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <span class=\"item\">\n      <h2 class=\"fn\"><a href=\"http://kblog.lunchboxbunch.com/2010/10/acorn-squash-vegan-alfredo-sauce-kamut.html\">Acorn Alfredo Pasta</a></h2>\n    </span>\n    <div class=\"summary\" style=\"clear:left\">\n      <p><em>Recipe by http://kblog.lunchboxbunch.com/2010/10/acorn-squash-vegan-alfredo-sauce-kamut.html</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Acorn Alfredo Sauce</h4>\n        <li class=\"ingredient\">4 Cups roasted Acorn Squash (about 1 medium squash)</li>\n        <li class=\"ingredient\">1 cup fresh basil</li>\n        <li class=\"ingredient\">3/4 cup milk</li>\n        <li class=\"ingredient\">1/3 cup mozzarella cheese</li>\n        <li class=\"ingredient\">2-3 Tbsp EVOO</li>\n        <li class=\"ingredient\">2-3 Tbsp Dijon Mustard</li>\n        <li class=\"ingredient\">2-3 Tbsp apple cider vinegar</li>\n        <li class=\"ingredient\">2 Tbsp roasted garlic</li>\n        <li class=\"ingredient\">2 Tbsp dried Italian herbs (basil, oregano, thyme)</li>\n        <li class=\"ingredient\">1 Tbsp maple syrup</li>\n        <li class=\"ingredient\">1 tsp red pepper flakes or dash of cayenne</li>\n        <li class=\"ingredient\">salt and pepper</li>\n        <br>\n        <li class=\"ingredient\">1 bag pasta</li>\n        <li class=\"ingredient\">2-3 cups mushrooms</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Turn on oven to 350 degrees.</p>\n        <p>Fill a casserole dish with an inch of water. Slice Acorn Squash in half (horizontal slice as shown) and lay flat in dish. Place in oven to roast at 350 degrees for 60-75 minutes.</p>\n        <p>When your squash is roasted the skin should peel away quite easily. Remove all skin and place squash flesh in a food processor. Add all other ingredients.</p>\n        <p>Blend on high for at least 2 minutes. You want all the parsley to chop into fine bits. Set sauce aside.</p>\n        <p>Boil a pot of salted water. Cook your pasta. 2-3 minutes before the pasta is ready to drain, add mushrooms and optional protein add-in's. Drain as usual. Toss dry pasta in a splash of EVOO (opt'l).</p>\n        <p>Toss warm pasta in your Acorn Alfredo Sauce. Mix well so each pasta bit is coated.</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm8.staticflickr.com/7563/15650666850_b13f794739_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm6.staticflickr.com/5613/15811871186_e219e23fbb_b.jpg\" alt=\"\"></p>\n<p>It honestly looked quite delicious! It wasn't bad, but personally I'd rather just eat a smaller portion of normal alfredo rather than fabricating the same kind of taste with squash.</p>\n<p>When my mom came home and informed me I had used the wrong squash to make my pasta, we decided to actually make use of the REAL acorn squash! We kept it simple, just seasoning slice and roasting them as &quot;fries&quot;. This in comparison was amazing. It was very similar to sweet potato fries. We loved it so much we actually ate most of them before even thinking of taking a photo! :)</p>\n<p>The final remaining squash we had left was spaghetti squash. Initially, we were confused on what it had to do with spaghetti at all, but once we stuck it in the oven for a while with a little oil, it finally made sense. After roasting the squash, it looks just like spaghetti! Doesn't quite taste the same, but could work as a substitute.</p>\n<p>This time we decided to make pizza using the squash to make the crust. The most important thing to keep in mind when using spaghetti squash to make pizza crust is to really squeeze ALL of the moisture out of it before putting it in the oven. The less moisture when cooking, the crispier and less flimsy the pizza crust! We used <a href=\"http://sharedappetite.com/recipes/gluten-free-spaghetti-squash-pizza-crust/\">this recipe</a> by <a href=\"http://sharedappetite.com\">Shared Appetite</a>. We covered 1/2 of the pizza with pesto sauce (hence the insane amount of oil in the picture) and 1/2 with marinara sauce, tossed a few mushroom slices, covered it with cheese and then baked the &quot;pizza&quot;.</p>\n<p><img src=\"https://farm6.staticflickr.com/5605/15835512375_d6fc39deb4_b.jpg\" alt=\"\"></p>\n<p>In all honesty, I realize I'm not a HUGE squash fan. My parents didn't hate the pasta or the pizza. It just didn't feel the same. I'd personally rather indulge in smaller portions in the real thing rather than trying to replicate the same experience with other ingredients. However, I would definitely recommend that you try acorn squash fries! Those were amazing :)</p>\n","title":"Squash Galore","slug":"squash-galore","published_at":"10 November, 2014","feature_image":"https://farm6.staticflickr.com/5613/15216086813_bef71f0970_b.jpg","tags":[{"id":"5c47a6f22037ef002282c22e","slug":"squash"},{"id":"5c47a6f22037ef002282c22f","slug":"pasta"},{"id":"5c47a6f22037ef002282c230","slug":"pizza"},{"id":"5c47a6f22037ef002282c231","slug":"acorn"},{"id":"5c47a6f22037ef002282c232","slug":"spaghetti"},{"id":"5c47a6f22037ef002282c233","slug":"fries"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"}]},"next":{"html":"<p><img src=\"https://farm8.staticflickr.com/7484/15215553514_6e88dc3524_b.jpg\" alt=\"\"></p>\n<p>Before 2 summers ago, I had never experienced Pho. Once I tasted it, I knew that I had been missing out on something delicious my entire life. Pho is a simple vietnamese noodle soup. Traditionally, it is made with beef or chicken with some meat broth, which gives it its rich flavor. However we found a vegetarian way of mimicking the flavor! There's a great recipe <a href=\"http://ohmyveggies.com/30-minute-vegetarian-pho/\">here</a> that also had some great flavors.</p>\n<p>Pho works best if you have fresh bean sprouts, jalapenos, and basil. When you drop these into your soup, it brings out the most amazing flavors. I also chopped some onions, cilantro and some green onions for a little something extra.</p>\n<p><img src=\"https://farm8.staticflickr.com/7549/15215550764_63933ed924_b.jpg\" alt=\"\"></p>\n<p>The first step in the process is preparing the stock. My mom and I made a vegetable stock using celery, carrots, and onions among other things. All you need to do is simmer vegetables and herbs in a pot and after 30-40 minutes it should be done! You can also use store bought stock, as that is likely far less labor intensive! If you don't mind chicken or beef broth, feel free to use one of those instead and add some cooked shredded chicken or beef too.</p>\n<p>Next, you want to prepare your noodles - you can buy premade rice noodles, or get dry noodles and cook them yourself. But be careful; if they come pre-cooked and packaged they may be extremely fragile and broken. This is what happened to me, as you can see from my pictures. Ideally, the noodles shouldn't break the minute you pick them up with your chopsticks.</p>\n<p><img src=\"https://farm8.staticflickr.com/7513/15650093948_27967e5c09_b.jpg\" alt=\"\"></p>\n<p>Now all that's left for you to do is to pour yourself a bowl of hot broth, toss some noodles, vegetables and garnishes and top it off with some sauces. Personally, I just use a little hoisin sauce and chili garlic sauce but feel free to add soy sauce, sriracha, basically anything you want! The best part about Pho is that it can be easily modified to suit each individual's taste!</p>\n<p>If you haven't already, drop everything you're doing, go to the nearest Vietnamese restaurant and dive into a HUGE bowl of Pho!</p>\n<p><img src=\"https://farm6.staticflickr.com/5615/15837085352_70e3c9fa9c_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7551/15811883866_29a5cdf02b_b.jpg\" alt=\"\"></p>\n","title":"It's about \"Pho\"-king time!","slug":"its-about-pho-king-time","published_at":"31 January, 2015","feature_image":"https://farm6.staticflickr.com/5615/15837085352_70e3c9fa9c_b.jpg","tags":[{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c235","slug":"vietnamese"},{"id":"5c47a6f22037ef002282c236","slug":"pho"}]}}}