{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c351","uuid":"4080fb6c-a3b5-40a7-b378-db7d61633324","title":"Challenge Accepted","slug":"challenge-accepted","published_at":"02 January, 2016","plaintext":"Welcome to 2016!\n\n2015 was interesting year for us, and we want to make sure that in the future,\nthe blog reflects our lives a bit more. For example, I (Anu) spent half the year\nin India, but you guys never read about my adventures with street food, or my\nquest to find the best masala dosas in Bangalore. While Sumu kept you all a bit\nmore updated on her goings on, the fact is, we both want to do better.\n\nSo with that in mind, we're challenging ourselves to post once a week each in\n2016! You'll be getting a new post from Sumu on Wednesdays, and Anu on Sundays.\nWe'll be sharing bits of our lives and kitchens all year, and in the interest of\naccountability, we've decided to implement some penalties for failure to\ndeliver.\n\nOffense 1: Donate ten dollars to a slush fund that we will donate to a charity\nat the end of the year! Every other penalty on the list is also accompanied by\nthis, so there's potential for us to donate 80 at the end of the year.\n\nOffense 2: The innocent party gets to pick 1 song for you to listen to during\nyour entire commute.\n\nOffense 3: The innocent party gets to take a picture or pictures with puppies\nand send it to the offender, to show them what they're missing.\n\nOffense 4: The Chopped Challenge; the innocent party assigned the offending\nparty a random list of ingredients, from which they must produce and consume a\nmeal. The production of said meal must be videotaped for the innocent party's\nviewing pleasure.\n\nAny offenses over and above this will result in the offending party having to\ncomplete a dare that is entirely up to the whim of the innocent party. So that's\npretty terrifying. All posts will also include the tag #challenge2016 so you can\nalso check up on us.\n\nMay the force be with you\n\nWe hope you're as excited as we are :)\nSumu and Anu\n\n\n\nNOTE: I (Sumu) have done a complete redesign of the blog so please email me @ \nsumu@cookinginpjs.com  if you've got any thoughts/bugs/general comments about it\nso I can address them ASAP! Thanks and Enjoy!","feature_image":"https://lh3.googleusercontent.com/M5419MoPiaFyC2XgHnxDAf99IksEcWU37d40IalYRH94Wapcd6ciC14x2WQLvG03lWYoQX_Uwb6jGUURtVJH7Lq9o6r0Gn5B0_bFEu9-1SLwIQo-bZ50ANJg31mW77lmKy0-6aMCt0ubf3MQfGa_X938ufNZNJd3pFDH8T3fSlcD6pHIQb-7791O7iWzpBE5E94gD-4Ggcpto1Jb2OxgfFI7TzHTBd10Jc2GQp_txHOOwYIEuXNkKf-owKXQmNTcNdOvjPFLJBSbvC1cQNXsevRNex5LpSy20-DBbbymh9NdKsQH95Px46UqyIOA-3TdMn6ALT5GX0YtkNbygrUhYvQszcMFR0QEXkxmo-IFNOdb-_E3ZYZnbhUseSV_oaeppP-eWH-lwIAp0KrpDfW1UwGbyd6NteW9_HlD9Q_ECqOz5HquabMPJv0jkaAz4r5FNcvoH2PcmPxWW_cKpS7c2HqjQVrssItea_fqbjnvHAXD35dAFnPZkZbHNz2lJXUNgyh4UxSCcKWLYHsZC7s14T66vX5pY96VTd1-ZpyNkcillReAM8FhbQ-qaxad5hXXbU86bw=w353-h546-no","tags":[{"id":"5c47a6f22037ef002282c2a5","name":"new years","slug":"new-years"},{"id":"5c47a6f22037ef002282c2a6","name":"challenge2016","slug":"challenge2016"},{"id":"5c47a6f22037ef002282c2a7","name":"redesign","slug":"redesign"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c379","uuid":"47c49c89-9a7d-4de9-a292-71d78ca5abb8","title":"What to do when you have the World's Supply of Granola at your Disposal","slug":"what-to-do-when-you-have-the-worlds-supply-of-granola-at-your-disposal","published_at":"08 October, 2015","plaintext":"\n\nAbout a week ago we had a parfait event at work to raise awareness about Women\nin Tech. A lot of people attended and learned a lot about what Box is doing to\nimprove the gender disparity in tech. Sadly, we overestimated how much granola\nwe needed and ended up with 2 GIANT bowls of granola left over.\n\nIn my head, it seemed like I could bake those into some variety of oatmeal\ncookies and breakfast bars and be done with it. No matter how much granola I\nused, it seemed like it was never going to end! Thankfully after making 3-4\nbatches of these oatmeal bars I finished 1 bowl, but I ended up making some dark\nchocolate fruit and nut clusters as well (post coming soon).\n\n\n\nIn all honesty, these cookie bars were SO much better than those chocolate\nclusters (as scrumptious as those look). The crumbly-ness and chocolatey-ness of\nthese bars complemented each other perfectly. I've actually saved all the extra\ncrumbles to top ice scream sundaes. Think about how delicious that would be!!!\nNow that you're officially drooling thinking about that, here's the recipe.\n\nOatmeal Chocolate Chip Cookie Bars\nIngredients:\n3 cups granola (or oats)\n 1¼ cup butter, melted\n 2 cups chocolate chips\n 2 cups flour\n 1½ cups brown sugar\n 1 tsp baking soda\n 1 tsp salt\n 1½ tbsp vanilla\n 2 eggs\n Directions:\nHeat oven to 350 degrees. Spray a cookie sheet with non-stick cooking spray.\n\nAdd everything but the chocolate chips into a bowl and mix until just combined.\nI don't have a standing mixer or this would have been much easier and less\nmessier. Stir in the chocolate chips.\n\nSpread the batter into the baking dish. Bake for 25 minutes or until a tester\ncomes out with just a few moist crumbs. Bars should look slightly underdone. Let\ncool 1 hour before cutting into bars. (But let's be honest here... I couldn't\nwait more than 10 minutes)\n\nBecause the granola I used wasn't very sweet it didn't overly sweeten the bars\neither, which was something I preferred. Similarly, using brown sugar instead of\nnormal granular sugar kept the bars less sweet. Make sure not to overcook the\nbars or they won't be as gloriously crumbly!","feature_image":"https://lh3.googleusercontent.com/2lPmzUu82FpK-bF10uC-AJpZ8xIWniOm2cCYIRfno-lDDrHJp5zBVeNAPCaaBZMwDVZ_wv9-tiO4OVMUyv90BGrb3cpDcawOhIjnkkM5FtDsXUzWoa9hfnflZZ7wgFq13L44Si8-D4RHJ17O8KP8aKIOKPDpYr_MbISDtZtCZh9enMUhh-1esqJO16NL8-suXV6hO6JlMnyzjQwFNeww9sUlZuwprBxko5kC1YvUsa1Vk69b02093F_4JuCdlWORn_SJA97gLJzvlnDVI3HIZYQ41o0e2JJA0SEdMgv9PRki8xj4fJtI_E2W_DdiYKPg3AulAqqO0Qx9i9q9pMjUZEiNmjzAFa_BcAWYSPRb27EM8s8BujPmrAWM8AxNpE2mjd0OJRddfyJlkVXZyu0j6PJizFjtEP43x6uSPcgL5SrNdACc4g8EVrth-qPHxy2eOnhYgEtc-wR80827fG_pKrzy8nwUfVmIEMbtOHRf1zD06ZNVPjqADJ8CSbxv5vOAP-DZNKtUnK4AViSQA8OpchyEQRquO5A8NeFuN9qKZLez=w1440-h1080-no","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c29e","name":"oatmeal","slug":"oatmeal"},{"id":"5c47a6f22037ef002282c29f","name":"granola","slug":"granola"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c368","uuid":"f874d388-7289-41a8-bdc1-129c0d14f429","title":"Gettin' your morning BUZZ","slug":"gettin-your-morning-buzz","published_at":"17 July, 2015","plaintext":"\n\nTo be completely honest... this song isn't quite perfect for this post but it\nwas the first one that came to mind for this post. Enjoy :P\n\nAnd no, in case you were wondering... I didn't spike these coffee cupcakes with\ncocaine.\n\nSo, I'm not sure how many of you know this but coffee cake doesn't ACTUALLY \nhave any coffee in it... I KNOW! I was just as disappointed as you are right\nnow. Despite these cakes being a COMPLETE and utter lie, I love them down to the\nvery last crumb.\n\nDeceit aside, this recipe was actually quite easy to make and also involved me\nhaving to make extra crumble topping to replace the amount I ate. I'd recommend\ndoing the same for yourself :P hehe\n\n\n\nNOTE: My crumble topping came out kind of clumpy but I think that was mainly\nbecause I got lazy and didn't add the ingredients one by one as described in the\nrecipe. Instead, I decided to add everything at the same time and mix it. It\ndoesn't really change the taste that much but I imagine the cinnamon sugar taste\nis more uniformly present if you make it right.\n\nSince I didn't really make a custom version of this recipe check out the recipe \nhere [http://damndelicious.net/2014/03/24/coffee-cake-muffins/].\n\nTry the recipe out yourself and let me know what you think!!!","feature_image":"https://lh3.googleusercontent.com/Py-geJ6eWoOITUr4mZ-ZH8QUboRguSauLNU_iOrtXuND=w1440-h960-no","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c280","name":"coffee","slug":"coffee"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c282","name":"crumble","slug":"crumble"},{"id":"5c47a6f22037ef002282c29b","name":"cinnamon","slug":"cinnamon"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34a","uuid":"df2980d7-f8f6-4a9a-96e3-15fa96299b5d","title":"Dirty Girls Scouts ;)","slug":"dirty-girl-scouts","published_at":"15 July, 2015","plaintext":"\n\nSince I'm starting to like theming my blog posts to songs, enjoy.\n\nLet's be honest... Anytime anyone sees their local Girl Scouts at the grocery\nstore, they start drooling and daydreaming of Thin Mints, Tagalongs, Samoa's,\nand Do-si-Dos. Girl Scout cookies are some of my favorite type of cookies in the\nworld. While I may mainly be a fan of the plain shortbread cookies, Trefoils.\nThin mints and Samoa's are America's two favorites.\n\nWhile plunging into the depths of Pinterest one day, I found a recipe for mini\nsamoa donuts. That got me thinking... What if I were to make mini girl scout\nthemed cupcakes. And to make them even better, give them a slight \"adult\" twist.\n\n\n\nNot to toot my own horn, but these donut bites were AMAZING. Although they were \nreally  donuts... but rather cupcakes. They still tasted great. There was\ndefinitely not enough alcohol in any of the desserts to do any damage but the\nslight bourbon taste in the caramel brought out some awesome flavors.\n\nMy cousins and I even had a hard time not finishing up the caramel bourbon sauce\nbefore the donuts were ready. We kept eating spoon by spoon of the creamy\nbooze-ness.\n\nPro Tip:  Drizzle some warm caramel bourbon sauce onto a scoop of ice cream...\nHEAVEN.\n\nWhen I took these desserts to work, they were gone within minutes. Clearly\neveryone else was dying to get their Girl Scout cookie fix like I was. I even\nsaw this guy spooning caramel bourbon sauce into his coffee to make it a little\nmore \"Irish.\" ;)\n\nHere are the recipes for the donut bites. Even if you don't make the bites\nthemselves... you DEFINITELY have to try the Caramel Bourbon sauce. It takes a\nfew minutes to make and is EXTREMELY rewarding.\n\n\n\n\n\nSamoa Donut Bites\nIngredients:\nDonuts:\n1¼ cup all-purpose flour\n ½ tsp salt\n 1¼ tsp baking powder\n 1 tsp vanilla extract\n 1 egg\n ½ cup milk\n ½ tbsp lemon juice\n 2 tbsp butter, melted\n 4 tbsp Southern Comfort Caramel\n Caramel Bourbon Sauce\n1 package melting caramel (about 14 oz)\n 3 tbsp milk\n ¼ tsp salt\n 2 tbsp Souther Comfort Caramel  <h4>Toppings</h4>\n  <li class=\"ingredient\">3 cups unsweetened coconut flakes, toasted</li>\n</div>\n<div class=\"right\">\n  <h3 id=\"directions\">Directions:</h3>\n  <div class=\"instructions\">\n    <p>Preheat the oven to 425 degrees. Spray the cupcake pan with cooking spray and keep it aside.</p>\n    <p>Mix milk and lemon juice in a cup/bowl and let it sit for at least 5 minutes to make buttermilk</p>\n    <p><strong>Donuts: </strong>Mix the flour, sugar, baking powder and salt together. Then stir in the vanilla, egg, buttermilk, and melted butter until just mixed. Pour the mixture into the cupcake pan and bake for 4-5 minutes or until done.</p>\n    <p><strong>Caramel Icing: </strong>In a separate bowl, warm the caramel with the milk and 1/4 tsp salt. Every 25 seconds, stir the mixture until the caramel is fully melted. Add a few shots of the Southern Comfort Caramel until you feel like your caramel is boozy enough. Feel free to go as crazy as you want.</p>\n    <p>Drizzle or dip your donuts in the icing, cool, and enjoy! Even feel free to toss a few toasted coconut flakes on top to make it even more \"samoa\"-esque</p>\n  </div>\n</div>\n\n\n\n\n\n\nWhole Wheat Thin Mint Donut Bites\nIngredients:\nDonuts:\n¾ cup milk\n 1 tsp lemon juice\n 1 cup + 2 tbsp flour\n ¼ cup sugar\n 1 tsp baking powder\n ½ tsp baking soda\n 1 tbsp cocoa powder\n ½ tsp salt\n 2 tbsp melted butter\n 1 tsp vanilla extract\n 1 egg  <h4>Mint Icing</h4>\n  <li class=\"ingredient\">1½ cups chocolate chips</li>\n  <li class=\"ingredient\">1 tsp oil</li>\n  <li class=\"ingredient\">1 tsp vanilla extract</li>\n  <li class=\"ingredient\">Crème de menthe</li>\n</div>\n<div class=\"right\">\n  <h3 id=\"directions\">Directions:</h3>\n  <div class=\"instructions\">\n    <p>Preheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and keep it aside.</p>\n    <p>Mix milk and lemon juice in a cup/bowl and let it sit for at least 5 minutes to make buttermilk</p>\n    <p><strong>Donuts: </strong>Mix the flour, sugar, salt, melted butter, baking soda, baking powder, cocoa powder, and vanilla together. Mix the eggs into this mixture until the batter is fully mixed. Add the buttermilk and when mixed, pour into the cupcake pan and bake for 6-8 minutes or until done throughout.</p>\n    <p><strong>Mint Icing: </strong>In a separate bowl, mix all the ingredients together until smooth. Feel free to add as much creme de menthe as you want. Just make sure not to add too much because it'll make the icing too \"liquidy.\"</p>\n    <p>Drizzle or dip your donuts in the icing, cool, and enjoy!</p>\n  </div>\n</div>","feature_image":"https://lh3.googleusercontent.com/UATDHsDclzBmpk7RyUOB4c7NHHbPAdWr8pBn0b-6uVzH=w1314-h1316-no","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c274","name":"mini","slug":"mini"},{"id":"5c47a6f22037ef002282c27b","name":"thin mints","slug":"thin-mints"},{"id":"5c47a6f22037ef002282c27c","name":"samoas","slug":"samoas"},{"id":"5c47a6f22037ef002282c27d","name":"donuts","slug":"donuts"},{"id":"5c47a6f22037ef002282c27e","name":"bourbon","slug":"bourbon"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c352","uuid":"2fcc0931-b365-4991-99d9-dba71f89352a","title":"WE WILL BE VICTOOOOOORIOUS!","slug":"we-will-be-victoooooorious","published_at":"15 July, 2015","plaintext":"So if you hadn't already seen, I EPICALLY failed at making macarons this past\nweekend.\n\n\n\nThis just made me all the more determined to get them right. And so began the\njourney to successfully make this adorable French delicacy.\n\nTrial 2\nAs you can tell by the song, I FINALLY DID IT!\n\n**pats self on back**\n\n\n\nWell better at least! :P\n\nTurns out all I did wrong was not be patient enough and fail at making the\nmeringue. If I had beaten the eggs longer to a more frothy froth, then the\nbatter would have turned out more solid, WHICH in turn would have not allowed\nthe batter to spill all over the baking sheet.\n\n\n\nYou can't blame me for not making perfect macarons... I'm not THAT patient.\n\n\n\n\n\n\nTrial 3\nHonestly, this batch still bothered me a lot. It I guess technically was\nmacarons but i wasn't able to get the perfect bubble shape. I was determined to\nperfect this recipe!\n\nTHE MACARONS CANNOT WIN!\n\nSo I set out to make batch 3. This time I let the egg whites \"age\" for a few\ndays before using them. And I decided that I would try to be patient and\nactually wait for the meringue to be COMPLETELY done. I had gotten closer last\ntime but not enough.\n\nWhat basically followed was me obsessively watching videos on how to make the\nperfect macarons. (I've provided some of those links here) My cousin literally\nthought I was insane because I watched videos for a good hour (okay maybe it was\nactually 2 hours... don't judge me).\n\nhttp://foodnouveau.com/destinations/europe/france/how-to-make-macarons-a-detailed-illustrated-step-by-step-recipe/\n\nhttp://www.foodiebaker.com/chocolate-macarons/\n\nhttps://www.youtube.com/watch?v=Bri6xnDBl9I\n\nThere are also TONS of other videos on youtube but let's be honest here... how\nmany of you will actually be attempting to make these. If you're REALLY that\ninterested let me know [sumu@cookinginpjs.com].\n\n\n\nThis time, they managed to somewhat retain their poofy-ness.\n\nVICTORY!\n\n\nBut honestly, even while using an electric beater, it took me like 30 minutes to\nget the \"meringue\" to a decent level... and it wasn't even done yet. WAY too\nmuch effort in my opinion.\n\nHowever, they were quite tasty. Nicely crunchy yet light. We slathered some\npeanut butter and munched on a few macaron, or I guess in my case\nmacaron-adjacents.\n\n\n\n\n\n(Yes yes I know I spelled it wrong... I got so excited that I had finally ALMOST\nachieved macarons that I didn't even realize it until just now)","feature_image":"https://lh3.googleusercontent.com/psvMMMMKicZM9X0pohp9fQBgouR0PAdsVyFjhqQcS-vn=w1976-h1316-no","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c289","name":"victory","slug":"victory"},{"id":"5c47a6f22037ef002282c28a","name":"almonds","slug":"almonds"},{"id":"5c47a6f22037ef002282c28c","name":"macaron","slug":"macaron"},{"id":"5c47a6f22037ef002282c28d","name":"peanut butter","slug":"peanut-butter"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36e","uuid":"cec5c08a-2215-415c-873a-bafb4bfd7d1f","title":"Pardon My French, But **** that ****","slug":"pardon-my-french","published_at":"30 June, 2015","plaintext":"So this weekend, I had a grand plan of being all fancy and making macarons.\n\n(Yea I looked it up... apparently macarons and macaroons are two VERY different\nthings as this adorable diagram shows)\n\n\n\nI've honestly never eaten one but I always thought they looked so adorable! And\nI figured if I made them all blue and yellow then all the better... GO BLUE! I\nlooked at the recipe, saw the ingredients and was confident that this dessert\nwas within my range of baking abilities. In fact, I was SO confident that I\ncalled a friend of mine to come over and reap the benefits of my baking!\n\nClearly such confidence could only yield brilliant results.\n\nWRONG\n\nMaking macarons is a very delicate process that requires a lot more patience and\nskill than I had ever anticipated! And for that very reason, the adorable\nmacarons I had been picturing in my head came out like this.\n\n\n\nExactly like you picture macarons in French Patisseries right?! I know... I was\njust as disappointed as you. It basically became some strange almond flavored\nfruit roll ups. Not at all appetizing. Now there was another problem... I had a \nTON  of almond batter that clearly wasn't going to make macarons and no idea\nwhat to do with it. My cousin saved my ass and suggested I just convert them\ninto almond cupcakes.\n\nHonestly, I think it was my disappointment at failing to make macrons but I half\nheartedly made these cupcakes. So much so that I didn't even bother with my\nusual photo shoot of the final masterpiece. I have absolutely no photos of what\nthey turned out to look like. Nada. Zilch. But imagine they looked something\nlike this except light yellow and blue with little almond specs all inside.\n\n\n\nThey weren't especially sweet cupcakes so I figured they needed some kind of\ntopping to balance out the flavors. I went back and made some of my handy\ncaramel bourbon sauce, which is just melted caramel, a little water, and some \nCaramel Southern Comfort [http://www.southerncomfort.com/age?ref=caramel]. First\noff, it's heavenly and just a little boozy. Secondly, it basically takes you 2\nminutes to make.\n\nFinally having somewhat salvaged this disaster, I took the box of what I thought\nwas my failures to work. After keeping it out in the lounge area, I quickly\nlearned that the combination of almond cupcakes with caramel bourbon sauce\nworks.... like really  works.\n\nAnyways, here's what I think was the makeshift cupcake recipe. More or less...\n\n\"Macaron\" Almond Cupcakes\nIf the consistency doesn't seem like normal cupcake batter, add more flour. I\nkinda estimated the amounted needed and had to add more to my batter. But that\nmay have only been because I was adapting from a macaron recipe.\n Ingredients:\n2/3 cup ground almonds\n 1 1/2 cups powdered sugar\n 3 large egg whites\n 5 tbsp granulated sugar\n 1 tsp vanilla extract\n 2 tsp baking powder\n 2 cups flour\n 1/2 cup melted butter\n 1 cup milk\n Directions:\nPreheat the oven to 375 degrees. Spray the cupcake pan with cooking spray and\nkeep it aside.\n\nMix butter and sugar together and then beat in egg whites. Mix in the flour,\nground almonds, and baking powder. Add in milk and vanilla and beat well. Pour\nbatter into pan and bake for about 15 minutes or until you can poke a cupcake\nwith a knife or toothpick and it comes out clean.","feature_image":"https://s-media-cache-ak0.pinimg.com/736x/82/15/ae/8215ae44e248f2901f8b6205b2c1cdd3.jpg","tags":[{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c27f","name":"macarons","slug":"macarons"},{"id":"5c47a6f22037ef002282c286","name":"almond","slug":"almond"},{"id":"5c47a6f22037ef002282c287","name":"fail","slug":"fail"}]}}]}},"pageContext":{"limit":6,"skip":36,"numPages":10,"currentPage":7}}