{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c358","uuid":"9e154487-bd40-42d8-b6a9-c7b35fe895a0","title":"DAMN SON, Those are Some Seriously Loaded Fries","slug":"damn-son-those-are-some-seriously-loaded-fries","published_at":"10 March, 2015","html":"<p><img src=\"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg\" alt=\"\"></p>\n<p>For the few weeks, I've been bored at home while my parents are away at work. I've been taking some time off between graduation and when I start work next month. So when one of my friends was also bored at home during her spring break, she decided to come over and join me in being a bum for a day. And what better food to have while lazing around then some Mexican loaded fries.</p>\n<p><img src=\"https://farm9.staticflickr.com/8616/16520615948_6bcba795e9_b.jpg\" alt=\"\"></p>\n<p>Feel free to use sour cream instead of ranch or even add guacamole and other toppings you usually put on nachos! We didn't really want to leave the house and go grocery shopping, so we went with whatever was in the fridge. I usually make my own mexican seasoning, but feel free to replace the spices with a store bought seasoning if you want.</p>\n<p><img src=\"https://farm9.staticflickr.com/8585/16708189875_07f14b40ee_b.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>Mexican Loaded Fries</h2>\n    <div class=\"summary\">\n      <p><em>This is a very rough recipe. Feel free to throw in whatever you feel would taste best!</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n        <li class=\"ingredient\">½ bag of fries (I used crinkle cut)</li>\n        <li class=\"ingredient\">ranch (or sour cream)</li>\n        <li class=\"ingredient\">as much shredded cheese as you want</li>\n      \t<h4>Refried Beans</h4>\n        <li class=\"ingredient\">1 can black beans</li>\n        <li class=\"ingredient\">1½ teaspoons cumin powder</li>\n        <li class=\"ingredient\">1 teaspoon paprika</li>\n        <li class=\"ingredient\">salt to taste</li>\n        <li class=\"ingredient\">cayenne pepper to taste</li>\n        <li class=\"ingredient\">chili lime hot sauce to taste (optional)</li>\n      \t<h4>Pico De Gallo Salsa</h4>\n        <li class=\"ingredient\">3 roma tomatoes diced</li>\n        <li class=\"ingredient\">½ large onion diced</li>\n        <li class=\"ingredient\">juice of ½ a lime</li>\n        <li class=\"ingredient\">salt to taste</li>\n        <li class=\"ingredient\">few sprigs of cilantro </li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p><strong>Refried Beans:</strong> Pour the black beans onto a skillet on the stove. Add all of the spices and keep stirring until the beans are soft and are super flavorful.</p>\n        <p><strong>Salsa:</strong>Mix all the ingredients in a bowl and let it sit so that the salt and lime can bring out the flavor in the tomatoes.</p>\n        <p>Bake the fries according to the directions on the packet. When the fries are done, don't turn off the oven. Top with the bean mixture and sprinkle all the cheese that your heart desires. Bake the topped fries in the oven until the cheese has melted. Take out the fries and top with salsa and ranch. Dig in!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm9.staticflickr.com/8643/16500861107_eaf23d7f64_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8578/16706850181_8b7f0f3366_b.jpg\" alt=\"\"></p>\n","feature_image":"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","name":"salsa","slug":"salsa"},{"id":"5c47a6f22037ef002282c25f","name":"beans","slug":"beans"},{"id":"5c47a6f22037ef002282c260","name":"appetizers","slug":"appetizers"},{"id":"5c47a6f22037ef002282c261","name":"loaded","slug":"loaded"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c34d","uuid":"7021b7b8-3bef-4bf1-ab64-7a42245fdc06","title":"Taco Tuesday!","slug":"taco-tuesday","published_at":"10 February, 2015","html":"<p><img src=\"https://farm8.staticflickr.com/7390/16401090985_f2b567095e_b.jpg\" alt=\"\"></p>\n<p>One of the coolest thing about restaurants and coffee shops that open franchises internationally is that they tend to adapt their menu to the tastes of the country the store is in. For example, McDonald's in India actually has completely vegetarian options. Due to the <strong>large</strong> population of vegetarians in India, McDonald's has 2 segregated kitchens for vegetarian and non-vegetarian food. In addition, they don't serve any beef items, in contrast to the McDonald's in the US, which is primarily beef burgers. Honestly, I love McDonald's in India! They've managed to merge Indian flavors into simple American burgers and come out with amazing dishes such as the McSpicy Paneer and McAloo Tiki Burger. If you haven't yet, you should definitely try the McSpicy Paneer Burger, it's my favorite! :)</p>\n<p><img src=\"https://farm8.staticflickr.com/7447/16213447308_f042572573_b.jpg\" alt=\"\"></p>\n<p>My cousin recently had a major craving for Mexican food. The only problem is that we're in India and the Mexican food available doesn't taste quite the same nor as authentic. In order to quench our cravings, we even tried going to Taco Bell, which has a new item called the Paneer Tikka Masala Burrito! Unfortunately the menu had been too Indianized and no longer tasted Mexican. While this style of Taco Bell is very popular with people in India, it doesn't quite measure up to the Taco Bell we have in the US.</p>\n<p><img src=\"https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/p240x240/10500572_10153058890499813_8118498097049613786_n.jpg?oh=045ce9ccadee439cd72f5918fcb7bb3e&amp;oe=55583775&amp;__gda__=1431596238_63eebcd5fe7f4c135a000227d439d70b\" alt=\"\"></p>\n<p>Our best bet was to figure out how to make it our selves. Unfortunately we did run into a few bumps along the road:</p>\n<ol>\n<li>It is a lot harder to find iceberg lettuce in Bangalore than originally suspected. Iceberg lettuce isn't really in any kind of Indian food therefore only available at some special markets rather than on every street vegetable cart.</li>\n</ol>\n<p><img src=\"https://farm8.staticflickr.com/7448/16375097256_ab5794a54c_b.jpg\" alt=\"\"></p>\n<ol start=\"2\">\n<li>Many people tend to substitute dahi for sour cream out of convenience, however, this doesn't have quite the same taste. Conveniently, we found a fairly easy <a href=\"http://www.tarladalal.com/Sour-Cream-(--Wraps-and-Rolls)-32623r\">recipe</a> on how to make our own homemade sour cream! <a href=\"http://www.tarladalal.com\">Tarla Dalal</a> to the rescue!</li>\n</ol>\n<p><img src=\"https://farm9.staticflickr.com/8601/16400164382_73d99cfb83_b.jpg\" alt=\"\"></p>\n<ol start=\"3\">\n<li>Making the refried beans for the tacos ended up being extremely time consuming. If I had been in the US, I could have just bought a can of beans, cooked them with some cumin and cayene pepper and been done with it. I completely took for granted the preparation needed to make refried beans. First you needed to soak and cook the beans until they were soft, and then cook them in a pan with the appropriate seasoning. This took much longer than I had originally expected.</li>\n</ol>\n<p><img src=\"https://farm8.staticflickr.com/7400/15778603364_95408ed417_b.jpg\" alt=\"\"></p>\n<p>We realized even making tortillas by hand wouldn't be so bad. Every morning, the cook at my grandparents house makes chapatis from scratch. Tortillas are esentially chapatis made from normal flour, not wheat. So my grandmother quickly whipped up a huge ball of dough for us to roll out and make into tortillas.</p>\n<p><img src=\"https://farm9.staticflickr.com/8588/16213679700_5c8738a6f2_b.jpg\" alt=\"\"><br>\n<img src=\"https://farm9.staticflickr.com/8606/16375090146_29515989da_b.jpg\" alt=\"\"><br>\n<img src=\"https://farm8.staticflickr.com/7404/16214852339_c9de429d99_b.jpg\" alt=\"\"></p>\n<p>No taco would be complete without salsa! We made 2 different types of salsa, corn with jalapenos and pico de gallo salsa. Both salsas are extremely easy to make. For the corn salsa, you just need to combine boiled sweet corn kernels, diced jalapenos, lemon juice, salt, and some cilantro. Mix it together and viola! You have salsa. Similarly, if you mix diced tomatoes and onions, minced garlic, cilantro, and lemon juice you get pico de gallo salsa. Both can be made very quickly and are fresh and delicious!</p>\n<p><img src=\"https://farm8.staticflickr.com/7299/16375094646_260f9aa406_b.jpg\" alt=\"\"><br>\n<img src=\"https://farm8.staticflickr.com/7444/15781043603_80df9ccbbd_b.jpg\" alt=\"\"></p>\n<p>Surprisingly everything turned out really tasty and me and my cousin happily enjoyed delicious Mexican food for the next 2 days! :) My cousin loved it so much, she ate it for breakfast, lunch, AND dinner for the next 2 days. Mission Success!</p>\n<p><img src=\"https://farm8.staticflickr.com/7450/16401091685_d0ed039ea7_o.jpg\" alt=\"\"></p>\n","feature_image":"https://farm8.staticflickr.com/7450/16401091685_d0ed039ea7_o.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c244","name":"tacos","slug":"tacos"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"}]}}]}},"pageContext":{"slug":"mexican","limit":6,"skip":6,"numPages":2,"currentPage":2}}