{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c363","uuid":"5cdd2872-7005-4df6-a0a5-35ffb4b52dc1","title":"A Quick Recipe Fix (Numero Uno)","slug":"recipes","published_at":"11 April, 2016","plaintext":"So I haven't been cooking much lately, but I have been reading a ton of recipes\nfor when I get my life back post-finals! So, I'm starting a new feature! The\n\"Quick Recipe Fix\" - your dose of some of my favorite recipes that I've found on\nthe interwebs.\n\n\n\nEnjoy the recipes, and cut me some slack, internet. I've been busy :)\n\n1.) Love and Lemons is one of my favorite food blogs; they have gorgeous\npictures, and I love their fresh approach to food. They have a cookbook out\nright now that everyone should totally get. I'm also waiting for the day when I\ncan try this recipe for Chickpea Flour Pizza Crust\n[http://www.loveandlemons.com/chickpea-flour-pizza-asparagus/?utm_source=feedly&utm_medium=webfeeds] \n because YUM.\n\n2.) Minimalist Baker hits it out of the park every time. They have a real talent\nfor finding fresh, simple recipes with easy (and short!) cleanup! Check out\ntheir recipe for Gingery Thai Kale Salad with Cashew Dressing\n[http://minimalistbaker.com/gingery-thai-kale-salad-cashew-dressing/]\n\n3.) I love Annie's Eats, especially her cocktail posts! Now that summer's\ncoming, it's time to turn out minds to summertime cocktails, and there's\nsomething about this Gin, Grapefruit, and Rosemary Cocktail\n[http://www.annies-eats.com/2016/03/25/gin-grapefruit-and-rosemary-cocktail/] \nthat feels delightfully spring-y.\n\n4.) Smitten Kitten is incredibly prolific; they do an amazing job of posting\nsuper frequently with high quality recipes! Here's one of there's that I'm\npretty sure is an Italian sort of Shakshouka Eggs in Purgatory, Puttanesca-Style\n[http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/].\n\n5.) The Beeroness is one of my favorite people on the internet. All of her\nrecipes are accompanied by great stories about her life, and the food itself is\nnothing to sneeze at. If you're a beer lover OR a food lover, you'll love her\nblog; right now, I really want to try her Grilled Garlic-Beer Flatbread\n[http://smittenkitchen.com/blog/2016/03/eggs-in-purgatory-puttanesca-style/].\n\nEnjoy the recipes, and if you get a chance to try them before I do (super\nlikely) let me know how it goes!","feature_image":"https://pramods.box.com/shared/static/75ycreg8gpwyyvfdmpmdtiomxiop1sg4.jpg","tags":[{"id":"5c47a6f22037ef002282c26b","name":"food truck","slug":"food-truck"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c314","name":"loving lately","slug":"loving-lately"},{"id":"5c47a6f22037ef002282c315","name":"favorite blogs","slug":"favorite-blogs"},{"id":"5c47a6f22037ef002282c316","name":"yum","slug":"yum"}]}}]}},"pageContext":{"slug":"loving-lately","limit":6,"skip":0,"numPages":1,"currentPage":1}}