{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c340","uuid":"279e49d2-aba1-4211-82c1-089cbd2da209","title":"Gaadi Chaats","slug":"bread","published_at":"08 February, 2016","html":"<p>Welcome to another trip to India! When I was there, I ate a ton of food. All of my family members were happy to feed me, and between the amazing home cooking, and the delicious food available on every street corner, it's almost a miracle that I didn't pack on pounds.</p>\n<p>I am, generally, pretty picky about my food. I waver between being vegan and vegetarian, and I'm usually pretty careful about ingredients I allow in my kitchen. But, like everyone else, I have a fatal flaw and it's this; I love street food.</p>\n<p>I know that someone involved didn't wash their hands, I know that the ingredients aren't always top notch, I know that the fat, salt, and sugar content is probably WAY higher than anything I should be consuming. But I don't particularly care.</p>\n<p>In India a &quot;gaadi&quot; is a vehicle, and &quot;chaat&quot; is street food that has fresh vegetable, puffed rice, sweet and spicy sauces, and some fried components. So &quot;gaadi chaat&quot; is street food you get out of a flat bed cart.</p>\n<p>In Bangalore, there's a street people refer to as &quot;chaat street,&quot; and the street is lined with street food vendors. One end has a bakery, and the other end (the end I like to start on) has a few fruit carts, and one &quot;corn&quot; cart. I usually get my corn spiced with salt and chili, and mixed with raw, unripe mangoes (delicious!)</p>\n<p><img src=\"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg\" alt=\"imagine yummy food here, cuz you're missing it!\"></p>\n<p>Then it's time for Masala Chaat! This is one of my absolute favorites; it features a thick, spicy lentil soup layered atop crispy, crackly puris (indian &quot;chips&quot; and under sweet and spicy chutney, some fresh onion and cilantro, and a sprinkle of &quot;chaat masala.&quot;</p>\n<p><img src=\"https://pramods.box.com/shared/static/gmg1xnscaj3hsaqurjkezft7d1pn8rbj.jpg\" alt=\"\"></p>\n<p>It's The Chaat Shop!</p>\n<p>Next up: Gobi Manchurian. Cauliflower dipped in dough and deep fried, then dredged in fresh onion and cilantro, and delicious, spicy, tomato-ey garlic-y sauces.</p>\n<p><img src=\"https://pramods.box.com/shared/static/oolk1yrswjqb9wmq7piboh797nv9lkii.jpg\" alt=\"\"></p>\n<p>This is the Gobi Manchurian man! He also makes noodles. He is obviously supremely talented.</p>\n<p>Now that you're ALMOST too full (because you've eaten your way down the street) it's time for dessert! There's a bakery you can step into, vendors with all kinds of sweets and shaved ice, and (my personal favorite) Mango Kulfi!</p>\n<p><img src=\"https://pramods.box.com/shared/static/g5tfhr9guqtbm7tlinl65rw3eqdczkk8.jpg\" alt=\"\"></p>\n<p>Go to bed. It's been a long day, and you're long overdue for a satisfying food coma.</p>\n","feature_image":"https://pramods.box.com/shared/static/zw9hrme823kt4bmwzy4plu5w9jcwdkmz.jpg","tags":[{"id":"5c47a6f22037ef002282c2d5","name":"chaat","slug":"chaat"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c2d6","name":"street food","slug":"street-food"}]}}]}},"pageContext":{"slug":"chaat","limit":6,"skip":0,"numPages":1,"currentPage":1}}