{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c370","uuid":"d9ce1d74-5a37-463a-8cb8-d33efe58626f","title":"The Love Child of Pumpkin Pie and Tiramisu","slug":"the-love-child-of-pumpkin-pie-and-tiramisu","published_at":"27 February, 2015","plaintext":"\n\nThanksgiving in our house is quite different that the traditional American\nThanksgiving. First off, there's no turkey. Secondly, my mom\n[http://uppukhara.com]  makes a glorious display of Thanksgiving inspired Indian\ndishes! From masala dosa with cranberry chutney to stuffing upma (or bread upit)\nand spicy herb yams, we always enjoy a large variety of dishes. The only thing I\npersonally demand every year is pumpkin pie! I love pumpkin pie. The wonderful\nblend of spices and sweet, and yet it's not that sweet; perfect for someone\nwithout a strong sweet tooth!\n\nWhat do you get when you combine two of my favorite desserts in the world,\npumpkin pie and tiramisu? Basically, it's one of the greatest desserts ever\ncreated by man. I was a little skeptical about how well this combination of\nflavors would be received by all of our thanksgiving guests, but it was a hit.\nEven without adding the usual brandy, rum, or amaretto, everyone loved the\nwonderful blend of flavors.\n\nOne warning I have about this recipe is that you should be careful in blending\nthe cornstarch mixture into the pumpkin creme. If this step is not done\nproperly, you will have cornstarch lumps in your tiramisu and that is just\ngross.\n\n\n\n\n\n\n\nPumpkin Tiramisu\nRecipe modified from\nhttp://www.nytimes.com/projects/well/vegetarian-recipes/#recipe/pumpkin-tiramisu\n\nIngredients:\nPumpkin Creme\n⅓ cup cornstarch\n ¼ cup water\n ¾ cup milk\n 1 (15-ounce) can pumpkin puree\n ¾ cup maple syrup\n ¾ teaspoon allspice\n ¾ teaspoon cinnamon\n ¾ teaspoon nutmeg\n ½ teaspoon salt\n Tiramisu\n1 pot black coffee\n 1 package lady finger biscuits\n 16oz mascarpone cheese\n ground chocolate for garnishing\n Directions:\nTo make the Pumpkin Creme:  In a small bowl, thoroughly mix cornstarch and water\nwith a whisk or fork until there are NO LUMPS  and set aside. In a medium\nsaucepan, whisk together milk, pumpkin puree, maple syrup, spices and salt, and\nheat over medium heat until it just begins to boil, about 5 minutes. Slowly\ndrizzle cornstarch mixture into the saucepan, whisking continuously. Cook until\nthe mixture becomes very thick, about 5 minutes, whisking frequently. Pour the\ncreme into a bowl and let cool about 15 minutes. Cover the bowl with plastic\nwrap so that the plastic wrap is touching the top of the creme. Refrigerate for\na few hours or overnight.\n\nTo assemble:  Soak each lady finger biscuit in coffee for a few seconds and\nquickly place in a large dish. Spread a layer of Pumpkin Creme on top. Repeat\nthis process for as many layers fill up the dish or all the components run out.\nAlternate spreading a layer of Pumpkin Creme and mascarpone cheese between\nlayers of biscuit.","feature_image":"https://farm8.staticflickr.com/7398/16297798177_79beaa8237_o.jpg","tags":[{"id":"5c47a6f22037ef002282c238","name":"tiramisu","slug":"tiramisu"},{"id":"5c47a6f22037ef002282c240","name":"pumpkin","slug":"pumpkin"},{"id":"5c47a6f22037ef002282c241","name":"thanksgiving","slug":"thanksgiving"},{"id":"5c47a6f22037ef002282c24b","name":"pumpkin pie","slug":"pumpkin-pie"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}}]}},"pageContext":{"slug":"thanksgiving","limit":6,"skip":0,"numPages":1,"currentPage":1}}