{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37a","uuid":"38072c55-2abc-41d8-8cd1-7c995002e516","title":"Little Bites of Heaven","slug":"little-bites-of-heaven","published_at":"05 May, 2015","html":"<p><img src=\"https://farm9.staticflickr.com/8772/17361867465_b5793fb7f7_b.jpg\" alt=\"\"></p>\n<p>I LOVE baking but since I don't really like eating desserts its usually pretty hard to come up with reasons to actually make anything. I usually just end up making really small quantities which barely justifies all the ingredients I would have needed to get to make the desserts. At work I noticed that anytime someone brought in donuts or anything else, people would hunt the food down and devour it. Figuring this the was the best opportunity to kill two birds with one stone, so I whipped up a few batches of the brownies and brought them to work.</p>\n<p>First, I sent an email to my team and only a few people grabbed some. I thought I had made a complete mistake making so many brownies, or maybe I was delusional about how the brownies tasted since I had made them. As a last option, I sent an email out to the whole company and left them in the common area of my floor. Twenty minutes later when I went to go check on them, I saw an empty box. Clearly the brownies had been a huge hit! Now that I've found the perfect group to sample all of my treats, I can bake without worries! My coworkers can expect a flood of baked goods at least once a month from here on out while I use them as guinea pigs for all the different desserts I've always wanted to make! :)</p>\n<p><img src=\"https://farm8.staticflickr.com/7711/17154413587_86e925b5aa_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7766/16741602133_ec8f6f5fc7_b.jpg\" alt=\"\"></p>\n<p>Personally, I'm not a huge fan of cheesecake, but these little bites are amazing. At first when I bit into one, it was perfectly gooey and chocolatey and with a little bit of cheesecake to top off the flavor. I honestly wasn't sure if I hadn't cooked them all the way, but after thoroughly inspecting and devouring a few, I realized that that's just the way the brownies cook! Each brownie was perfectly gooey yet filled with flavors just melting in your mouth. The cheesecake portion was the perfect compliment for the sweetness of the brownies. Try the recipe yourself and let me know how you like it!</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2>Chocolate Chip Cheesecake Brownie Bites</h2>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <h4>Brownie Part:</h4>\n      <li class=\"ingredient\">¾ cup melted unsalted butter</li>\n      <li class=\"ingredient\">1¼ cup sugar</li>\n      <li class=\"ingredient\">1 cup unsweetened cocoa powder</li>\n      <li class=\"ingredient\">¼ tsp salt</li>\n      <li class=\"ingredient\">1 tsp vanilla extract</li>\n      <li class=\"ingredient\">2 large eggs</li>\n      <li class=\"ingredient\">½ cup all-purpose flour</li>\n      <li class=\"ingredient\">¾ cups semi-sweet chocolate chips</li>\n      <h4>Cheesecake Part:</h4>\n      <li class=\"ingredient\">8 oz softened cream cheese</li>\n      <li class=\"ingredient\">½ cup sugar</li>\n      <li class=\"ingredient\">¼ tsp vanilla extract</li>\n      <li class=\"ingredient\">1 egg yolk</li>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Preheat the oven to 350 degrees. Spray the cupcake pan with cooking spray and keep it aside. I used a mini cupcake pan but feel free to use a normal size cupcake pan if you want bigger brownies!</p>\n        <p><strong>Brownie Part: </strong>Mix the cocoa, sugar, salt, melted butter, and vanilla together. Mix the eggs into this mixture until the batter is fully mixed. Add the chocolate chips (more if you want it super chocolatey :D) and keep aside.</p>\n        <p><strong>Cheesecake Part: </strong>In a separate bowl, mix all the cheesecake ingredients together until smooth.</p>\n        <p>Fill each well in your cupcake pan ¾ full with brownie batter. Add a spoonful of cheesecake batter on top of the brownie batter in each well and swirl the cheesecake and brownie parts together! Put the pan in the oven and bake for about 20 minutes (I used a 24 mini cupcake pan so it was 20 minutes for me but if you have use a smaller/larger pan adjust the time accordingly). </p>\n      </div>\n    </div>\n  </div>\n</div>\n<p><img src=\"https://farm9.staticflickr.com/8770/16741596333_b8c6088247_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8887/17335899916_10f36cfbeb_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm8.staticflickr.com/7699/17335896446_efebc5dfbc_b.jpg\" alt=\"\"></p>\n","feature_image":"https://farm9.staticflickr.com/8772/17361867465_b5793fb7f7_b.jpg","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c272","name":"cheesecake","slug":"cheesecake"},{"id":"5c47a6f22037ef002282c273","name":"brownies","slug":"brownies"},{"id":"5c47a6f22037ef002282c274","name":"mini","slug":"mini"},{"id":"5c47a6f22037ef002282c275","name":"swirl","slug":"swirl"}]}}]}},"pageContext":{"slug":"swirl","limit":6,"skip":0,"numPages":1,"currentPage":1}}