{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"ghostPost":{"title":"Started From the Batter, Now We're Here.","slug":"started-from-the-batter-now-were-here","feature_image":"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg","published_at":"28 January, 2016","html":"<p>I know. I know. The title and the song I'm telling you to listen while reading this post don't match, but I felt I needed to up my Drake game a bit. Plus, now every time I think of Drake, I picture him <a href=\"https://youtu.be/uxpDa-c-4Mc\">doing his little &quot;dance&quot;</a> over and over again. It brings me a <strong>LOT</strong> of joy. I also love the <a href=\"https://www.youtube.com/watch?v=cjeORm4LMDk\">SNL parody of it</a> but that's not really relevant.</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:6nmz4imkDcmtwMjocAzFSx\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>First off, <strong>HAPPY NATIONAL CHOCOLATE CAKE DAY</strong>! I was not aware that this was an <em>ACTUAL</em> holiday but I'm not gonna complain. I firmly believe that everyday should be National Chocolate Cake Day! But hey, I'll take one day a year.</p>\n<p>Second, it's your lucky week! You get TWO whole posts from me! I've been sick since Sunday, so I've been vegetating on my couch, watching a few too many chick flicks, all whilst drinking the world's supply of ginger chai <a href=\"http://cookinginpjs.com/an-ode-to-chai/\">(hence my caffeine-fueled poem on Sunday which you should also totally read and appreciate)</a>.</p>\n<p>So, let's get to it!</p>\n<p>As the self-designated baker for my friend group, I've been baking birthday cakes for pretty much everyone. I've been trying to tailor each cake to something either they've specifically requested or what I think they would enjoy. This cake in particular was for one of my friends who loves whiskey. Her only requirement was that, and I quote, &quot;I do not kill her.&quot; I took it as a challenge in that I was going to put as much alcohol as possible in the cake while retaining its ability to taste good.</p>\n<p>Three things happened with this:</p>\n<ol>\n<li>I made a deliciously boozy cake</li>\n<li>I finished a LOT of the whiskey bottle I bought for this very specific purpose.</li>\n<li>I ended up getting fairly tipsy after a few batter taste tests</li>\n</ol>\n<p><em>I also feel like I should include a warning: raw batter means raw eggs which also means the potential for salmonella. So be careful not to eat spoonfuls of your cake batter! That could get you very sick. Enjoy responsibly ;)</em></p>\n<p>Honestly, I'd say it was a completely successful experience. I totally recommend making boozy desserts to everyone (of legal age of course). :P Just don't expect to be productive after you put the cake in the oven. I had absolutely no attention span once I set that cake to bake. I ended up making one GIANT cake for my friend, another little one for the rest of us to enjoy on our own, and a few cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the cupcakes were gone within 20 minutes of me sending an email announcing the arrival of whiskey cupcakes. I'm now officially known as the dessert lady at work.</p>\n<p><img src=\"https://pramods.box.com/shared/static/zh4hcqy50kwhftm3na4bh6oy0944s31z.jpg\" alt=\"\"></p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Chocolate Whiskey Cake</h2>\n    <div class=\"summary\">\n      <p><em>Feel free to increase/decrease the amount of whiskey according to your taste/tolerance. Just make sure to adjust the flour accordingly so your cake batter isn't too liquidy. The general rule is for each extra tablespoon of Whiskey that you add, add an extra 2 tablespoons of flour to compensate.</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">2 1/2 cups flour</li>\n          <li class=\"ingredient\">3/4 cups dark cocoa powder</li>\n          <li class=\"ingredient\">2 cups granulated sugar</li>\n          <li class=\"ingredient\">2 tsp baking soda</li>\n          <li class=\"ingredient\">1 tsp baking powder</li>\n          <li class=\"ingredient\">1 tsp salt</li>\n          <li class=\"ingredient\">2 large eggs</li>\n          <li class=\"ingredient\">1/2 cup strong black coffee (chilled)</li>\n          <li class=\"ingredient\">1 cup whiskey</li>\n          <li class=\"ingredient\">1 cup buttermilk</li>\n          <li class=\"ingredient\">1/2 cup vegetable oil</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>If your coffee isn't chilled, then make sure to put it in your freezer to speed up that process. Otherwise the eggs will cook when you add the coffee to it. Set your oven to preheat at 350 degrees.</p>\n        <p>Whisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the coffee is chilled, whisk that in as well.</p>\n        <p>In a separate bowl, stir the flour, cocoa powder, baking soda, baking powder, and salt together. Slowly pour the wet ingredients into the bowl with all the dry ingredients. Make sure to keep stirring while you pour.</p>\n        <p>Whisk until smooth. Taste to make sure the whiskey level is right. If not add more whiskey/flour accordingly.</p>\n        <p>Spray your cake pan (or place cupcake liners in your cupcake pan if you're making cupcakes) and pour in the batter. Set your timer for about 25-30 minutes (or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick (something that can reach fairly deep inside the cake). If it comes out clean, you're done! Cool the cake in the pan for 15 minutes, frost and devour!</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p>I did get lazy when it came to the frosting and just bought some chocolate frosting from the store. I felt it might be a little TOO much if I spiked that too, so I just spread shit tons of frosting on top of the cake/cupcakes and ate it. I'd say that was the better choice! If you're going easy on the whiskey inside the cake itself (or in the words of my friend, &quot;are being a little bitch&quot;), then maybe you can spike the frosting. Otherwise you've got enough alcohol in there to get the deed done.</p>\n<div class=\"container\">\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-2.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-3.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-10.w529.h352.2x.gif\"></div>\n</div>\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-15.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-9.w529.h352.2x.gif\"></div>\n</div>\n<div class=\"row\">\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-11.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-12.w529.h352.2x.gif\"></div>\n<div class=\"one-third column\"><img src=\"http://pixel.nymag.com/imgs/daily/vulture/2015/10/20/drake-dance/drake-13.w529.h352.2x.gif\"></div>\n</div>\n</div>\n<p>Yes. You know you needed all these gifs right now. Don't lie to yourself. I'm pretty sure I just stared at this gif collection for a good 5 minutes, at least. You're welcome.</p>\n<p><img src=\"https://pramods.box.com/shared/static/9upgp2c5wpbpedkokxisgwnalior9lbz.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/kn2i1aq1mhs3jkmokp3139lxcu9r2xxj.jpg\" alt=\"\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/rthr66f7x6q8wymqa98yafvbah7hklcv.jpg\" alt=\"\"></p>\n","plaintext":"I know. I know. The title and the song I'm telling you to listen while reading\nthis post don't match, but I felt I needed to up my Drake game a bit. Plus, now\nevery time I think of Drake, I picture him doing his little \"dance\"\n[https://youtu.be/uxpDa-c-4Mc]  over and over again. It brings me a LOT  of joy.\nI also love the SNL parody of it [https://www.youtube.com/watch?v=cjeORm4LMDk] \nbut that's not really relevant.\n\nFirst off, HAPPY NATIONAL CHOCOLATE CAKE DAY! I was not aware that this was an \nACTUAL  holiday but I'm not gonna complain. I firmly believe that everyday\nshould be National Chocolate Cake Day! But hey, I'll take one day a year.\n\nSecond, it's your lucky week! You get TWO whole posts from me! I've been sick\nsince Sunday, so I've been vegetating on my couch, watching a few too many chick\nflicks, all whilst drinking the world's supply of ginger chai (hence my\ncaffeine-fueled poem on Sunday which you should also totally read and\nappreciate) [http://cookinginpjs.com/an-ode-to-chai/].\n\nSo, let's get to it!\n\nAs the self-designated baker for my friend group, I've been baking birthday\ncakes for pretty much everyone. I've been trying to tailor each cake to\nsomething either they've specifically requested or what I think they would\nenjoy. This cake in particular was for one of my friends who loves whiskey. Her\nonly requirement was that, and I quote, \"I do not kill her.\" I took it as a\nchallenge in that I was going to put as much alcohol as possible in the cake\nwhile retaining its ability to taste good.\n\nThree things happened with this:\n\n 1. I made a deliciously boozy cake\n 2. I finished a LOT of the whiskey bottle I bought for this very specific\n    purpose.\n 3. I ended up getting fairly tipsy after a few batter taste tests\n\nI also feel like I should include a warning: raw batter means raw eggs which\nalso means the potential for salmonella. So be careful not to eat spoonfuls of\nyour cake batter! That could get you very sick. Enjoy responsibly ;)\n\nHonestly, I'd say it was a completely successful experience. I totally recommend\nmaking boozy desserts to everyone (of legal age of course). :P Just don't expect\nto be productive after you put the cake in the oven. I had absolutely no\nattention span once I set that cake to bake. I ended up making one GIANT cake\nfor my friend, another little one for the rest of us to enjoy on our own, and a\nfew cupcakes for my coworkers to enjoy. I kid you not, I was swarmed and the\ncupcakes were gone within 20 minutes of me sending an email announcing the\narrival of whiskey cupcakes. I'm now officially known as the dessert lady at\nwork.\n\n\n\nChocolate Whiskey Cake\nFeel free to increase/decrease the amount of whiskey according to your\ntaste/tolerance. Just make sure to adjust the flour accordingly so your cake\nbatter isn't too liquidy. The general rule is for each extra tablespoon of\nWhiskey that you add, add an extra 2 tablespoons of flour to compensate.\n\nIngredients:\n2 1/2 cups flour\n 3/4 cups dark cocoa powder\n 2 cups granulated sugar\n 2 tsp baking soda\n 1 tsp baking powder\n 1 tsp salt\n 2 large eggs\n 1/2 cup strong black coffee (chilled)\n 1 cup whiskey\n 1 cup buttermilk\n 1/2 cup vegetable oil\n Directions:\nIf your coffee isn't chilled, then make sure to put it in your freezer to speed\nup that process. Otherwise the eggs will cook when you add the coffee to it. Set\nyour oven to preheat at 350 degrees.\n\nWhisk the eggs, whiskey, buttermilk, and oil together in one bowl. Once the\ncoffee is chilled, whisk that in as well.\n\nIn a separate bowl, stir the flour, cocoa powder, baking soda, baking powder,\nand salt together. Slowly pour the wet ingredients into the bowl with all the\ndry ingredients. Make sure to keep stirring while you pour.\n\nWhisk until smooth. Taste to make sure the whiskey level is right. If not add\nmore whiskey/flour accordingly.\n\nSpray your cake pan (or place cupcake liners in your cupcake pan if you're\nmaking cupcakes) and pour in the batter. Set your timer for about 25-30 minutes\n(or 18-21 minutes for cupcakes) and wait! Poke the cake with a fork or toothpick\n(something that can reach fairly deep inside the cake). If it comes out clean,\nyou're done! Cool the cake in the pan for 15 minutes, frost and devour!\n\nI did get lazy when it came to the frosting and just bought some chocolate\nfrosting from the store. I felt it might be a little TOO much if I spiked that\ntoo, so I just spread shit tons of frosting on top of the cake/cupcakes and ate\nit. I'd say that was the better choice! If you're going easy on the whiskey\ninside the cake itself (or in the words of my friend, \"are being a little\nbitch\"), then maybe you can spike the frosting. Otherwise you've got enough\nalcohol in there to get the deed done.\n\nYes. You know you needed all these gifs right now. Don't lie to yourself. I'm\npretty sure I just stared at this gif collection for a good 5 minutes, at least.\nYou're welcome.","tags":[{"id":"5c47a6f22037ef002282c242","name":"giggle juice","slug":"giggle-juice"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c28b","name":"chocolate","slug":"chocolate"},{"id":"5c47a6f22037ef002282c281","name":"cake","slug":"cake"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c2c8","name":"whiskey","slug":"whiskey"},{"id":"5c47a6f22037ef002282c2c9","name":"birthday","slug":"birthday"}]}},"pageContext":{"slug":"started-from-the-batter-now-were-here","previous":{"html":"<p>There are some days where all you want to do is vegetate on your couch with your stuffed penguin, some Netflix and chai. Today is one of those days.</p>\n<p><img src=\"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg\" alt=\"\"></p>\n<center>For the days of exhaust.\nFor the days of woe.\nFor the days of rain\nAnd those few in a row.\n<p>The magical potion,<br>\nWhich may many amaze,<br>\nSimple preparation,<br>\nPowerful result.</p>\n<p>A hint of ginger,<br>\nA drop of milk,<br>\nA spoonful of sugar,<br>\nAnd sore throat no more.</p>\n<p>What magical mystical wonder is this?<br>\nOh? You didn't you hear?<br>\nJust some simple and plain and regular tea!</p>\n</center>\n<p><em>Side note: this may have been inspired by one too many cups of ginger chai. I may have a problem.</em></p>\n<p><img src=\"https://pramods.box.com/shared/static/2m0iqspxp5v9az5sbsd5f7vo6wdbaasd.jpg\" alt=\"\"></p>\n","title":"An Ode to Chai","slug":"an-ode-to-chai","published_at":"25 January, 2016","feature_image":"https://pramods.box.com/shared/static/klx34yb47zgi0836hqn9ujbzzxxmsc8s.jpg","tags":[{"id":"5c47a6f22037ef002282c2a2","slug":"chai"},{"id":"5c47a6f22037ef002282c2c0","slug":"drinks"},{"id":"5c47a6f22037ef002282c2c1","slug":"tea"},{"id":"5c47a6f22037ef002282c2c2","slug":"ginger"},{"id":"5c47a6f22037ef002282c2c7","slug":"sumuchallenge2016"}]},"next":{"html":"<p>I'm feeling homesick today. A year ago, I was in India, probably eating chaat (Indian street food), or taking pictures of my cousins while they danced around with stuffed animals.</p>\n<p><img src=\"https://pramods.box.com/shared/static/jvexx1342qglctv9kb1ta3zhtc6tqmsc.jpg\" alt=\"You're missing a picture of a SUPERCUTE baby\"></p>\n<p>I miss India a lot. I always loved visiting my family there, and going for eight months was one of the most valuable times in my life. I loved every minute of it.</p>\n<p>This is a post about a breakfast place in Bangalore, Karnataka, India that everyone goes to. I hope you enjoy it as much as I did.</p>\n<hr>\n<p><img src=\"https://pramods.box.com/shared/static/2xh4t94tv5kvay59fg04rz4uoczsmdsi.jpg\" alt=\"\"></p>\n<p>Every city has this restaurant. It's not classically pretty, and there's no one waiting at the door to see whether or not you want to come in. This is a place where you have to leave your diet at the door (no one has any idea how many calories/protein grams/vats of butter are in your food anyway). The waiters are inattentive enough that a newcomer would have left on the spot, and there are literally never enough seats. There are a few places like this in Bangalore (in a city this big, with this much traffic, you need multiple choice breakfast spots), but Vidhyarthi Bhavan is arguably one of the most delicious.</p>\n<p>It's packed to the brim every day; I went on a Monday morning, and we had to stand behind people to snake their seats. And after we ate, people were standing behind us to snake ours. The restaurant is famous for it's Masala Dosa, although there are a couple of other items on the menu if you're interested.</p>\n<p>While you wait for your order, there are gorgeous photos of Mount Kailash, and really interesting pencil sketches of famous poets and writers of India adorning the walls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7opvixkr40x5e2k575lrbpy8rqnqnf1f.jpg\" alt=\"\"></p>\n<p>There's plenty of fodder for people watching, if the smells wafting from the kitchen aren't enough to keep you totally occupied. Finally, your order comes out.</p>\n<p>The dosas come to you on plates piled high in the waiter's arms (you have a brief moment where you are concerned that the bottom of someone else's plate has been all over your food); the waiter never actually looks at you before he heads to the next table. Then a second waiter, arguably less attentive than the first, comes over with a tureen of coconut, cilantro, and mint chutney and pours it onto your plate.</p>\n<p>You dig in with your fingers, barely resisting the urge to just dig in with your whole face. Finishing one of these babies is a task and a half, but you are definitely up to the challenge; going, going...gone.</p>\n<p><img src=\"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg\" alt=\"yummy yummy masale dosa!\"></p>\n<p>Finally, you get a cup of some excellent filter coffee to finish you right off, before you stumble into the daylight, and onto a street lined with flower and fruit merchants.</p>\n<p>You amble along, sniffing deeply and enjoying the almost-too-full-but-not-quite feeling in your stomach, and all feels right with the world.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7orlyigfozthf1tuoxjuo4cmt4etxsxh.jpg\" alt=\"\"></p>\n","title":"Vidhyarthi Bhavan","slug":"vidhyarthi-bhavan","published_at":"01 February, 2016","feature_image":"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg","tags":[{"id":"5c47a6f22037ef002282c245","slug":"india"},{"id":"5c47a6f22037ef002282c234","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ca","slug":"masala-dosa"},{"id":"5c47a6f22037ef002282c262","slug":"eating-out"},{"id":"5c47a6f22037ef002282c2cb","slug":"indian-food"},{"id":"5c47a6f22037ef002282c2cc","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2cd","slug":"bangalore"},{"id":"5c47a6f22037ef002282c2ce","slug":"vidhyarthi-bhavan"},{"id":"5c47a6f22037ef002282c2cf","slug":"nostalgia"},{"id":"5c47a6f22037ef002282c2d0","slug":"homesick"},{"id":"5c47a6f22037ef002282c2c6","slug":"anuchallenge2016"}]}}}