{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c36b","uuid":"8abb8e5a-35f6-448b-a1d9-8decec1d3d4d","title":"Vidhyarthi Bhavan","slug":"vidhyarthi-bhavan","published_at":"01 February, 2016","html":"<p>I'm feeling homesick today. A year ago, I was in India, probably eating chaat (Indian street food), or taking pictures of my cousins while they danced around with stuffed animals.</p>\n<p><img src=\"https://pramods.box.com/shared/static/jvexx1342qglctv9kb1ta3zhtc6tqmsc.jpg\" alt=\"You're missing a picture of a SUPERCUTE baby\"></p>\n<p>I miss India a lot. I always loved visiting my family there, and going for eight months was one of the most valuable times in my life. I loved every minute of it.</p>\n<p>This is a post about a breakfast place in Bangalore, Karnataka, India that everyone goes to. I hope you enjoy it as much as I did.</p>\n<hr>\n<p><img src=\"https://pramods.box.com/shared/static/2xh4t94tv5kvay59fg04rz4uoczsmdsi.jpg\" alt=\"\"></p>\n<p>Every city has this restaurant. It's not classically pretty, and there's no one waiting at the door to see whether or not you want to come in. This is a place where you have to leave your diet at the door (no one has any idea how many calories/protein grams/vats of butter are in your food anyway). The waiters are inattentive enough that a newcomer would have left on the spot, and there are literally never enough seats. There are a few places like this in Bangalore (in a city this big, with this much traffic, you need multiple choice breakfast spots), but Vidhyarthi Bhavan is arguably one of the most delicious.</p>\n<p>It's packed to the brim every day; I went on a Monday morning, and we had to stand behind people to snake their seats. And after we ate, people were standing behind us to snake ours. The restaurant is famous for it's Masala Dosa, although there are a couple of other items on the menu if you're interested.</p>\n<p>While you wait for your order, there are gorgeous photos of Mount Kailash, and really interesting pencil sketches of famous poets and writers of India adorning the walls.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7opvixkr40x5e2k575lrbpy8rqnqnf1f.jpg\" alt=\"\"></p>\n<p>There's plenty of fodder for people watching, if the smells wafting from the kitchen aren't enough to keep you totally occupied. Finally, your order comes out.</p>\n<p>The dosas come to you on plates piled high in the waiter's arms (you have a brief moment where you are concerned that the bottom of someone else's plate has been all over your food); the waiter never actually looks at you before he heads to the next table. Then a second waiter, arguably less attentive than the first, comes over with a tureen of coconut, cilantro, and mint chutney and pours it onto your plate.</p>\n<p>You dig in with your fingers, barely resisting the urge to just dig in with your whole face. Finishing one of these babies is a task and a half, but you are definitely up to the challenge; going, going...gone.</p>\n<p><img src=\"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg\" alt=\"yummy yummy masale dosa!\"></p>\n<p>Finally, you get a cup of some excellent filter coffee to finish you right off, before you stumble into the daylight, and onto a street lined with flower and fruit merchants.</p>\n<p>You amble along, sniffing deeply and enjoying the almost-too-full-but-not-quite feeling in your stomach, and all feels right with the world.</p>\n<p><img src=\"https://pramods.box.com/shared/static/7orlyigfozthf1tuoxjuo4cmt4etxsxh.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/by56r0iw8pjezazv9tvz46spa9zyx530.jpg","tags":[{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ca","name":"masala dosa","slug":"masala-dosa"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"},{"id":"5c47a6f22037ef002282c2cb","name":"indian food","slug":"indian-food"},{"id":"5c47a6f22037ef002282c2cc","name":"south indian","slug":"south-indian"},{"id":"5c47a6f22037ef002282c2cd","name":"bangalore","slug":"bangalore"},{"id":"5c47a6f22037ef002282c2ce","name":"vidhyarthi bhavan","slug":"vidhyarthi-bhavan"},{"id":"5c47a6f22037ef002282c2cf","name":"nostalgia","slug":"nostalgia"},{"id":"5c47a6f22037ef002282c2d0","name":"homesick","slug":"homesick"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"slug":"indian-food","limit":6,"skip":0,"numPages":1,"currentPage":1}}