{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c35e","uuid":"28e9fca4-1790-4afe-9663-c046b09f3043","title":"FoodChella","slug":"foodchella","published_at":"04 May, 2016","plaintext":"\n\nSo I was terribly sick last week whilst recovering from Coachella so I've\ndecided to treat you guys with not one but TWO whole posts! I know right?! So\nawesome. You can thank me later. AND to make things better... instead of sharing\njust a single song... I'm going to gift you with a whole playlist of my favorite\nsongs from Coachella!\n\nSo very typical of me, I didn't double check my flight timings when booking so I\nended up flying out to LAX a whole 10 hours before the rest of my group. I\ndecided to start the trip out right, eggs Benedict and a mimosa at the airport\nwith a side of Gilmore Girls.\n\n\n\nUsually 10 hours stranded at an airport is a bummer, but there are worse places\nto get stranded than LAX. It kind of ended up working out for me because I took\nmy camera and explored! I walked from Santa Monica Pier to Venice Beach and\nsoaked in the gorgeous SoCal sun.\n\nIn Santa Monica, I stopped at the Lobster for some AMAZING crab cake. Seriously,\nprobably the best I've ever had in my life.\n\n\n\nIn Venice Beach, I decided to have a lighter option and enjoyed some Burrata and\nBeets at Larry's Bar & Grill.\n\n\n\nThe most adventurous meal was at dinner with a friend at Wurstküche. We enjoyed\nsome cold beers and Rattlesnake Sausages. It honestly didn't taste much\ndifferent from other sausages and was actually pretty good but I can't say I'd\ncomfortably eat that again.\n\n\n\nThe weekend was filled with new musical obsessions, including Zhu & Flume\n(seriously check out that playlist ^), new friends, delicious eats, and lots and\nlots of dust. We danced our asses off to Zedd and Calvin Harris, reveled in the\nunfair flawlessness that is Ellie Goulding, and sang our hearts out with Akon,\nSean Paul, and Nico&Vinz during Matoma's set.\n\n\n\n\n\nI came back home the following Monday sunburned (what happens when you wander\naround LA without sunscreen) and exhausted out of my mind; Cue sickness.\n\nThis was my first year attending Coachella, every instagrammer's and basic\nbitch's haven. Of course I had to have ONE basic picture myself to commemorate\nthe experience.\n\n\n\nCoachella is also a GREAT place for foodies. While you needed to be a VIP to get\naccess to some of the tastiest and more exclusive food, there was plenty of\ndelicious options to spare. Looking back at my food photos, I realize that I\nbasically survived off fries. Just fries. And obviously watermelon, because it\nIS Coachella. But these fries were no ordinary fries my friends. They were all\nloaded with various toppings and delicious goodness.\n\nVeggie Monster Fries with lots of types of slaw and jalapeños!\n\n\nVegetarian Poutin Fries with cheese curds!\n\n\nCrab Fries! This meant crab aioli AND crab topping! Double yum!\n\n\nChicharones Fries with Sriracha and curry aioli!\n\n\nI honestly have no idea how most of these things were made but my stomach was\nhella happy. :)","feature_image":"https://pramods.box.com/shared/static/7w01lehlhccieop2u2338p9bk04fle3u.jpg","tags":[{"id":"5c47a6f22037ef002282c321","name":"coachella","slug":"coachella"},{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c322","name":"poutin","slug":"poutin"},{"id":"5c47a6f22037ef002282c323","name":"crab","slug":"crab"},{"id":"5c47a6f22037ef002282c2c5","name":"vegetarian","slug":"vegetarian"},{"id":"5c47a6f22037ef002282c324","name":"chicharones","slug":"chicharones"},{"id":"5c47a6f22037ef002282c325","name":"music","slug":"music"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"},{"id":"5c47a6f22037ef002282c326","name":"venice beach","slug":"venice-beach"},{"id":"5c47a6f22037ef002282c327","name":"santa monica","slug":"santa-monica"},{"id":"5c47a6f22037ef002282c328","name":"LA","slug":"la"},{"id":"5c47a6f22037ef002282c329","name":"rattlesnake","slug":"rattlesnake"},{"id":"5c47a6f22037ef002282c32a","name":"burrata","slug":"burrata"},{"id":"5c47a6f22037ef002282c262","name":"eating out","slug":"eating-out"}]}}]}},"pageContext":{"slug":"coachella","limit":6,"skip":0,"numPages":1,"currentPage":1}}