{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c382","uuid":"3ef7f523-4fb4-48a5-9fef-b4252d38d598","title":"Vegan Love Triangles","slug":"love_triangles","published_at":"18 January, 2016","html":"<p>When I was making these pastries and trying to find a name for them, I kept drawing a blank. They weren't tarts, they weren't REALLY puff pastry either, and I couldn't figure out what to call them. And then, as I was talking to a friend about it, we got into a conversation about euphemisms, and the ones we both favor. Hot box got thrown around a bit, but then we hit on the perfect name. Visually accurate (the pastries are triangles) and a little silly.</p>\n<p><img src=\"https://pramods.box.com/shared/static/praw2vkc61bu1p72w4hn5xgo6d1t6au8.jpg\" alt=\"alt\"></p>\n<p>Love Triangles.</p>\n<p>And look, I know it says vegan up there at the top, and I can hear what you're thinking: you don't usually like vegan pastry! It's dry, or it's weird, and are there lentils in there because you heard that vegans put lentils in everything!</p>\n<p><img src=\"https://pramods.box.com/shared/static/uadohrf9za1k4nditck5cldqmhr0ea7e.jpg\" alt=\"alt\"></p>\n<p>But these pastries don't taste vegan. I think there's this idea that vegan food has to be healthy, and taste healthy, and while I would definitely advocate for healthy food generally, that's not the case here. This recipe is full of lovely fats in the form of coconut oil, and yummy yummy carbs. It's delicious. You won't believe it's not butter in there. The pastry is flaky and crisp at the same time, the apples are tender and perfectly cooked, and the pecans add a hint of interest inside.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fk0f07cwosnzlj8tc0a9uchxdyegmsxz.jpg\" alt=\"alt\"></p>\n<p>It's a teeny weeny pie to warm the bits of your soul that have been snowed into. In the middle of winter, when you come in from the cold, these are the perfect bits to warm your hands and your stomach as you cuddle into your couch with a warm cup of tea.</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Love Triangles</h2>\n    <div class=\"summary\">\n      <p><em>These take a bit of time, but the end result is well worth it. Just note that the chilling instructions aren't really optional; the whole point is to keep the coconut oil intact throughout the preparation, so that when it gets into the oven, it melts into the pastry creating flakiness and richness. Without chilling items appropriately, the dough becomes too difficult to work with, and it doesn't cook properly in the oven. So. Chill out. Chill your dough, chill your baking trays, chill your filling. Your stomach will thank you later.</em></p>\n      <p>Yield: 16 mini pastries</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour active, four hours passive</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Pastry Dough</h4>\n          <li class=\"ingredient\">2 C Unbleached All Purpose Flour</li>\n<li class=\"ingredient\">1 teaspoon salt</li>\n<li class=\"ingredient\">3/4 C Coconut Oil, cold but pliable</li>\n<li class=\"ingredient\">Ice Water, 1/4 cup - 1 cup, as needed</li>\n        <h4>Filling</h4>\n          <li class=\"ingredient\">4 Medium Apples, preferably a variety, cored and grated</li>\n          <li class=\"2/3 C Sugar</li>\n<li class=\" ingredient\"=\"\">1/2 Tsp. Cinnamon</li>\n<li class=\"ingredient\">1/2 Tsp. All-Spice</li>\n<li class=\"ingredient\">1/2 Tsp. Nutmeg</li>\n<li class=\"ingredient\">1/2 Tsp. Cardamom</li>\n<li class=\"ingredient\">1/2 Tsp. Black Pepper</li>\n<li class=\"ingredient\">1/2 Tsp. Ginger</li>\n<li class=\"ingredient\">1/2 Tsp. Orange Extract</li>\n<li class=\"ingredient\">1 Tsp. Vanilla Extract</li>\n<li class=\"ingredient\">2 Tsp. Lime Juice</li>\n<li class=\"ingredient\">1 C Chopped Pecans</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n        1.) Put flour and salt in a mixing bowl, and mix together thoroughly. Add the coconut oil and crumble it in with your fingers, until you have a mixture that looks a little sandy - the coconut oil should not disappear completely, but should be in small pea-sized or smaller chunks. Add ice water a tablespoon at a time until you have a dough that's smooth, not too dry, and fairly elastic.\n</p><p> \n2.) Roll out the dough into a rectangle, about 6x11. Fold the two short ends in, so that you have a rectangle one third the size of the original. Then roll it out again to roughly the same size, and fold again from the short ends. Repeat this process seven or eight times - this is what creates the layers in your pastry, and I found that while this method takes time, it was not too strenuous and yielded good results. \n</p><p> \n3.) Wrap the dough in plastic wrap and refrigerate. Let chill for a minimum of four hours. This dough can be chilled for several days, so it works really well if you're trying to make it in advance. \n</p><p> \n4.) Now it's time for the filling! Put your cored and grated apples into a saucepan, and turn on the heat. Add sugar and spices, and mix thoroughly. Allow the apples to become soft and fragrant; any juice produced should evaporate, so that you have mixture without extra moisture.\n</p><p>\n5.) Once apples are cooked through, add extracts and cook for one minute. Take off the heat and add lime juice and pecans. Stir completely before setting in fridge to chill. The filling needs to be cold before you make your pastries, so that it doesn't melt the coconut oil prematurely. \n</p><p>\n6.) Grease two cookie trays with coconut oil and chill in the fridge or freezer.\n</p><p> \n7.) Let three - four hours pass. Read a book. Take a long walk, or a short hike. Watch some television, or make animals out of passing clouds. \n</p><p> \n8.) Preheat the oven to 375 degrees. Take your chilled dough out of the fridge and cut into 16 pieces with a sharp knife. Take one piece and roll it into a ball, and set on a floured surface. Roll it out into a circle about 4 - 5 inches in diameter. \n</p><p>\n9.) Place about a tablespoon of filling in the middle of the circle, and dot the circumference with water, to make sure it sticks. Fold the dough on three sides, so that the base forms a triangle. Press the dough together as shown in the pictures below, so that the seams meet in the center. Set it onto your chilled baking sheet. Repeat with remaining dough and filling. You might have some filling leftover, depending on the size of your apples. \n![alt](https://pramods.box.com/shared/static/a5avl89yja4umc0kd06f96jnrymm9c1s.jpg)\n</p><p>\n10.) Bake for thirty five - forty five minutes. The tops should be golden brown and crispy, and some of the apple juices will escape onto the tray. That's okay. \n</p><p> \n11.) When they're done, take them out, and wait for them to cool. Or, if you're like me, pick one up, bite in, mouth breathe until it cools, and then lament the fact that your burned the roof of your mouth. It's fine. These taste great with a bit of vanilla ice cream (vegan or otherwise), a warm cup of tea, or just on their own as well.  \n        </p>\n      </div>\n    </div>\n  </div>\n</div>","feature_image":"https://pramods.box.com/shared/static/praw2vkc61bu1p72w4hn5xgo6d1t6au8.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2b4","name":"warmapplepie","slug":"warmapplepie-2"},{"id":"5c47a6f22037ef002282c2b5","name":"allamerican","slug":"allamerican-2"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2b7","name":"veganpastry","slug":"veganpastry-2"},{"id":"5c47a6f22037ef002282c2bc","name":"pastry","slug":"pastry"},{"id":"5c47a6f22037ef002282c2bd","name":"puffpastry","slug":"puffpastry"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c357","uuid":"37a98e77-e446-4f06-bbf8-6fbc1677f180","title":"The only thing weird would be if someone didn't like Mexican food, because I'm making FAJITAS!!","slug":"im-making-fajitas","published_at":"14 January, 2016","html":"<p>We all love Ross. Despite his many divorces and nerdy dinosaur quirks, Dr. Gellar (no not that kind of doctor) was one of my favorite characters on Friends. Every time I make fajitas I remember Ross absolutely &quot;NOT&quot; being weird about Joey and Rachel starting to go out. One of the most classic Ross moments on the show.</p>\n<p><img src=\"http://www.laughfrodisiac.com/uploads/1/8/5/4/18543868/6899821_orig.gif\" alt=\"\"></p>\n<p>I was in India when Netflix released all ten seasons of Friends.</p>\n<p><strong>ALL. TEN. SEASONS. EASILY. ACCESSIBLE. ON. THE. INTERNET.</strong></p>\n<p>This was huge. I can't even begin to count the endless number of illegally uploaded episodes I've watched on YouTube with Spanish subtitles. I ended up learning various inappropriate words through context. Made for some fun giggles during Spanish class.</p>\n<p>While I was searching a mood song for this post, I stumbled onto this gem. It's so weird that it HAD to make it into the post.</p>\n<div class=\"embed-responsive embed-responsive-4by3\">\n<iframe frameborder=\"0\" wmode=\"Opaque\" allowfullscreen src=\"https://www.youtube.com/embed/BKKVXk31zwQ?wmode=transparent\"></iframe>\n</div>\n<p>Back to the point. So this January when I was in India, my cousin had major cravings for Mexican food. We decided to enhance our existing Galentine's Day plans from just <a href=\"http://cookinginpjs.com/galentines-day-cupcakes/\">red velvet cupcakes</a> to include some simple yet delicious Mexican food.</p>\n<p>A lot of the parts of this recipe have already been posted in other posts, so I'm just going to link those rather than retyping. I just sautéd a some spinach, bell peppers, onions, and mushrooms with my own <a href=\"http://cookinginpjs.com/estoy-cantando/\">fajita seasoning</a> recipe. Added some corn salsa and <a href=\"http://cookinginpjs.com/taco-tuesday/\">homemade sour cream</a> and <a href=\"http://cookinginpjs.com/taco-tuesday/\">flour tortillas</a>. All you have left to do is roll it up and enjoy!</p>\n<p>Recipes:</p>\n<ul>\n<li><a href=\"http://cookinginpjs.com/estoy-cantando/\">fajita seasoning</a></li>\n<li><a href=\"http://cookinginpjs.com/taco-tuesday/\">homemade sour cream &amp; flour tortillas</a></li>\n</ul>\n<p><img src=\"https://farm9.staticflickr.com/8670/16426242248_05c7ff66f5_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8632/16613440465_f6ddd2bd12_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8683/16426430850_324b5f4a9f_b.jpg\" alt=\"\"></p>\n<p><img src=\"https://farm9.staticflickr.com/8628/16427647159_151d1d23ce_b.jpg\" alt=\"\"></p>\n","feature_image":"https://pramods.box.com/shared/static/3chnt4gzvs3sg5exnvkiiy2q53zgqxfd.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c245","name":"india","slug":"india"},{"id":"5c47a6f22037ef002282c252","name":"fajitas","slug":"fajitas"},{"id":"5c47a6f22037ef002282c29c","name":"friends","slug":"friends"},{"id":"5c47a6f22037ef002282c29d","name":"ross","slug":"ross"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c369","uuid":"7be4e4ee-6239-411d-952a-c769fc32ade5","title":"It's DOSA TIME.","slug":"ada-dosa","published_at":"11 January, 2016","html":"<p>I have not always been a fan of dosa. In fact, for years  I would only eat it if it was accompanied by tanks of chutney (why yes, I would like some dosa with that). But then I tried ada (a-day) dosa, and my life changed.</p>\n<p><img src=\"https://pramods.box.com/shared/static/0j9f1d0d2h32k4m8xb7lvrjwkgy70xna.jpg\" alt=\"alt\"></p>\n<p><img src=\"https://pramods.box.com/shared/static/1jdp190c55wmmzwkmv74olff2o32roj0.jpg\" alt=\"alt\"></p>\n<p>Dosa is a south asian savory crepe - type bread. It's made of rice which is soaked, ground, and allowed to ferment. Ada dosa is the simpler, and to me, much tastier cousin - made entirely of rice, lentils, and legumes, it is both extraordinarily healthy and delicious.</p>\n<p><img src=\"https://pramods.box.com/shared/static/z076rz6071j19sd1oyknxa21aqd4os6c.jpg\" alt=\"alt\"></p>\n<p>This is the food I beg my mom to make every time I visit home, and is one of the first things I learned to make when I set out on my quest to learn to cook Indian food.</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Ada Dosa</h2>\n    <div class=\"summary\">\n      <p><em>The recipe I'm sharing today is one that I know works, but you can substitute all the lentils and legumes with pretty much any other lentil or legume. You just have to make sure that you soak the hardier legumes (black eyes peas, kidney beans, black beans, etc.) overnight, and the lentils and rice for three or four hours. It's also important to have a good rice to lentil ratio. You want to make sure that approximately one third of the total quantity is rice, so if you have two cups combined of lentils and legumes, you would want one cup of rice in there.\n      These dosas can be eaten with yogurt, any chutney or pickle you like, or, if you're so inclined, plain. They would also be wonderful with sauteed vegetables. </em></p>\n      <p>Yield: Approximately 10 10-inch dosas, 3 - 4 servings</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour active, 12 hours passive</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <li class=\"ingredient\">1/2 cup black beans</li>\n      <li class=\"ingredient\">1/2 cup chana dal</li>\n      <li class=\"ingredient\">1/2 cup toor dal</li>\n      <li class=\"ingredient\">1/2 cup split peas</li>\n      <li class=\"ingredient\">1 cup brown rice</li>\n      <li class=\"ingredient\">1 1/2 tbls fresh ginger</li>\n      <li class=\"ingredient\">1/2 tbls whole black pepper</li>\n      <li class=\"ingredient\">1/2 tbls cumin</li>\n      <li class=\"ingredient\">1/2 cup coconut (dry and fresh both fine)</li>\n      <li class=\"ingredient\">1/2 bunch cilantro</li>\n      <li class=\"ingredient\">fresh green chili, to taste</li>\n      <li class=\"ingredient\">salt, to taste</li>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n1.) Soak the black beans the night before, and start soaking the lentils about six hours before you want to eat them. \n</p><p>\n2.) Combine all ingredients including spices in the food processor with the water you soaked them in, and let it run. The resulting mixture shouldn't be too runny or too thick, and will be a little grainy, but not chunky. While it won't be as smooth as pancake batter, the lentils should be broken down quite well. \n</p><p>\n3.) Once your batter is ready, turn on your stove and let a skillet heat with a small amount of oil. You want the skillet to be hot and the oil covering the surface - if you put your batter on the skillet too soon it will stick! Put a small amount of batter in the center of your skillet, and careful spread it out with a spiraling motion until it's the desired size. Pour a small amount of oil (1/4 teaspoon) on the surface of the dosa, and then cover the pan. \n</p><p>\n4.) Let it cook for three - four minutes, before removing the cover, and flipping the dosa so the other side can cook.\n</p><p>\n5.) Cooking time varies based on the stove and the pan you're using, so give yourself a bit of leeway here. If your first dosa falls apart (as mine did) scrape it off, rinse your skillet, and start fresh - with a bit of trial and error, these become super easy! Once both sides of your dosa are cooked, it's ready! Pull up a plate and dig in :)\n        </p>\n      </div>\n    </div>\n  </div>\n</div>","feature_image":"https://lh3.googleusercontent.com/KWBBMYdzG5jqFpPXoOT5tZ1XsclaWzt3q4QXau3omGevmZidRFmpBSyJzvwum8K3YWVTaBFm3A4sgYrTCSYsfqErYq2A1UvLd7xEfm7jSmFkzQUUmjkEVWf5aySOjbmoQApXNZcDaBjGOb19JaK_mmg2KemL_-8Ggno5E-Rzck0QJLwUvBIT_ocr1v_V7iMgvSFZWO5OuPz0fDLU4XpknoQc0F5mueX1giHpDA3HHrUSSys4zeK5hyDv6iyyLnoYi5FbHl7dpEkG4DRQRv0cZvMa3LL_j-sfWNdD6mCGBQvyZFN3txUUgf6TDvqlC--0GXgzZAXVLP-G6Fnu2KK5qXXXJUPjkQz8quqmgBlA317IANaRjhBJ8gSFvd-2WYHySPHE7SPadbtaA6tbxGPxrEFppYuar1bLl4Lw3LbG-ieBLG0Gb_b1QED316YX4aN9VErOpOgI-9IxxhPjWOUIovADqIdpB9U0haOTqsOWUTbUO-kSAN5Zjh05RIqfUhco5hrzNw_Y4B5bQqR-E0OQ6X0e2xOMV5Xo9PWVUA-JxlsQSCb1NNlymaRk_5oR5xKXofyX=w362-h643-no","tags":[{"id":"5c47a6f22037ef002282c2ac","name":"dosa","slug":"dosa"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37e","uuid":"a95f8d2d-1470-4844-aa6e-784a730e7ce2","title":"Estoy Cantando","slug":"estoy-cantando","published_at":"06 January, 2016","html":"<p><img src=\"https://pramods.box.com/shared/static/5llh0jdygar2h4ykutwryhmtfxx99eec.png\" alt=\"\"></p>\n<p>Anyone who has had the <em>honor</em> of being in my presence this week knows that I've been playing one song on repeat. One song. All week. Why you may ask? DUH...BECAUSE IT'S AMAZING.</p>\n<p>(Now's when you play this song and dance along while finishing to read this post.)</p>\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:5cR7culxUEPLhzIC0KWAH1\" width=\"auto\" max-width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe>\n<p>My brother was visiting me for a week and I quickly realized 1) apparently no one comes to work during the holidays in my office, meaning sub-par lunches and dinners all week and 2) I hadn't done groceries in weeks, meaning I didn't have anything to feed the kid while he was staying with me. Being the ever so responsible adult that I am, I decided that I could muster enough patience to cook lunches and dinners for my brother a few times, or at least while I was working from home. We braved it out to a farmers market and brought back a collection of various vegetables without any idea of what to make. While brainstorming ideas my brother decided that since he was spending a week in California, he was going to try and eat Mexican food for each and every meal.</p>\n<p>My next step was to figure out what kind of Mexican dish to make when all I had bought was stir fry vegetables. Voilà! MEXICAN &quot;STIR FRY&quot;! Or I guess as normal people call it... TOSTADA BOWLS!</p>\n<p><img src=\"https://lh3.googleusercontent.com/Ve6cm0UWi2klfKNBucW5RQaGauUXPwneEc0sHfvpURDlY3SWKBfcYAQLCJK3Q2I7uSZdo2ulwfO1mmXmKWbZ56btcUQ7m3i5eay2g4qi-f4FaQtX-vYoiSZHueaiJjhMGIWs-sVJY68eBCXO2Aj5ctKAmXCHAKEriVCYSAMdo4ThgSXyixQxiO7-FNwcDa9fhjyVdSm2euwAOJC3l92hTmva72-XsHiX4ir8ElyAZFpvOS9nQ1j0kDCzfx0J4nYPfKAzJp7wDVWQUkQsDW90frbjnFfpEeUw_gl_n2DzR7x9r5tbjC4I9M1OqHmlgp-mhJZ46I8L2olUEqEcXkvcRiVPJFNlfMJyx4YRU5KPR8G921KOOy_0l_68mWlZSdTlIH6-De6xwXGCL9lR2sQ-CIxdIFGumGYlH35G8I8bo2GHZw5eG2org0oKpi0QYd8373sOFzMMElqSdAKsatEayenx7iGKBPLngoAK3m5cH5b7IxHHymlLi-baaZRFwgiqMqyiH2l7xu2htVeC_zTfpPjJNr-_0eDiAJmh1I5pEykrD5Sy44vuiUjnbicZMeTC4hn_tg=w1976-h1316-no\" alt=\"\"></p>\n<p>There's not really a recipe for this post because honestly I kind of made it up on the spot. BUT I can give you some bits and pieces of what went in this so you can make your own variation of this dish at home! (I KNOW, how sweet of me.)</p>\n<p>This dish is essentially a layer of cilantro lime rice, refried beans, vegetables sautéd fajita style, salmon (totally optional and honestly kinda ruined the dish for me, my brother's vegetarian one was on point), guacamole, sour cream and cotija cheese a.k.a. fancy Mexican cheese. Plus you can throw some chopped green onions on top to make it look all pretty and fancy.</p>\n<p><img src=\"https://lh3.googleusercontent.com/CeNqsYp63uvCaplae3zBaDNLdex2SHlc0IMJSkMjUmFjsv59YL92AaEDRfHi6nIko0QnXSz8DBH81h1C0rvKzWi4GatpUqH3aT2QXl1ws6cH6QqprP6Enh2oNuG2VegDD94fbVobszPLMNhKqMw-CsTpJcyjH-Jb8hvmJNfmalrGrUhGVZZijJBAUM-IAE5sFkFBPRHdDtdLBMV_DZh7VHm40qWDhdQyzu7RJd_uGhmOcecFMuvr8zlSlx8G4zotPn2E6qRxUpExV8JHKsbZAlpB443QUuMVdJ6gHjR3xgp_3YOaxY2lopHf19vQ7x7oJHe5UaFqRrLK1eVUBETrB_Jc1dmWJS-LVOk8f6mjkbJt0v01VmxHTdw5HmvikvgTOXPTN5ha0w-VX1KhLxd5hohLEGei2FNAc_gCX1cZWzmxiy2uj6vZoeqKDg8VQgjYJGTbzmHKenzKWsI0GfX4wd0wcsMlEWcETm0_t8A6aFXQpXuw5im8BxIPfd-csF8tzSGUEKVCwkl1KahFAkwEeLPtMCmxhlSo1I-m91MXYv7aVws1Diu8quyH-ZLVcE5jzXzO6A=w1976-h1316-no\" alt=\"\"></p>\n<p>I've always loved making Mexican food. It's so flavorful and deliciously rewarding every time! Every single part of a burrito/taco/bowl is overflowing with unique tastes that seem extremely complicated and intricate. I'll let you in on a little secret...I use the same seasoning to cook every single part of any Mexican dish I make. Whether it be the refried beans or fajita vegetables, it's all various spice levels of the same recipe. I'm sure that's not how authentic Mexican food is made, but hey...mine tastes pretty damn good too.</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Sumedha's Super Secret Fajita Seasoning</h2>\n    <div class=\"summary\">\n      <p><em>Feel free to mess around with the proportions of each ingredient! Make as much or as little seasoning to go in</em></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\">\n          <li class=\"ingredient\">2 tsp cumin</li>\n          <li class=\"ingredient\">1 tsp cayenne pepper</li>\n          <li class=\"ingredient\">1 tsp paprika</li>\n          <li class=\"ingredient\">1 tsp salt</li>\n          <li class=\"ingredient\">1 tsp garlic powder</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>Mix it all together</p>\n      </div>\n    </div>\n  </div>\n</div>\n<p>For the guacamole, I generally use the <a href=\"https://www.chipotle.com/guac-recipe\">recipe graciously provided by Chipotle</a>. Sometimes I add some cumin or replace the jalapeños with cayenne pepper if I'm feeling dangerous. To go off on a tangent, couldn't you watch this gif of guacamole being made forever? 1) I feel really bad for/impressed by the person who disrobed all those avocados and 2) I just want to dive into that bowl tongue first. (Excuse me while I make myself a bowl)</p>\n<p><img src=\"https://d5bzqyuki558t.cloudfront.net/cms-assets/system/asset_versions/attachments/000/000/422/original/GuacGIF_Article_smaller.gif?1429114662\" alt=\"\"></p>\n<p><em>Several minutes later</em></p>\n<p>That's about it! Just sauté the vegetables of your choosing with some oil and fajita seasoning, heat up a can of black beans on the stove with fajita seasoning, whip up a bowl of guac, season some rice, and pile it all into a bowl for maximum enjoyment.</p>\n<p><strong>YUM</strong></p>\n<p><img src=\"https://lh3.googleusercontent.com/xL6ZZyTvHTSpJMlQKsTrnE-Hi1wZGxznWgD_ObbvWbklroelEJZ_VbrWWy94DcXKg5L0YkmD8QDXcGwO22F5FGrF239GfqSLpVLztVqeBRdZvJD3Jc6MAz34MwIAlofEobmL9DERXd5mnUr8QLuB6BFV-0xhD_a6QGAgQJ4cmT9_43BOz3KM62S4BUUgVmaOJlWKdrhmR2ofdLorNosZgzIDYgTz_HXwvI1gqFOXM3xuNSM6al6BHDzGZ4kaU0FULQK2yqYeVhjmITl18AMrkF7kAWEHQg2tqlKwkjUr-3rHanBHgZkTLGL8VUFW7HFhkDueldqQf2ncPqYnWaNX5QS9SkTsItWwwa3B9KMHkLUy_67Kvj9XZO0UsPqEE2KFPwTc9fRnp5_Q99tD4prLJOEOe163hnXwv_CqGdoUqvZ7XAOllyG5KSDf9l8Eh6xEGk2m2KjFV7PTGe-cLtWs1PQXK_luSKEbHRYRudXOEzt4tXAC9D5p_7NgVdDFabK0nnyeB1ZyF0TxgBJ3aeX95mu5Xuji-19kMRtRm4MIy4SrkPgGzg4-aUDjWa3dKhSTQWPnQg=w1974-h1316-no\" alt=\"\"></p>\n<p><img src=\"https://lh3.googleusercontent.com/ewDBn95P9kq6uqHSJWTKr6oWxcR3SMcgHkeY-RbMuo1yNwiTJPxKkukIbJF-JWHEFymzYXjq_CAvb8ipFVPramGvtS6YZtFQOAQKXFciCOrzGF9JKRjNKWA5REjGuiNj8OIuNBTDWnmS2ihENrJvss7ISYcsaKA4Ar7GoEgtkqQESGinvSi7zcA6G72cid8hAl-ppVQZ5lIWlJaOkpApzI89lG_XAinfFXNtku5PvS5fRY2ciVY5r6_U9L3DMy5fIRVRKfXNSgUzbU6SHmg8yFtqnsy-DhSMZffu7-boB5gHuY8wbYt5LHVG89pa8eVecezdiLQtAedqFwo3ggBgqDnLZ0OXpVSe0duttQKIKTnAdA9NPelgIqOKwfPwUZHVi6cTxpIdZfwiildi3OuS7Ps13dn8IZJu-m5oIF3XOjvtokCgR3zOaUy0IIVkfo9P0CUrVWyuko20DXOrrcO4MPwhRjjzHYtIrcoopywcZN_fOkbtB-xHLKEjhO7idj_yaLU_EsqrMJihJiz7oduRC7668bpvdW7GfeUuc_IaLHPE5lhchhjBERJ9jdhk2p9OSGku5g=w1386-h1316-no\" alt=\"\"></p>\n<p>ALSO! If you haven't already check out our instagram with all sorts of delectable pictures of recipes past and future! Do it! Click on the adorable instagram logo!</p>\n<p><a href=\"https://www.instagram.com/cookinginpjs/?ref=badge\" class=\"ig-b- ig-b-v-24\"><img style=\"max-width:200px; max-height: 70px\" src=\"http://www.igworldclub.org/wp-content/uploads/2014/08/instagramicon.png\" alt=\"Instagram\"></a></p>\n","feature_image":"https://lh3.googleusercontent.com/On_C3sVekW8RNs9hpoj0MIDrJT00W5fWI7kTOe_-IafE3KppeMwwGQAH0hgHyAsyIfL0wcNPMy-hTHPG82rQYEp8TEFp7rBq798cchUmZcuhpvMACjbfBzZ-s4Rtcd1RwDYNgy3zczqZOCNIyXnMYDeYs6vp3vzsKvQ2_iof13Ye06I5qP97pXrlGz6nC5EE8M23IhTLrpxphEXlJH5eNQ3BRbRiEy7BtKmu-GQwEqzLnrysk4oHdhk_2pFU0xY_CeIhJEkOEvgt2snl16cvP-F1inJW_1D_38G0UgDDF8dFm-y95hNIYY1TYOsiTSDB2nr3jCdw4ii6utGU3k7isNNOlOSGf6sqjnBhEd-ufwL0AiQ1CU5CCle5p4-t7MNW7BTP-xSrKu_fhQPd2yshC_ZL4X2ZDrgFU5rXcJzDjfALGCGlqoO6hegUnK8XBblYqP5p0ENlI6_Tpt3GZ1VuC77PDn-SKSSvig-jqbgxU6IaUFtZwSF26m75wFdl-bwm-Qg1hIzlE8RIp1cXg2MYJwg4lj_PRxjxfZ8eWPtIkuklJI_Z2NS5MXtweiWc5EaIAbm74w=w1186-h790-no","tags":[{"id":"5c47a6f22037ef002282c246","name":"carnivores","slug":"carnivores"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c2aa","name":"family","slug":"family"},{"id":"5c47a6f22037ef002282c2ab","name":"bowls","slug":"bowls"},{"id":"5c47a6f22037ef002282c25d","name":"stir fry","slug":"stir-fry"},{"id":"5c47a6f22037ef002282c2c7","name":"sumuchallenge2016","slug":"sumuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37b","uuid":"34b095eb-adc1-4908-9a23-8ec82b8d6103","title":"Spicy Chocolate Cookies","slug":"spicy-chocolate-cookies","published_at":"04 January, 2016","html":"<p>I made these cookies quite a while ago, right after one of my final exams. I came home craving cookies, which is pretty rare - while I like dessert, I've never especially been a cookie person. In most cases, if there's an option between a cookie or almost any other dessert, I would choose the other dessert.</p>\n<p><img src=\"https://lh3.googleusercontent.com/ygGhgPY9-xhhnnKZQ1juuonpNX5lAy_OxUW550igcpPxE0oxI5b7VmNyAB9Dpudm2amzFPsHLtcvt23ApWznHaFZvRAFqAH6PowsUO6TGMpQOrjiIDLge5iEIGnTGBptW53qSNCJYbFVLr9K0TZjO9f-w9-kz0k6uHuMG4dXNtjBLcukkOxoOSLnLgLLbgzqYiiA_dV_WTs6q6ZQLTMgy2S3ZrzXzbdVIuhm0-0HB2FUxVYGRNk8hHBfedY6x__XlZ5XeQAwJBpEyR3G577nCB1ekSgi1v5IKca7URZWXjfplWJQPrrH3xAHb81DqsBNY9vjpyLW92u_l6aQuCswcKHZqs2xjJXzEgQ5F22yd1_1UBocQs4fgTdgW1x4JDJzveAK5l1jhhGf3t1n5v2ZybCfoJ6W8yEjyQ-mq-3GvmKlfdE_5Mu5Q_3HzjJCPXRQD1AYXFODXVFijBf1Pc3UfBFE9qU0OETiCcqUkJYdnur_ksG9JWJfSD0HDSX-oc66eVUoCq2oIuMp1YDolbtE3PHuP9y8wTDniN4GV9Mz7ih2RxmsKTi7TS6ahR8upN27_tCb=w1144-h643-no\" alt=\"alt\"></p>\n<p>But that day, I came home wanting a cookie. I wanted something sweet but not too sweet, with a bit of a bite at the end. A cookie with a mysterious past, or a teasing glint in its eye. Something dark and chocolatey - the type of cookie you can only eat one of.</p>\n<p><img src=\"https://lh3.googleusercontent.com/tDNRX2Wi-fka7hhP1svsG1I-tdm_bh7GFfWNR86qVph_UZLC91_ChN_soPvys6l7GGSLCUU2-voWjjfalYL-a4vB2iKfOnJjS55yKAA1WER25A47j9xmpabMAvFEBLSC2OZVD8a6ZYXtnOKtS0ciBbiJnvrWI2ZrZctMieEJOSejwccaBzpuMfvp3vS31jOaAikzWJzDbOKIT2Pw1NrGS2Z6CR5yf6KEl0OHF9aoGP3LmGQmRd8h4Eyuok1ax2f-POHcWPdbzIjsg3cmLNoZPnM2TB3dyKhjqBkKaeOZAYFN8m69Ku7ylExK40QEy3UVRzirG_RygkfoKINt822PNDuP-KZS7cUsy1O6JIdAHrhwgPvufbUbXLWl7bULP_k85suAJE8joiuWOkiB11a-8vxKuvdZbgPmXd7Umg2e78NL1DZ1dmNQTxaqbOBR7b8EPmgl8RRLUtMf5-hCTjuUsMWxBY1bbGRrlVdRgfuuJYSh6aw9629nADPbgCBKOGfraVeWJ1G7gZSL1GDtsRVTc9_7kRIsKbncdKYrtI4AjY0jdCUQZOSjhBWx1N5PjwgSECuL=w362-h643-no\" alt=\"alt\"></p>\n<p>I wanted the kind of cookie that overwhelms you and seduces you at the same time. I wanted the Rhett Butler of cookies, and this is what I got.</p>\n<p>I'd say it's pretty close.</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Spicy Chocolate Cookies</h2>\n    <div class=\"summary\">\n      <p><em>These cookies are fool-proof. I thought the batter was too dry, and that I had cooked them too long, but neither of these things were true. Also, they're so dark, no one will be able to tell if you burn them a little bit. This is not a cookie to fear, but one to embrace, with a tall glass of milk (almond or otherwise) on the side. There are a few different version of this cookie, and as far as I can tell, they are all extremely similar (read: delicious); feel free to experiment and see what works for you!</em></p>\n      <p>Yield: 12 2-inch cookies, 24 1-inch cookies/p>\n    </p></div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">Approx. 1 hour</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4></h4>\n<div class=\"ingredients\"><h4>Cookies</h4>\n          <li class=\"ingredient\">1 2/3 C Flour</li>\n          <li class=\"ingredient\">1/2 C Unsweetened Cacao Powder</li>\n<li class=\"ingredient\">1/2 Tsp. Cayenne Powder</li>\n<li class=\"ingredient\">1/2 Tsp. Cinnamon Powder</li>\n<li class=\"ingredient\">1 Tsp. Baking Soda</li>\n<li class=\"ingredient\">1/4 Tsp. Salt</li>\n<li class=\"ingredient\">1/2 C Canola Oil</li>\n<li class=\"ingredient\">1/4 C Maple Syrup</li>\n<li class=\"ingredient\">1/2 C Granulated Sugar</li>\n<li class=\"ingredient\">3 Tbsp. Milk</li>\n        <h4>Topping</h4>\n          <li class=\"ingredient\">1/4 C Granulated Sugar</li>\n          <li class=\"ingredient\">2 Tsp. Cinnamon</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n        Start by mixing all of your dry ingredients together, until all the spices and cacao are fully incorporated. \n</p><p>Preheat the oven to 350 degrees F. Combine your sugar, oil, maple syrup, and milk, and whisk lightly until incorporated. Make a well in the dry spices and pour the wet ingredients in, mixing until incorporated. The dough should be dense and have a texture reminiscent of wet sand.</p>\n<p>Mix the cinnamon and sugar for the topping. Form the dough into flat disks and press the top of each into the sugar before placing on a lightly oiled baking tin. Let bake for 30 - 40 minutes. Allow to cool completely prior to eating.</p>\n<pre><code>    &lt;/p&gt;\n  &lt;/div&gt; \n&lt;/div&gt;\n</code></pre>\n  </div>\n</div>\n</div></div></div>","feature_image":"https://lh3.googleusercontent.com/klU5ii_yhduVXILSrGppqt714g1XSRSRnF30MCGT-oGblTAqhcdzVoPoX6tTkW0J0l7Tb_y5YMJApIm2OGEK8tbMU_XNEVhc7cW5QvYnReH_rcid8iKduKSC5LgkS4R2s0Hal9O4Pl2kF-z3eosW5penH176HMm1j0Boxrp1EHMCeaUFAJDm_LSJybLhap6Nx51yfJxi5aG2S319wTEgEg-s_FKg0J0uzkINewzfoQnRlqlq4K3ZkyYRMaBmX7lcccZSvRVzVMavHTMjXWTZL50FBXqpyuarofy5rLxrD4pNvmKBmzox-mmIqTVkcojIwCuX7MlKbvPGQgDFdfcmgbzoi4wnYNc65_qds7HtWtSYihPqH_zOwG95zWEwtY4SMc8cAXIvxuWf5QKqrV-KM9-0CsdkUVwf4Z6fqBVOGG5QxIfHPzCNq_AE9Y4NfBwIJqhii5ECG-LRP0MgcLS5ti4l0GRm4CNTecS8Nlreyw4ARdox2MSKW6GkaZYdQ7OQLJHTglAq2GawyZJ7t3rv5Xz3od5gqmbHLQ0U5sxqwZwzBAK84EHktCG04ZdKPC_a2grk=w362-h643-no","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2a8","name":"sugar rush","slug":"sugar-rush"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c351","uuid":"4080fb6c-a3b5-40a7-b378-db7d61633324","title":"Challenge Accepted","slug":"challenge-accepted","published_at":"02 January, 2016","html":"<p>Welcome to 2016!</p>\n<p>2015 was interesting year for us, and we want to make sure that in the future, the blog reflects our lives a bit more. For example, I (Anu) spent half the year in India, but you guys never read about my adventures with street food, or my quest to find the best masala dosas in Bangalore. While Sumu kept you all a bit more updated on her goings on, the fact is, we both want to do better.</p>\n<p>So with that in mind, we're challenging ourselves to post once a week each in 2016! You'll be getting a new post from Sumu on Wednesdays, and Anu on Sundays. We'll be sharing bits of our lives and kitchens all year, and in the interest of accountability, we've decided to implement some penalties for failure to deliver.</p>\n<p>Offense 1: Donate ten dollars to a slush fund that we will donate to a charity at the end of the year! Every other penalty on the list is also accompanied by this, so there's potential for us to donate 80 at the end of the year.</p>\n<p>Offense 2: The innocent party gets to pick 1 song for you to listen to during your entire commute.</p>\n<p>Offense 3: The innocent party gets to take a picture or pictures with puppies and send it to the offender, to show them what they're missing.</p>\n<p>Offense 4: The Chopped Challenge; the innocent party assigned the offending party a random list of ingredients, from which they must produce and consume a meal. The production of said meal must be videotaped for the innocent party's viewing pleasure.</p>\n<p>Any offenses over and above this will result in the offending party having to complete a dare that is entirely up to the whim of the innocent party. So that's pretty terrifying. All posts will also include the tag #challenge2016 so you can also check up on us.</p>\n<p><strong>May the force be with you</strong></p>\n<p>We hope you're as excited as we are :)<br>\nSumu and Anu</p>\n<p><img src=\"https://lh3.googleusercontent.com/VZbmOFixe3qVzvC-U7QLvsJcUQeV79GACQl0DPf4gIEKj5oFw27pplxZG6e1UwB7s_FujTfxfHLTyyyLxZlceDET3cC5gD0aItG1FYd_Dl3d1Vo5KWKx5cOJMcvvEjvbNx3-CHg90QmtpBpwjaJvZ7qX6L16KXL1j-nl1JUOuP_HbuqTTLdH0v2FoABqTx6Cmlp5DIvvzZ5YJwxsdmBX9a3uA2mhKdPDd_7covcnCiXsSMakXWaDPFBl5_J2B8joh-lgKgRfACEZrQSLTpPeULuOT5cJuEmxqw-MPQNb50K3P7M5vHgqL1o34_uVf9m5FLevjSWsaz-Ykx_FXq20bTABd10Q7X4P0Bal0NIYMYQ3vaK3Xdi1qcrGtrLhd6C4Yag0d-aq2iqEIj6T39RtlKWMG9jfJWGDpnqGmTn4QDPf3oP-2It0WMFM8TcGvlKOPF41SIHmTpSGmt0Lvc4vpqYHYJ8IuH5KDyJmi87gycu2hiMeqG9Lb1eX971UPP4hXwDfcAyWK2s1mWmmCPsglA4SHXtUntmi7xsfPsIfbxt4VEpf-FrzqtjqlWQaSzrC1Ceu_g=w353-h546-no\" alt=\"\"></p>\n<p>NOTE: I (Sumu) have done a complete redesign of the blog so please email me @ <a href=\"mailto:sumu@cookinginpjs.com\">sumu@cookinginpjs.com</a> if you've got any thoughts/bugs/general comments about it so I can address them ASAP! Thanks and Enjoy!</p>\n","feature_image":"https://lh3.googleusercontent.com/M5419MoPiaFyC2XgHnxDAf99IksEcWU37d40IalYRH94Wapcd6ciC14x2WQLvG03lWYoQX_Uwb6jGUURtVJH7Lq9o6r0Gn5B0_bFEu9-1SLwIQo-bZ50ANJg31mW77lmKy0-6aMCt0ubf3MQfGa_X938ufNZNJd3pFDH8T3fSlcD6pHIQb-7791O7iWzpBE5E94gD-4Ggcpto1Jb2OxgfFI7TzHTBd10Jc2GQp_txHOOwYIEuXNkKf-owKXQmNTcNdOvjPFLJBSbvC1cQNXsevRNex5LpSy20-DBbbymh9NdKsQH95Px46UqyIOA-3TdMn6ALT5GX0YtkNbygrUhYvQszcMFR0QEXkxmo-IFNOdb-_E3ZYZnbhUseSV_oaeppP-eWH-lwIAp0KrpDfW1UwGbyd6NteW9_HlD9Q_ECqOz5HquabMPJv0jkaAz4r5FNcvoH2PcmPxWW_cKpS7c2HqjQVrssItea_fqbjnvHAXD35dAFnPZkZbHNz2lJXUNgyh4UxSCcKWLYHsZC7s14T66vX5pY96VTd1-ZpyNkcillReAM8FhbQ-qaxad5hXXbU86bw=w353-h546-no","tags":[{"id":"5c47a6f22037ef002282c2a5","name":"new years","slug":"new-years"},{"id":"5c47a6f22037ef002282c2a6","name":"challenge2016","slug":"challenge2016"},{"id":"5c47a6f22037ef002282c2a7","name":"redesign","slug":"redesign"}]}}]}},"pageContext":{"limit":6,"skip":30,"numPages":10,"currentPage":6}}