{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c346","uuid":"6f57be9e-a31d-449e-ba29-b0f2b7c8535e","title":"Galentine's Day Cupcakes","slug":"galentines-day-cupcakes","published_at":"01 May, 2015","plaintext":"\n\nWhat's Galentine's Day you ask? No one could have answered that question better\nthan Amy Poehler herself, \"it's only the best day of the year. Every February\n13th, my lady friends and I leave our husbands and our boyfriends at home, and\nwe just come and kick it, breakfast-style. Ladies celebrating ladies. It's like\nLilith Fair, minus the angst. Plus frittatas.\"\n\nEver year on Valentine's Day, my mom sends me a special gift. When I lived it at\nhome, she used to give me and my brother cute small stuffed animals with hearts\non them. When I moved to Ann Arbor for college, she took a different approach.\nEvery year, she would send me a heart shaped pizza with my favorite toppings,\nMUSHROOMS!\n\nThis past Valentine's Day, however, I was in India so neither was possible. So\nmy cousins and I decided to celebrate Galentine's Day instead! We made some\ndelicious red velvet cupcakes from scratch, enjoyed some leftover batter, and\nwatched some light hearted chick flicks. All in all, a great way to celebrate\nour fellow ladies.\n\n\n\nWe were pretty lazy about experimenting with the recipe so I will just leave you\nwith the recipe we used\n[http://sallysbakingaddiction.com/2014/10/29/red-velvet-cupcakes/]  for the\ncupcakes and made a basic chocolate icing following the instructions on the bag\nof confectioners sugar.\n\n\n\n\n\n\n\n\"February 14th, Valentine's Day, is about romance. But February 13th,\nGalentine's Day, is about celebrating lady friends. It's wonderful and it should\nbe a national holiday.\"\n\n * Leslie Knope","feature_image":"https://farm9.staticflickr.com/8573/16406140367_5c5b265be3_b.jpg","tags":[{"id":"5c47a6f22037ef002282c253","name":"cupcakes","slug":"cupcakes"},{"id":"5c47a6f22037ef002282c254","name":"galentines day","slug":"galentines-day"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c256","name":"red velvet","slug":"red-velvet"},{"id":"5c47a6f22037ef002282c257","name":"valentines day","slug":"valentines-day-2"}]}}]}},"pageContext":{"slug":"galentines-day","limit":6,"skip":0,"numPages":1,"currentPage":1}}