{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c358","uuid":"9e154487-bd40-42d8-b6a9-c7b35fe895a0","title":"DAMN SON, Those are Some Seriously Loaded Fries","slug":"damn-son-those-are-some-seriously-loaded-fries","published_at":"10 March, 2015","plaintext":"\n\nFor the few weeks, I've been bored at home while my parents are away at work.\nI've been taking some time off between graduation and when I start work next\nmonth. So when one of my friends was also bored at home during her spring break,\nshe decided to come over and join me in being a bum for a day. And what better\nfood to have while lazing around then some Mexican loaded fries.\n\n\n\nFeel free to use sour cream instead of ranch or even add guacamole and other\ntoppings you usually put on nachos! We didn't really want to leave the house and\ngo grocery shopping, so we went with whatever was in the fridge. I usually make\nmy own mexican seasoning, but feel free to replace the spices with a store\nbought seasoning if you want.\n\n\n\nMexican Loaded Fries\nThis is a very rough recipe. Feel free to throw in whatever you feel would taste\nbest!\n\nIngredients:\n½ bag of fries (I used crinkle cut)\n ranch (or sour cream)\n as much shredded cheese as you wantRefried Beans\n1 can black beans\n 1½ teaspoons cumin powder\n 1 teaspoon paprika\n salt to taste\n cayenne pepper to taste\n chili lime hot sauce to taste (optional)Pico De Gallo Salsa\n3 roma tomatoes diced\n ½ large onion diced\n juice of ½ a lime\n salt to taste\n few sprigs of cilantro Directions:\nRefried Beans:  Pour the black beans onto a skillet on the stove. Add all of the\nspices and keep stirring until the beans are soft and are super flavorful.\n\nSalsa:Mix all the ingredients in a bowl and let it sit so that the salt and lime\ncan bring out the flavor in the tomatoes.\n\nBake the fries according to the directions on the packet. When the fries are\ndone, don't turn off the oven. Top with the bean mixture and sprinkle all the\ncheese that your heart desires. Bake the topped fries in the oven until the\ncheese has melted. Take out the fries and top with salsa and ranch. Dig in!","feature_image":"https://farm9.staticflickr.com/8593/16708191675_41a59d93bf_b.jpg","tags":[{"id":"5c47a6f22037ef002282c233","name":"fries","slug":"fries"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c243","name":"mexican","slug":"mexican"},{"id":"5c47a6f22037ef002282c25e","name":"salsa","slug":"salsa"},{"id":"5c47a6f22037ef002282c25f","name":"beans","slug":"beans"},{"id":"5c47a6f22037ef002282c260","name":"appetizers","slug":"appetizers"},{"id":"5c47a6f22037ef002282c261","name":"loaded","slug":"loaded"}]}}]}},"pageContext":{"slug":"appetizers","limit":6,"skip":0,"numPages":1,"currentPage":1}}