{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c382","uuid":"3ef7f523-4fb4-48a5-9fef-b4252d38d598","title":"Vegan Love Triangles","slug":"love_triangles","published_at":"18 January, 2016","html":"<p>When I was making these pastries and trying to find a name for them, I kept drawing a blank. They weren't tarts, they weren't REALLY puff pastry either, and I couldn't figure out what to call them. And then, as I was talking to a friend about it, we got into a conversation about euphemisms, and the ones we both favor. Hot box got thrown around a bit, but then we hit on the perfect name. Visually accurate (the pastries are triangles) and a little silly.</p>\n<p><img src=\"https://pramods.box.com/shared/static/praw2vkc61bu1p72w4hn5xgo6d1t6au8.jpg\" alt=\"alt\"></p>\n<p>Love Triangles.</p>\n<p>And look, I know it says vegan up there at the top, and I can hear what you're thinking: you don't usually like vegan pastry! It's dry, or it's weird, and are there lentils in there because you heard that vegans put lentils in everything!</p>\n<p><img src=\"https://pramods.box.com/shared/static/uadohrf9za1k4nditck5cldqmhr0ea7e.jpg\" alt=\"alt\"></p>\n<p>But these pastries don't taste vegan. I think there's this idea that vegan food has to be healthy, and taste healthy, and while I would definitely advocate for healthy food generally, that's not the case here. This recipe is full of lovely fats in the form of coconut oil, and yummy yummy carbs. It's delicious. You won't believe it's not butter in there. The pastry is flaky and crisp at the same time, the apples are tender and perfectly cooked, and the pecans add a hint of interest inside.</p>\n<p><img src=\"https://pramods.box.com/shared/static/fk0f07cwosnzlj8tc0a9uchxdyegmsxz.jpg\" alt=\"alt\"></p>\n<p>It's a teeny weeny pie to warm the bits of your soul that have been snowed into. In the middle of winter, when you come in from the cold, these are the perfect bits to warm your hands and your stomach as you cuddle into your couch with a warm cup of tea.</p>\n<div class=\"recipe\">\n  <div class=\"recipe-header\">\n    <h2 class=\"fn\">Love Triangles</h2>\n    <div class=\"summary\">\n      <p><em>These take a bit of time, but the end result is well worth it. Just note that the chilling instructions aren't really optional; the whole point is to keep the coconut oil intact throughout the preparation, so that when it gets into the oven, it melts into the pastry creating flakiness and richness. Without chilling items appropriately, the dough becomes too difficult to work with, and it doesn't cook properly in the oven. So. Chill out. Chill your dough, chill your baking trays, chill your filling. Your stomach will thank you later.</em></p>\n      <p>Yield: 16 mini pastries</p>\n    </div>\n    <div class=\"time\">\n      <p><strong>Total Time:</strong> <span class=\"duration\">1 hour active, four hours passive</span></p>\n    </div>\n  </div>\n  <div class=\"recipe-body\">\n    <div class=\"left\">\n      <h3 id=\"ingredients\">Ingredients:</h3>\n      <div class=\"ingredients\"><h4>Pastry Dough</h4>\n          <li class=\"ingredient\">2 C Unbleached All Purpose Flour</li>\n<li class=\"ingredient\">1 teaspoon salt</li>\n<li class=\"ingredient\">3/4 C Coconut Oil, cold but pliable</li>\n<li class=\"ingredient\">Ice Water, 1/4 cup - 1 cup, as needed</li>\n        <h4>Filling</h4>\n          <li class=\"ingredient\">4 Medium Apples, preferably a variety, cored and grated</li>\n          <li class=\"2/3 C Sugar</li>\n<li class=\" ingredient\"=\"\">1/2 Tsp. Cinnamon</li>\n<li class=\"ingredient\">1/2 Tsp. All-Spice</li>\n<li class=\"ingredient\">1/2 Tsp. Nutmeg</li>\n<li class=\"ingredient\">1/2 Tsp. Cardamom</li>\n<li class=\"ingredient\">1/2 Tsp. Black Pepper</li>\n<li class=\"ingredient\">1/2 Tsp. Ginger</li>\n<li class=\"ingredient\">1/2 Tsp. Orange Extract</li>\n<li class=\"ingredient\">1 Tsp. Vanilla Extract</li>\n<li class=\"ingredient\">2 Tsp. Lime Juice</li>\n<li class=\"ingredient\">1 C Chopped Pecans</li>\n      </div>\n    </div>\n    <div class=\"right\">\n      <h3 id=\"directions\">Directions:</h3>\n      <div class=\"instructions\">\n        <p>\n        1.) Put flour and salt in a mixing bowl, and mix together thoroughly. Add the coconut oil and crumble it in with your fingers, until you have a mixture that looks a little sandy - the coconut oil should not disappear completely, but should be in small pea-sized or smaller chunks. Add ice water a tablespoon at a time until you have a dough that's smooth, not too dry, and fairly elastic.\n</p><p> \n2.) Roll out the dough into a rectangle, about 6x11. Fold the two short ends in, so that you have a rectangle one third the size of the original. Then roll it out again to roughly the same size, and fold again from the short ends. Repeat this process seven or eight times - this is what creates the layers in your pastry, and I found that while this method takes time, it was not too strenuous and yielded good results. \n</p><p> \n3.) Wrap the dough in plastic wrap and refrigerate. Let chill for a minimum of four hours. This dough can be chilled for several days, so it works really well if you're trying to make it in advance. \n</p><p> \n4.) Now it's time for the filling! Put your cored and grated apples into a saucepan, and turn on the heat. Add sugar and spices, and mix thoroughly. Allow the apples to become soft and fragrant; any juice produced should evaporate, so that you have mixture without extra moisture.\n</p><p>\n5.) Once apples are cooked through, add extracts and cook for one minute. Take off the heat and add lime juice and pecans. Stir completely before setting in fridge to chill. The filling needs to be cold before you make your pastries, so that it doesn't melt the coconut oil prematurely. \n</p><p>\n6.) Grease two cookie trays with coconut oil and chill in the fridge or freezer.\n</p><p> \n7.) Let three - four hours pass. Read a book. Take a long walk, or a short hike. Watch some television, or make animals out of passing clouds. \n</p><p> \n8.) Preheat the oven to 375 degrees. Take your chilled dough out of the fridge and cut into 16 pieces with a sharp knife. Take one piece and roll it into a ball, and set on a floured surface. Roll it out into a circle about 4 - 5 inches in diameter. \n</p><p>\n9.) Place about a tablespoon of filling in the middle of the circle, and dot the circumference with water, to make sure it sticks. Fold the dough on three sides, so that the base forms a triangle. Press the dough together as shown in the pictures below, so that the seams meet in the center. Set it onto your chilled baking sheet. Repeat with remaining dough and filling. You might have some filling leftover, depending on the size of your apples. \n![alt](https://pramods.box.com/shared/static/a5avl89yja4umc0kd06f96jnrymm9c1s.jpg)\n</p><p>\n10.) Bake for thirty five - forty five minutes. The tops should be golden brown and crispy, and some of the apple juices will escape onto the tray. That's okay. \n</p><p> \n11.) When they're done, take them out, and wait for them to cool. Or, if you're like me, pick one up, bite in, mouth breathe until it cools, and then lament the fact that your burned the roof of your mouth. It's fine. These taste great with a bit of vanilla ice cream (vegan or otherwise), a warm cup of tea, or just on their own as well.  \n        </p>\n      </div>\n    </div>\n  </div>\n</div>","feature_image":"https://pramods.box.com/shared/static/praw2vkc61bu1p72w4hn5xgo6d1t6au8.jpg","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2b4","name":"warmapplepie","slug":"warmapplepie-2"},{"id":"5c47a6f22037ef002282c2b5","name":"allamerican","slug":"allamerican-2"},{"id":"5c47a6f22037ef002282c2b6","name":"vegan","slug":"vegan-2"},{"id":"5c47a6f22037ef002282c2b7","name":"veganpastry","slug":"veganpastry-2"},{"id":"5c47a6f22037ef002282c2bc","name":"pastry","slug":"pastry"},{"id":"5c47a6f22037ef002282c2bd","name":"puffpastry","slug":"puffpastry"},{"id":"5c47a6f22037ef002282c2be","name":"sugarrush","slug":"sugarrush-2"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"},{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"}]}}]}},"pageContext":{"slug":"allamerican-2","limit":6,"skip":0,"numPages":1,"currentPage":1}}