{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c352","uuid":"2fcc0931-b365-4991-99d9-dba71f89352a","title":"WE WILL BE VICTOOOOOORIOUS!","slug":"we-will-be-victoooooorious","published_at":"15 July, 2015","plaintext":"So if you hadn't already seen, I EPICALLY failed at making macarons this past\nweekend.\n\n\n\nThis just made me all the more determined to get them right. And so began the\njourney to successfully make this adorable French delicacy.\n\nTrial 2\nAs you can tell by the song, I FINALLY DID IT!\n\n**pats self on back**\n\n\n\nWell better at least! :P\n\nTurns out all I did wrong was not be patient enough and fail at making the\nmeringue. If I had beaten the eggs longer to a more frothy froth, then the\nbatter would have turned out more solid, WHICH in turn would have not allowed\nthe batter to spill all over the baking sheet.\n\n\n\nYou can't blame me for not making perfect macarons... I'm not THAT patient.\n\n\n\n\n\n\nTrial 3\nHonestly, this batch still bothered me a lot. It I guess technically was\nmacarons but i wasn't able to get the perfect bubble shape. I was determined to\nperfect this recipe!\n\nTHE MACARONS CANNOT WIN!\n\nSo I set out to make batch 3. This time I let the egg whites \"age\" for a few\ndays before using them. And I decided that I would try to be patient and\nactually wait for the meringue to be COMPLETELY done. I had gotten closer last\ntime but not enough.\n\nWhat basically followed was me obsessively watching videos on how to make the\nperfect macarons. (I've provided some of those links here) My cousin literally\nthought I was insane because I watched videos for a good hour (okay maybe it was\nactually 2 hours... don't judge me).\n\nhttp://foodnouveau.com/destinations/europe/france/how-to-make-macarons-a-detailed-illustrated-step-by-step-recipe/\n\nhttp://www.foodiebaker.com/chocolate-macarons/\n\nhttps://www.youtube.com/watch?v=Bri6xnDBl9I\n\nThere are also TONS of other videos on youtube but let's be honest here... how\nmany of you will actually be attempting to make these. If you're REALLY that\ninterested let me know [sumu@cookinginpjs.com].\n\n\n\nThis time, they managed to somewhat retain their poofy-ness.\n\nVICTORY!\n\n\nBut honestly, even while using an electric beater, it took me like 30 minutes to\nget the \"meringue\" to a decent level... and it wasn't even done yet. WAY too\nmuch effort in my opinion.\n\nHowever, they were quite tasty. Nicely crunchy yet light. We slathered some\npeanut butter and munched on a few macaron, or I guess in my case\nmacaron-adjacents.\n\n\n\n\n\n(Yes yes I know I spelled it wrong... I got so excited that I had finally ALMOST\nachieved macarons that I didn't even realize it until just now)","feature_image":"https://lh3.googleusercontent.com/psvMMMMKicZM9X0pohp9fQBgouR0PAdsVyFjhqQcS-vn=w1976-h1316-no","tags":[{"id":"5c47a6f22037ef002282c255","name":"desserts","slug":"desserts"},{"id":"5c47a6f22037ef002282c289","name":"victory","slug":"victory"},{"id":"5c47a6f22037ef002282c28a","name":"almonds","slug":"almonds"},{"id":"5c47a6f22037ef002282c28c","name":"macaron","slug":"macaron"},{"id":"5c47a6f22037ef002282c28d","name":"peanut butter","slug":"peanut-butter"}]}}]}},"pageContext":{"slug":"victory","limit":6,"skip":0,"numPages":1,"currentPage":1}}