{"data":{"site":{"siteMetadata":{"title":"Cooking In Pajamas","siteUrl":"https://www.cookinginpjs.com","description":"Stories and Musings from Wayfaring Adventurers and Aspiring Home Cooks."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c369","uuid":"7be4e4ee-6239-411d-952a-c769fc32ade5","title":"It's DOSA TIME.","slug":"ada-dosa","published_at":"11 January, 2016","plaintext":"I have not always been a fan of dosa. In fact, for years I would only eat it if\nit was accompanied by tanks of chutney (why yes, I would like some dosa with\nthat). But then I tried ada (a-day) dosa, and my life changed.\n\n\n\n\n\nDosa is a south asian savory crepe - type bread. It's made of rice which is\nsoaked, ground, and allowed to ferment. Ada dosa is the simpler, and to me, much\ntastier cousin - made entirely of rice, lentils, and legumes, it is both\nextraordinarily healthy and delicious.\n\n\n\nThis is the food I beg my mom to make every time I visit home, and is one of the\nfirst things I learned to make when I set out on my quest to learn to cook\nIndian food.\n\nAda Dosa\nThe recipe I'm sharing today is one that I know works, but you can substitute\nall the lentils and legumes with pretty much any other lentil or legume. You\njust have to make sure that you soak the hardier legumes (black eyes peas,\nkidney beans, black beans, etc.) overnight, and the lentils and rice for three\nor four hours. It's also important to have a good rice to lentil ratio. You want\nto make sure that approximately one third of the total quantity is rice, so if\nyou have two cups combined of lentils and legumes, you would want one cup of\nrice in there.\nThese dosas can be eaten with yogurt, any chutney or pickle you like, or, if\nyou're so inclined, plain. They would also be wonderful with sauteed vegetables.\n \n\nYield: Approximately 10 10-inch dosas, 3 - 4 servings\n\nTotal Time:  1 hour active, 12 hours passive\n\nIngredients:\n1/2 cup black beans\n 1/2 cup chana dal\n 1/2 cup toor dal\n 1/2 cup split peas\n 1 cup brown rice\n 1 1/2 tbls fresh ginger\n 1/2 tbls whole black pepper\n 1/2 tbls cumin\n 1/2 cup coconut (dry and fresh both fine)\n 1/2 bunch cilantro\n fresh green chili, to taste\n salt, to taste\n Directions:\n\n1.) Soak the black beans the night before, and start soaking the lentils about\nsix hours before you want to eat them.\n\n\n2.) Combine all ingredients including spices in the food processor with the\nwater you soaked them in, and let it run. The resulting mixture shouldn't be too\nrunny or too thick, and will be a little grainy, but not chunky. While it won't\nbe as smooth as pancake batter, the lentils should be broken down quite well.\n\n\n3.) Once your batter is ready, turn on your stove and let a skillet heat with a\nsmall amount of oil. You want the skillet to be hot and the oil covering the\nsurface - if you put your batter on the skillet too soon it will stick! Put a\nsmall amount of batter in the center of your skillet, and careful spread it out\nwith a spiraling motion until it's the desired size. Pour a small amount of oil\n(1/4 teaspoon) on the surface of the dosa, and then cover the pan.\n\n\n4.) Let it cook for three - four minutes, before removing the cover, and\nflipping the dosa so the other side can cook.\n\n\n5.) Cooking time varies based on the stove and the pan you're using, so give\nyourself a bit of leeway here. If your first dosa falls apart (as mine did)\nscrape it off, rinse your skillet, and start fresh - with a bit of trial and\nerror, these become super easy! Once both sides of your dosa are cooked, it's\nready! Pull up a plate and dig in :)","feature_image":"https://lh3.googleusercontent.com/KWBBMYdzG5jqFpPXoOT5tZ1XsclaWzt3q4QXau3omGevmZidRFmpBSyJzvwum8K3YWVTaBFm3A4sgYrTCSYsfqErYq2A1UvLd7xEfm7jSmFkzQUUmjkEVWf5aySOjbmoQApXNZcDaBjGOb19JaK_mmg2KemL_-8Ggno5E-Rzck0QJLwUvBIT_ocr1v_V7iMgvSFZWO5OuPz0fDLU4XpknoQc0F5mueX1giHpDA3HHrUSSys4zeK5hyDv6iyyLnoYi5FbHl7dpEkG4DRQRv0cZvMa3LL_j-sfWNdD6mCGBQvyZFN3txUUgf6TDvqlC--0GXgzZAXVLP-G6Fnu2KK5qXXXJUPjkQz8quqmgBlA317IANaRjhBJ8gSFvd-2WYHySPHE7SPadbtaA6tbxGPxrEFppYuar1bLl4Lw3LbG-ieBLG0Gb_b1QED316YX4aN9VErOpOgI-9IxxhPjWOUIovADqIdpB9U0haOTqsOWUTbUO-kSAN5Zjh05RIqfUhco5hrzNw_Y4B5bQqR-E0OQ6X0e2xOMV5Xo9PWVUA-JxlsQSCb1NNlymaRk_5oR5xKXofyX=w362-h643-no","tags":[{"id":"5c47a6f22037ef002282c2ac","name":"dosa","slug":"dosa"},{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2ad","name":"indian","slug":"indian"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}},{"node":{"id":"Ghost__Post__5c47a6f72037ef002282c37b","uuid":"34b095eb-adc1-4908-9a23-8ec82b8d6103","title":"Spicy Chocolate Cookies","slug":"spicy-chocolate-cookies","published_at":"04 January, 2016","plaintext":"I made these cookies quite a while ago, right after one of my final exams. I\ncame home craving cookies, which is pretty rare - while I like dessert, I've\nnever especially been a cookie person. In most cases, if there's an option\nbetween a cookie or almost any other dessert, I would choose the other dessert.\n\n\n\nBut that day, I came home wanting a cookie. I wanted something sweet but not too\nsweet, with a bit of a bite at the end. A cookie with a mysterious past, or a\nteasing glint in its eye. Something dark and chocolatey - the type of cookie you\ncan only eat one of.\n\n\n\nI wanted the kind of cookie that overwhelms you and seduces you at the same\ntime. I wanted the Rhett Butler of cookies, and this is what I got.\n\nI'd say it's pretty close.\n\nSpicy Chocolate Cookies\nThese cookies are fool-proof. I thought the batter was too dry, and that I had\ncooked them too long, but neither of these things were true. Also, they're so\ndark, no one will be able to tell if you burn them a little bit. This is not a\ncookie to fear, but one to embrace, with a tall glass of milk (almond or\notherwise) on the side. There are a few different version of this cookie, and as\nfar as I can tell, they are all extremely similar (read: delicious); feel free\nto experiment and see what works for you!\n\nYield: 12 2-inch cookies, 24 1-inch cookies/p>\n \n\nTotal Time:  Approx. 1 hour\n\nIngredients:\n\nCookies\n1 2/3 C Flour\n 1/2 C Unsweetened Cacao Powder1/2 Tsp. Cayenne Powder1/2 Tsp. Cinnamon Powder1\nTsp. Baking Soda1/4 Tsp. Salt1/2 C Canola Oil1/4 C Maple Syrup1/2 C Granulated\nSugar3 Tbsp. Milk\n Topping\n1/4 C Granulated Sugar\n 2 Tsp. Cinnamon\n Directions:\n\nStart by mixing all of your dry ingredients together, until all the spices and\ncacao are fully incorporated.\n\nPreheat the oven to 350 degrees F. Combine your sugar, oil, maple syrup, and\nmilk, and whisk lightly until incorporated. Make a well in the dry spices and\npour the wet ingredients in, mixing until incorporated. The dough should be\ndense and have a texture reminiscent of wet sand.\n\nMix the cinnamon and sugar for the topping. Form the dough into flat disks and\npress the top of each into the sugar before placing on a lightly oiled baking\ntin. Let bake for 30 - 40 minutes. Allow to cool completely prior to eating.\n\n    </p>\n  </div> \n</div>","feature_image":"https://lh3.googleusercontent.com/klU5ii_yhduVXILSrGppqt714g1XSRSRnF30MCGT-oGblTAqhcdzVoPoX6tTkW0J0l7Tb_y5YMJApIm2OGEK8tbMU_XNEVhc7cW5QvYnReH_rcid8iKduKSC5LgkS4R2s0Hal9O4Pl2kF-z3eosW5penH176HMm1j0Boxrp1EHMCeaUFAJDm_LSJybLhap6Nx51yfJxi5aG2S319wTEgEg-s_FKg0J0uzkINewzfoQnRlqlq4K3ZkyYRMaBmX7lcccZSvRVzVMavHTMjXWTZL50FBXqpyuarofy5rLxrD4pNvmKBmzox-mmIqTVkcojIwCuX7MlKbvPGQgDFdfcmgbzoi4wnYNc65_qds7HtWtSYihPqH_zOwG95zWEwtY4SMc8cAXIvxuWf5QKqrV-KM9-0CsdkUVwf4Z6fqBVOGG5QxIfHPzCNq_AE9Y4NfBwIJqhii5ECG-LRP0MgcLS5ti4l0GRm4CNTecS8Nlreyw4ARdox2MSKW6GkaZYdQ7OQLJHTglAq2GawyZJ7t3rv5Xz3od5gqmbHLQ0U5sxqwZwzBAK84EHktCG04ZdKPC_a2grk=w362-h643-no","tags":[{"id":"5c47a6f22037ef002282c234","name":"herbivores","slug":"herbivores"},{"id":"5c47a6f22037ef002282c2a8","name":"sugar rush","slug":"sugar-rush"},{"id":"5c47a6f22037ef002282c2c6","name":"anuchallenge2016","slug":"anuchallenge2016"}]}}]}},"pageContext":{"slug":"anuchallenge2016","limit":6,"skip":12,"numPages":3,"currentPage":3}}